esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_ERR_EOF_DES_ADDR_CH%s</name>
          <description>Receive descriptor address when errors occur of RX channel %s</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_ERR_EOF_DES_ADDR_CH</name>
              <description>Represents the address of the receive descriptor when there are some errors in the currently received data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH0</name>
          <description>RX_done Inlink descriptor address of RX channel 0</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH0</name>
              <description>Represents the address of the inlink descriptor when  this descriptor is completed .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_DSCR_CH%s</name>
          <description>Current receive descriptor address of RX channel %s</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_CH</name>
              <description>Represents the address of the next receive descriptor x+1 pointed by the current receive descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_DSCR_BF0_CH%s</name>
          <description>The last receive descriptor address of RX channel %s</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF0_CH</name>
              <description>Represents the address of the current receive descriptor x that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_DSCR_BF1_CH%s</name>
          <description>The second-to-last receive descriptor address of RX channel %s</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INLINK_DSCR_BF1_CH</name>
              <description>Represents the address of the previous receive descriptor x-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_PRI_CH%s</name>
          <description>Priority register of RX channel %s</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_PRI_CH</name>
              <description>Configures the priority of RX channel %s.The larger of the value, the higher of the priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>IN_PERI_SEL_CH%s</name>
          <description>Peripheral selection register of RX channel %s</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>PERI_IN_SEL_CH</name>
              <description>Configures the peripheral connected to RX channel %s.\\ 0: SPI3\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: AES\\ 5: Sample_rate_convert-0\\ 6:  Sample_rate_convert-1\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>RX_CH_ARB_WEIGH_CH%s</name>
          <description>RX channel %s arbitration weight configuration register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_CH_ARB_WEIGH_CH</name>
              <description>Configures the weight(i.e the number of tokens) of RX channel%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>RX_ARB_WEIGH_OPT_DIR_CH%s</name>
          <description>RX channel %s weight arbitration optimization enable register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT_CONF0_CH0</name>
          <description>Configuration register 0 of TX channel 0</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH0</name>
              <description>Configures the reset state of AHB_DMA channel 0 TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH0</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH0</name>
              <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH0</name>
              <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel 0 is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel 0 is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH0</name>
              <description>Configures whether to enable INCR burst transfer for TX channel 0 reading descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH0</name>
              <description>Configures whether to enable ETM control for TX channel 0.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DATA_BURST_MODE_SEL_CH0</name>
              <description>Configures max burst size for TX channel0.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_CONF1_CH%s</name>
          <description>Configuration register 1 of TX channel %s</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_CHECK_OWNER_CH</name>
              <description>Configures whether to enable owner bit check for TX channel %s.\\0: Disable\\1: Enable\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUTFIFO_STATUS_CH%s</name>
          <description>Transmit FIFO status of TX channel %s</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0x7800002</resetValue>
          <fields>
            <field>
              <name>OUTFIFO_FULL_CH</name>
              <description>Represents whether L1 TX FIFO is full.\\0: Not Full\\1: Full\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_EMPTY_CH</name>
              <description>Represents whether L1 TX FIFO is empty.\\0: Not empty\\1: Empty\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_CNT_CH</name>
              <description>Represents the number of data bytes in L1 TX FIFO for TX channel %s.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_1B_CH</name>
              <description>Reserved.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_2B_CH</name>
              <description>Reserved.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_3B_CH</name>
              <description>Reserved.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_REMAIN_UNDER_4B_CH</name>
              <description>Reserved.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_PUSH_CH%s</name>
          <description>Push control register of TX channel %s</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTFIFO_WDATA_CH</name>
              <description>Configures the data that need to be pushed into AHB_DMA FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_PUSH_CH</name>
              <description>Configures whether to push data into AHB_DMA FIFO.\\0: Invalid. No effect\\1: Push\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_LINK_CH%s</name>
          <description>Linked list descriptor configuration and control register of TX channel %s</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUTLINK_STOP_CH</name>
              <description>Configures whether to stop AHB_DMA's TX channel %s from transmitting data.\\0: Invalid. No effect\\1: Stop\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_START_CH</name>
              <description>Configures whether to enable AHB_DMA's TX channel %s for data transfer.\\0: Disable\\1: Enable\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_RESTART_CH</name>
              <description>Configures whether to restart TX channel %s for AHB_DMA transfer.\\0: Invalid. No effect\\1: Restart\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OUTLINK_PARK_CH</name>
              <description>Represents the status of the transmit descriptor's FSM.\\0: Running\\1: Idle\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_LINK_ADDR_CH%s</name>
          <description>Link list descriptor address configuration of TX channel %s</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_ADDR_CH</name>
              <description>Configures the 32 bits of the first receive descriptor's address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_STATE_CH%s</name>
          <description>Transmit status of TX channel %s</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_ADDR_CH</name>
              <description>Represents the lower 18 bits of the address of the next transmit descriptor to be processed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DSCR_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_STATE_CH</name>
              <description>reserved</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_EOF_DES_ADDR_CH%s</name>
          <description>Transmit descriptor address when EOF occurs on TX channel %s</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_DES_ADDR_CH</name>
              <description>Represents the address of the transmit descriptor when the EOF bit in this descriptor is 1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_EOF_BFR_DES_ADDR_CH%s</name>
          <description>The last transmit descriptor address when EOF occurs on TX channel %s</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_EOF_BFR_DES_ADDR_CH</name>
              <description>Represents the address of the transmit descriptor before the last transmit descriptor.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DONE_DES_ADDR_CH%s</name>
          <description>TX done outlink descriptor address of TX channel %s</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUT_DONE_DES_ADDR_CH</name>
              <description>Represents the address of the outlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_CH%s</name>
          <description>Current transmit descriptor address of TX channel %s</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_CH</name>
              <description>Represents the address of the next transmit descriptor y+1 pointed by the current transmit descriptor that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_BF0_CH%s</name>
          <description>The last transmit descriptor address of TX channel %s</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF0_CH</name>
              <description>Represents the address of the current transmit descriptor y that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_DSCR_BF1_CH%s</name>
          <description>The second-to-last transmit descriptor address of TX channel %s</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>OUTLINK_DSCR_BF1_CH</name>
              <description>Represents the address of the previous transmit descriptor y-1 that has already been fetched.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_PRI_CH%s</name>
          <description>Priority register of TX channel %s</description>
          <addressOffset>0x1b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_PRI_CH</name>
              <description>Configures the priority of TX channel %s.The larger of the value, the higher of the priority.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>OUT_PERI_SEL_CH%s</name>
          <description>Peripheral selection register of TX channel %s</description>
          <addressOffset>0x1b8</addressOffset>
          <size>32</size>
          <resetValue>0x3f</resetValue>
          <fields>
            <field>
              <name>PERI_OUT_SEL_CH</name>
              <description>Configures the peripheral connected to TX channel %s.\\ 0: SPI3\\ 1: SPI2\\ 2: UHCI0\\ 3: I2S0\\ 4: AES\\ 5: Sample_rate_convert-0\\ 6:  Sample_rate_convert-1\\ 7: SHA\\ 8: ADC_DAC\\ 9: PARL_IO\\ 10: Dummy\\ 11~15: Dummy\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>TX_CH_ARB_WEIGH_CH%s</name>
          <description>TX channel %s arbitration weight configuration register</description>
          <addressOffset>0x1bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_CH_ARB_WEIGH_CH</name>
              <description>Configures the weight(i.e the number of tokens) of TX channel%s</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>5</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>TX_ARB_WEIGH_OPT_DIR_CH%s</name>
          <description>TX channel %s weight arbitration optimization enable register</description>
          <addressOffset>0x1c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TX_ARB_WEIGH_OPT_DIR_CH</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
