esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>IN_DONE_DES_ADDR_CH1</name>
          <description>RX_done inlink descriptor address of RX channel 1</description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH1</name>
              <description>Represents the address of the inlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x100</dimIncrement>
          <dimIndex>1,2,3,4</dimIndex>
          <name>OUT_CONF0_CH%s</name>
          <description>Configuration register 0 of TX channel %s</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <resetValue>0x8</resetValue>
          <fields>
            <field>
              <name>OUT_RST_CH</name>
              <description>Configures the reset state of AHB_DMA channel %s TX FSM and TX FIFO pointer.\\0: Release reset\\1: Reset\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_LOOP_TEST_CH</name>
              <description>Reserved.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_AUTO_WRBACK_CH</name>
              <description>Configures whether to enable automatic outlink write-back when all the data in TX FIFO has been transmitted.\\0: Disable\\1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_EOF_MODE_CH</name>
              <description>Configures when to generate EOF flag.\\0: EOF flag for TX channel %s is generated when data to be transmitted has been pushed into FIFO in AHB_DMA.\\ 1: EOF flag for TX channel %s is generated when data to be transmitted has been popped from FIFO in AHB_DMA.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTDSCR_BURST_EN_CH</name>
              <description>Configures whether to enable INCR burst transfer for TX channel %s reading descriptors.\\0: Disable\\1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_ETM_EN_CH</name>
              <description>Configures whether to enable ETM control for TX channel %s.\\0: Disable\\1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DATA_BURST_MODE_SEL_CH</name>
              <description>Configures max burst size for TX channel%s.\\2'b00: single\\ 2'b01: incr4\\ 2'b10: incr8\\ 2'b11: incr16\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH2</name>
          <description>RX_done inlink descriptor address of RX channel 2</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH2</name>
              <description>Represents the address of the inlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH3</name>
          <description>RX_done inlink descriptor address of RX channel 3</description>
          <addressOffset>0x424</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH3</name>
              <description>Represents the address of the inlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IN_DONE_DES_ADDR_CH4</name>
          <description>RX_done inlink descriptor address of RX channel 4</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IN_DONE_DES_ADDR_CH4</name>
              <description>Represents the address of the inlink descriptor when this descriptor is completed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_START_ADDR</name>
          <description>Accessible address space start address configuration register</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_START_ADDR</name>
              <description>Configures the start address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTR_MEM_END_ADDR</name>
          <description>Accessible address space end address configuration register</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>ACCESS_INTR_MEM_END_ADDR</name>
              <description>Configures the end address of accessible address space.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_TIMEOUT</name>
          <description>TX arbitration timeout configuration register</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARB_TIMEOUT</name>
              <description>Configures the time slot. Measurement unit: AHB bus clock cycle.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WEIGHT_EN</name>
          <description>TX weight arbitration enable register</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WEIGHT_EN</name>
              <description>Configures whether to enable weight arbitration.\\0: Disable\\1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODULE_CLK_EN</name>
          <description>Module clock force on register</description>
          <addressOffset>0x618</addressOffset>
          <size>32</size>
          <resetValue>0x19ffffff</resetValue>
          <fields>
            <field>
              <name>AHB_APB_SYNC_CLK_EN</name>
              <description>Configures whether to force on ahb_apb_sync 4~0 module clock. For bit n:\\0 : Not force on ahb_apb_sync n clock \\1 : Force on ahb_apb_sync n clock\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_DSCR_CLK_EN</name>
              <description>Configures whether to force on out_dscr 4~0 module clock. For bit n:\\0 : Not force on out_dscr n clock \\1 : Force on out_dscr n clock\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT_CTRL_CLK_EN</name>
              <description>Configures whether to force on out_ctrl 4~0 module clock. For bit n:\\0 : Not force on out_ctrl n clock \\1 : Force on out_ctrl n clock\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_DSCR_CLK_EN</name>
              <description>Configures whether to force on in_dscr 4~0 module clock. For bit n:\\0 : Not force on in_dscr n clock \\1 : Force on in_dscr n clock\\</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IN_CTRL_CLK_EN</name>
              <description>Configures whether to force on in_ctrl 4~0 module clock. For bit n:\\0 : Not force on in_ctrl n clock \\1 : Force on in_ctrl n clock\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CMD_ARB_CLK_EN</name>
              <description>Configures whether to force on cmd_arb module clock. \\0 : Not force on cmd_arb clock \\1 : Force on cmd_arb clock\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHBINF_CLK_EN</name>
              <description>Configures whether to force on ahbinf module clock. \\0 : Not force on ahbinf clock \\1 : Force on ahbinf clock\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBINF_RESP_ERR_STATUS0</name>
          <description>AHB response error status 0 register</description>
          <addressOffset>0x620</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AHBINF_RESP_ERR_ADDR</name>
              <description>Represents the address of the AHB response error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBINF_RESP_ERR_STATUS1</name>
          <description>AHB response error status 1 register</description>
          <addressOffset>0x624</addressOffset>
          <size>32</size>
          <resetValue>0x1e</resetValue>
          <fields>
            <field>
              <name>AHBINF_RESP_ERR_WR</name>
              <description>Represents the AHB response error is write request.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBINF_RESP_ERR_ID</name>
              <description>Represents the AHB response error request id.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBINF_RESP_ERR_CH_ID</name>
              <description>Represents the AHB response error request channel id.bit[3]=1:TX channel.\\bit[3]=0:RX channel.\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
