esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>L1_ICACHE3_PRELOCK_CONF</name>
          <description>L1 instruction Cache 3 prelock configure register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L1-ICache3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L1-ICache3.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l1 icache3 prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOCK_SCT0_ADDR</name>
          <description>L1 instruction Cache 3 prelock section0 address configure register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOCK_SCT1_ADDR</name>
          <description>L1 instruction Cache 3 prelock section1 address configure register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE3_PRELOCK_SCT_SIZE</name>
          <description>L1 instruction Cache 3 prelock section size configure register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x3fff3fff</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE3_PRELOCK_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT0_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE3_PRELOCK_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section of prelock on L1-ICache3, which should be used together with L1_ICACHE3_PRELOCK_SCT1_ADDR_REG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOCK_CONF</name>
          <description>L1 data Cache prelock configure register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOCK_SCT0_EN</name>
              <description>The bit is used to enable the first section of prelock function on L1-DCache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOCK_SCT1_EN</name>
              <description>The bit is used to enable the second section of prelock function on L1-DCache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOCK_RGID</name>
              <description>The bit is used to set  the gid of l1 dcache prelock.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOCK_SCT0_ADDR</name>
          <description>L1 data Cache prelock section0 address configure register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOCK_SCT0_ADDR</name>
              <description>Those bits are used to configure the start address of the first section of prelock on L1-DCache, which should be used together with L1_DCACHE_PRELOCK_SCT0_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOCK_SCT1_ADDR</name>
          <description>L1 data Cache prelock section1 address configure register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOCK_SCT1_ADDR</name>
              <description>Those bits are used to configure the start address of the second section of prelock on L1-DCache, which should be used together with L1_DCACHE_PRELOCK_SCT1_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_DCACHE_PRELOCK_SCT_SIZE</name>
          <description>L1 data Cache prelock section size configure register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0x3fff3fff</resetValue>
          <fields>
            <field>
              <name>L1_DCACHE_PRELOCK_SCT0_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-DCache, which should be used together with L1_DCACHE_PRELOCK_SCT0_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_DCACHE_PRELOCK_SCT1_SIZE</name>
              <description>Those bits are used to configure the size of the second section of prelock on L1-DCache, which should be used together with L1_DCACHE_PRELOCK_SCT1_ADDR_REG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK_CTRL</name>
          <description>Lock-class (manual lock) operation control register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LOCK_ENA</name>
              <description>The bit is used to enable lock operation. It will be cleared by hardware after lock operation done. Note that (1) this bit and unlock_ena bit are mutually exclusive, that is, those bits can not be set to 1 at the same time. (2) lock operation can be applied on LL1-ICache, L1-DCache and L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK_ENA</name>
              <description>The bit is used to enable unlock operation. It will be cleared by hardware after unlock operation done. Note that (1) this bit and lock_ena bit are mutually exclusive, that is, those bits can not be set to 1 at the same time. (2) unlock operation can be applied on L1-ICache, L1-DCache and L2-Cache.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_DONE</name>
              <description>The bit is used to indicate whether unlock/lock operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_RGID</name>
              <description>The bit is used to set  the gid of cache lock/unlock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK_MAP</name>
          <description>Lock (manual lock) map configure register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOCK_MAP</name>
              <description>Those bits are used to indicate which caches in the two-level cache structure will apply this lock/unlock operation. [0]: L1-ICache0, [1]: L1-ICache1, [2]: L1-ICache2, [3]: L1-ICache3, [4]: L1-DCache, [5]: L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK_ADDR</name>
          <description>Lock (manual lock) address configure register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOCK_ADDR</name>
              <description>Those bits are used to configure the start address of the lock/unlock operation, which should be used together with CACHE_LOCK_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK_SIZE</name>
          <description>Lock (manual lock) size configure register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LOCK_SIZE</name>
              <description>Those bits are used to configure the size of the lock/unlock operation, which should be used together with CACHE_LOCK_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_CTRL</name>
          <description>Sync-class operation control register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>INVALIDATE_ENA</name>
              <description>The bit is used to enable invalidate operation. It will be cleared by hardware after invalidate operation done. Note that this bit and the other sync-bits (clean_ena, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLEAN_ENA</name>
              <description>The bit is used to enable clean operation. It will be cleared by hardware after clean operation done. Note that this bit and the other sync-bits (invalidate_ena, writeback_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEBACK_ENA</name>
              <description>The bit is used to enable writeback operation. It will be cleared by hardware after writeback operation done. Note that this bit and the other sync-bits (invalidate_ena, clean_ena, writeback_invalidate_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITEBACK_INVALIDATE_ENA</name>
              <description>The bit is used to enable writeback-invalidate operation. It will be cleared by hardware after writeback-invalidate operation done. Note that this bit and the other sync-bits (invalidate_ena, clean_ena, writeback_ena) are mutually exclusive, that is, those bits can not be set to 1 at the same time.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_DONE</name>
              <description>The bit is used to indicate whether sync operation (invalidate, clean, writeback, writeback_invalidate) is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNC_RGID</name>
              <description>The bit is used to set  the gid of cache sync operation (invalidate, clean, writeback, writeback_invalidate)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_MAP</name>
          <description>Sync map configure register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x1f</resetValue>
          <fields>
            <field>
              <name>SYNC_MAP</name>
              <description>Those bits are used to indicate which caches in the two-level cache structure will apply the sync operation. [0]: L1-ICache0, [1]: L1-ICache1, [2]: L1-ICache2, [3]: L1-ICache3, [4]: L1-DCache, [5]: L2-Cache.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_ADDR</name>
          <description>Sync address configure register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC_ADDR</name>
              <description>Those bits are used to configure the start address of the sync operation, which should be used together with CACHE_SYNC_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNC_SIZE</name>
          <description>Sync size configure register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYNC_SIZE</name>
              <description>Those bits are used to configure the size of the sync operation, which should be used together with CACHE_SYNC_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 0 preload-operation control register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L1-ICache0. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache0 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE0_PRELOAD_MODE</name>
              <description>Configures the mode of l1 icache0 preload, 0: load data from next level memory, 1: not load data from next level memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 0 preload address configure register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE0_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 0 preload size configure register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE0_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache0, which should be used together with L1_ICACHE0_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_PRELOAD_CTRL</name>
          <description>L1 instruction Cache 1 preload-operation control register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>L1_ICACHE1_PRELOAD_ENA</name>
              <description>The bit is used to enable preload operation on L1-ICache1. It will be cleared by hardware automatically after preload operation is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_DONE</name>
              <description>The bit is used to indicate whether preload operation is finished or not. 0: not finished. 1: finished.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_ORDER</name>
              <description>The bit is used to configure the direction of preload operation. 0: ascending, 1: descending.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_RGID</name>
              <description>The bit is used to set  the gid of l1 icache1 preload.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>L1_ICACHE1_PRELOAD_MODE</name>
              <description>Configures the mode of l1 icache1 preload, 0: load data from next level memory, 1: not load data from next level memory.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_PRELOAD_ADDR</name>
          <description>L1 instruction Cache 1 preload address configure register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_PRELOAD_ADDR</name>
              <description>Those bits are used to configure the start address of preload on L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_SIZE_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>L1_ICACHE1_PRELOAD_SIZE</name>
          <description>L1 instruction Cache 1 preload size configure register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>L1_ICACHE1_PRELOAD_SIZE</name>
              <description>Those bits are used to configure the size of the first section of prelock on L1-ICache1, which should be used together with L1_ICACHE1_PRELOAD_ADDR_REG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
