esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EFUSE</name>
      <description>eFuse Controller</description>
      <groupName>EFUSE</groupName>
      <baseAddress>0x600b1800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3dc</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PGM_DATA%s</name>
          <description>Represents pgm_data%s</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PGM_DATA</name>
              <description>Configures the %sth 32-bit data to be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PGM_CHECK_VALUE%s</name>
          <description>Represents pgm_check_value%s</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PGM_RS_DATA</name>
              <description>Configures the %sth RS code to be programmed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_WR_DIS0</name>
          <description>Represents rd_wr_dis</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WR_DIS</name>
              <description>Represents whether programming of individual eFuse memory bit is disabled or enabled.\\ 1: Disabled\\ 0: Enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA0</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RD_DIS</name>
              <description>Represents whether reading of individual eFuse block(block4~block10) is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_JTAG</name>
              <description>Represents whether the function of usb switch to jtag is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG</name>
              <description>Represents whether USB-Serial-JTAG is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_FORCE_DOWNLOAD</name>
              <description>Represents whether the function that forces chip into download mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOWNLOAD_MSPI_DIS</name>
              <description>Represents whether SPI0 controller during boot_mode_download is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_TWAI</name>
              <description>Represents whether TWAI function is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JTAG_SEL_ENABLE</name>
              <description>Represents whether the selection between usb_to_jtag and pad_to_jtag through strapping gpio15 when both EFUSE_DIS_PAD_JTAG and EFUSE_DIS_USB_JTAG are equal to 0 is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_PAD_JTAG</name>
              <description>Represents whether JTAG is disabled in the hard way(permanently).\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MANUAL_ENCRYPT</name>
              <description>Represents whether flash encrypt function is disabled or enabled(except in SPI boot mode).\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_GLITCH_EN</name>
              <description>Represents whether to enable PVT power glitch monitor function.\\1:Enable. \\0:Disable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVT_GLITCH_MODE</name>
              <description>Use to configure glitch mode</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_CORE1</name>
              <description>Represents whether the CPU-Core1 is disabled. \\ 1: Disabled. \\ 0: Not disable.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_BOOT_CRYPT_CNT</name>
              <description>Represents whether SPI boot encrypt/decrypt is disabled or enabled.\\ Odd number of 1: enabled\\ Even number of 1: disabled\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE0</name>
              <description>Represents whether revoking first secure boot key is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE1</name>
              <description>Represents whether revoking second secure boot key is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_KEY_REVOKE2</name>
              <description>Represents whether revoking third secure boot key is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA1</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_PURPOSE_0</name>
              <description>Represents the purpose of Key0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_1</name>
              <description>Represents the purpose of Key1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_2</name>
              <description>Represents the purpose of Key2.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_3</name>
              <description>Represents the purpose of Key3.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_4</name>
              <description>Represents the purpose of Key4.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PURPOSE_5</name>
              <description>Represents the purpose of Key5.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_DPA_LEVEL</name>
              <description>Represents the spa secure level by configuring the clock random divide mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA2</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>XTS_DPA_PSEUDO_LEVEL</name>
              <description>Represents the pseudo round level of xts-aes anti-dpa attack.\\ 3: High.\\ 2: Moderate 1. Low\\ 0: Disabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XTS_DPA_CLK_ENABLE</name>
              <description>Represents whether xts-aes anti-dpa attack clock is enabled.\\ 1. Enable.\\ 0: Disable.\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECC_FORCE_CONST_TIME</name>
              <description>Represents whether to force ecc to use const-time calculation mode. \\ 1: Enable. \\ 0: Disable.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECDSA_P384_ENABLE</name>
              <description>Represents if the chip supports ECDSA P384</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_EN</name>
              <description>Represents whether secure boot is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_BOOT_AGGRESSIVE_REVOKE</name>
              <description>Represents whether revoking aggressive secure boot is enabled or disabled.\\ 1: enabled.\\ 0: disabled\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_DISABLE_DEPLOY_MODE</name>
              <description>Represents whether the new key deployment of key manager is disabled. \\Bit0: Represents whether the new ECDSA key deployment is disabled\\0: Enabled\\1: Disabled\\Bit1: Represents whether the new XTS-AES (flash and PSRAM) key deployment is disabled\\0: Enabled\\1: Disabled\\Bit2: Represents whether the new HMAC key deployment is disabled\\0: Enabled\\1: Disabled\\Bit3: Represents whether the new DS key deployment is disabled\\0: Enabled\\1: Disabled\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_RND_SWITCH_CYCLE</name>
              <description>Represents the cycle at which the Key Manager switches random numbers.\\0: Controlled by the \hyperref[fielddesc:KEYMNGRNDSWITCHCYCLE]{KEYMNG\_RND\_SWITCH\_CYCLE} register. For more information, please refer to Chapter \ref{mod:keymng} \textit{\nameref{mod:keymng}}\\1: 8 Key Manager clock cycles\\2: 16 Key Manager clock cycles\\3: 32 Key Manager clock cycles\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_DEPLOY_ONLY_ONCE</name>
              <description>Represents whether the corresponding key can be deployed only once.\\Bit0: Represents whether the ECDSA key can be deployed only once\\0: The key can be deployed multiple times\\1: The key can be deployed only once\\Bit1: Represents whether the XTS-AES (flash and PSRAM) key can be deployed only once\\0: The key can be deployed multiple times\\1: The key can be deployed only once\\Bit2: Represents whether the HMAC key can be deployed only once\\0: The key can be deployed multiple times\\1: The key can be deployed only once\\Bit3: Represents whether the DS key can be deployed only once\\0: The key can be deployed multiple times\\1: The key can be deployed only once\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_USE_KEY_MANAGER_KEY</name>
              <description>Represents whether the corresponding key must come from Key Manager. \\Bit0: Represents whether the ECDSA key must come from Key Manager.\\0: The key does not need to come from Key Manager\\1: The key must come from Key Manager\\Bit1: Represents whether the XTS-AES (flash and PSRAM) key must come from Key Manager.\\0: The key does not need to come from Key Manager\\1: The key must come from Key Manager\\Bit2: Represents whether the HMAC key must come from Key Manager.\\0: The key does not need to come from Key Manager\\1: The key must come from Key Manager\\Bit3: Represents whether the DS key must come from Key Manager.\\0: The key does not need to come from Key Manager\\1: The key must come from Key Manager\\</description>
              <bitOffset>19</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_DISABLE_SW_INIT_KEY</name>
              <description>Represents whether to disable the use of the initialization key written by software and instead force use efuse\_init\_key.\\0: Enable\\1: Disable\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KM_XTS_KEY_LENGTH_256</name>
              <description>Represents which key flash encryption uses.\\0: XTS-AES-256 key\\1: XTS-AES-128 key\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK_KM_KEY</name>
              <description>Represents whether the keys in the Key Manager are locked after deployment.\\0: Not locked\\1: Locked\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_TPUW</name>
              <description>Represents the flash waiting time after power-up, in unit of ms. When the value less than 15, the waiting time is the programmed value. Otherwise, the waiting time is 2 times the programmed value.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_DOWNLOAD_MODE</name>
              <description>Represents whether Download mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_REPEAT_DATA3</name>
          <description>Represents rd_repeat_data</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DIS_DIRECT_BOOT</name>
              <description>Represents whether direct boot mode is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_ROM_PRINT</name>
              <description>Represents whether print from USB-Serial-JTAG is disabled or enabled.\\ 1: disabled\\ 0: enabled\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIS_USB_SERIAL_JTAG_DOWNLOAD_MODE</name>
              <description>Represents whether the USB-Serial-JTAG download function is disabled or enabled.\\ 1: Disable\\ 0: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE_SECURITY_DOWNLOAD</name>
              <description>Represents whether security download is enabled or disabled.\\ 1: enabled\\ 0: disabled\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>UART_PRINT_CONTROL</name>
              <description>Represents the type of UART printing.\\ 00: force enable printing\\ 01: enable printing when GPIO8 is reset at low level\\ 10: enable printing when GPIO8 is reset at high level\\ 11: force disable printing\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_SEND_RESUME</name>
              <description>Represents whether ROM code is forced to send a resume command during SPI boot.\\ 1: forced\\ 0:not forced\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SECURE_VERSION</name>
              <description>Represents the version used by ESP-IDF anti-rollback feature.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HUK_GEN_STATE</name>
              <description>Represents whether the HUK generate mode is valid.\\Odd count of bits with a value of 1: Invalid\\Even count of bits with a value of 1: Valid\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLASH_LDO_EFUSE_SEL</name>
              <description>Represents whether to select efuse control flash ldo default voltage. \\ 1 : efuse 0 : strapping</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
