esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W2</name>
          <description>eFuse apb2otp block0 data register13.</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W2</name>
              <description>Otp block0 backup3 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W3</name>
          <description>eFuse apb2otp block0 data register14.</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W3</name>
              <description>Otp block0 backup3 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W4</name>
          <description>eFuse apb2otp block0 data register15.</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W4</name>
              <description>Otp block0 backup3 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP3_W5</name>
          <description>eFuse apb2otp block0 data register16.</description>
          <addressOffset>0x53c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP3_W5</name>
              <description>Otp block0 backup3 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W1</name>
          <description>eFuse apb2otp block0 data register17.</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W1</name>
              <description>Otp block0 backup4 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W2</name>
          <description>eFuse apb2otp block0 data register18.</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W2</name>
              <description>Otp block0 backup4 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W3</name>
          <description>eFuse apb2otp block0 data register19.</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W3</name>
              <description>Otp block0 backup4 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W4</name>
          <description>eFuse apb2otp block0 data register20.</description>
          <addressOffset>0x54c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W4</name>
              <description>Otp block0 backup4 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK0_BACKUP4_W5</name>
          <description>eFuse apb2otp block0 data register21.</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK0_BACKUP4_W5</name>
              <description>Otp block0 backup4 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W1</name>
          <description>eFuse apb2otp block1 data register1.</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W1</name>
              <description>Otp block1  word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W2</name>
          <description>eFuse apb2otp block1 data register2.</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W2</name>
              <description>Otp block1  word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W3</name>
          <description>eFuse apb2otp block1 data register3.</description>
          <addressOffset>0x55c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W3</name>
              <description>Otp block1  word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W4</name>
          <description>eFuse apb2otp block1 data register4.</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W4</name>
              <description>Otp block1  word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W5</name>
          <description>eFuse apb2otp block1 data register5.</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W5</name>
              <description>Otp block1  word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W6</name>
          <description>eFuse apb2otp block1 data register6.</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W6</name>
              <description>Otp block1  word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W7</name>
          <description>eFuse apb2otp block1 data register7.</description>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W7</name>
              <description>Otp block1  word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W8</name>
          <description>eFuse apb2otp block1 data register8.</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W8</name>
              <description>Otp block1  word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK1_W9</name>
          <description>eFuse apb2otp block1 data register9.</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK1_W9</name>
              <description>Otp block1  word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W1</name>
          <description>eFuse apb2otp block2 data register1.</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W1</name>
              <description>Otp block2 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W2</name>
          <description>eFuse apb2otp block2 data register2.</description>
          <addressOffset>0x57c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W2</name>
              <description>Otp block2 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W3</name>
          <description>eFuse apb2otp block2 data register3.</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W3</name>
              <description>Otp block2 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W4</name>
          <description>eFuse apb2otp block2 data register4.</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W4</name>
              <description>Otp block2 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W5</name>
          <description>eFuse apb2otp block2 data register5.</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W5</name>
              <description>Otp block2 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W6</name>
          <description>eFuse apb2otp block2 data register6.</description>
          <addressOffset>0x58c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W6</name>
              <description>Otp block2 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W7</name>
          <description>eFuse apb2otp block2 data register7.</description>
          <addressOffset>0x590</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W7</name>
              <description>Otp block2 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W8</name>
          <description>eFuse apb2otp block2 data register8.</description>
          <addressOffset>0x594</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W8</name>
              <description>Otp block2 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W9</name>
          <description>eFuse apb2otp block2 data register9.</description>
          <addressOffset>0x598</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W9</name>
              <description>Otp block2 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W10</name>
          <description>eFuse apb2otp block2 data register10.</description>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W10</name>
              <description>Otp block2 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK2_W11</name>
          <description>eFuse apb2otp block2 data register11.</description>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK2_W11</name>
              <description>Otp block2 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W1</name>
          <description>eFuse apb2otp block3 data register1.</description>
          <addressOffset>0x5a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W1</name>
              <description>Otp block3 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W2</name>
          <description>eFuse apb2otp block3 data register2.</description>
          <addressOffset>0x5a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W2</name>
              <description>Otp block3 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W3</name>
          <description>eFuse apb2otp block3 data register3.</description>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W3</name>
              <description>Otp block3 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W4</name>
          <description>eFuse apb2otp block3 data register4.</description>
          <addressOffset>0x5b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W4</name>
              <description>Otp block3 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W5</name>
          <description>eFuse apb2otp block3 data register5.</description>
          <addressOffset>0x5b4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W5</name>
              <description>Otp block3 word5 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W6</name>
          <description>eFuse apb2otp block3 data register6.</description>
          <addressOffset>0x5b8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W6</name>
              <description>Otp block3 word6 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W7</name>
          <description>eFuse apb2otp block3 data register7.</description>
          <addressOffset>0x5bc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W7</name>
              <description>Otp block3 word7 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W8</name>
          <description>eFuse apb2otp block3 data register8.</description>
          <addressOffset>0x5c0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W8</name>
              <description>Otp block3 word8 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W9</name>
          <description>eFuse apb2otp block3 data register9.</description>
          <addressOffset>0x5c4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W9</name>
              <description>Otp block3 word9 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W10</name>
          <description>eFuse apb2otp block3 data register10.</description>
          <addressOffset>0x5c8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W10</name>
              <description>Otp block3 word10 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK3_W11</name>
          <description>eFuse apb2otp block3 data register11.</description>
          <addressOffset>0x5cc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK3_W11</name>
              <description>Otp block3 word11 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W1</name>
          <description>eFuse apb2otp BLOCK7 data register1.</description>
          <addressOffset>0x5d0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W1</name>
              <description>Otp block4 word1 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W2</name>
          <description>eFuse apb2otp block4 data register2.</description>
          <addressOffset>0x5d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W2</name>
              <description>Otp block4 word2 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W3</name>
          <description>eFuse apb2otp block4 data register3.</description>
          <addressOffset>0x5d8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W3</name>
              <description>Otp block4 word3 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2OTP_BLK4_W4</name>
          <description>eFuse apb2otp block4 data register4.</description>
          <addressOffset>0x5dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB2OTP_BLOCK4_W4</name>
              <description>Otp block4 word4 data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
