esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <dim>19</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 40 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
Or\\
0x40: A constantly high input\\
0x60: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>97,98,99,100</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x458</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 40 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
Or\\
0x40: A constantly high input\\
0x60: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x46c</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 40 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
Or\\
0x40: A constantly high input\\
0x60: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>17</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 40 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
Or\\
0x40: A constantly high input\\
0x60: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>182,183,184,185,186,187,188,189</dimIndex>
          <name>FUNC%s_IN_SEL_CFG</name>
          <description>Configuration register for input signal %s</description>
          <addressOffset>0x5ac</addressOffset>
          <size>32</size>
          <resetValue>0x60</resetValue>
          <fields>
            <field>
              <name>FUNC_IN_SEL</name>
              <description>Configures to select a pin from the 40 GPIO pins to connect the input signal %s.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
Or\\
0x40: A constantly high input\\
0x60: A constantly low input\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_IN_INV_SEL</name>
              <description>Configures whether or not to invert the input value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIG_IN_SEL</name>
              <description>Configures whether or not to route signals via GPIO matrix.\\
0: Bypass GPIO matrix, i.e., connect signals directly to peripheral configured in IO MUX.\\
1: Route signals via GPIO matrix.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>40</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>FUNC%s_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO%s output</description>
          <addressOffset>0xad4</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO%s.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit %s of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit %s of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC40_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb74</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC40_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC40_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC40_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC40_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC41_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb78</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC41_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC41_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC41_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC41_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC42_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb7c</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC42_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC42_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC42_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC42_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FUNC43_OUT_SEL_CFG</name>
          <description>Configuration register for GPIO$n output</description>
          <addressOffset>0xb80</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>FUNC43_OUT_SEL</name>
              <description>Configures to select a signal 0 (0 &lt;= 0 &lt; 256) from 256 peripheral signals to be output from GPIO0.\\
0: Select signal 0\\
1: Select signal 1\\
......\\
254: Select signal 254\\
255: Select signal 255\\
Or\\
256: Bit 0 of GPIO_OUT_REG and GPIO_ENABLE_REG are selected as the output value and output enable.

For the detailed signal list, see Table &lt;a href=tab:iomuxgpio-periph-signals-via-gpio-matrix&quot;&gt;link&lt;/a&gt;.
&quot;</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC43_OUT_INV_SEL</name>
              <description>Configures whether or not to invert the output value.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC43_OE_SEL</name>
              <description>Configures to select the source of output enable signal.\\
0: Use output enable signal from peripheral.\\ 
1: Force the output enable signal to be sourced from bit 10 of GPIO_ENABLE_REG. \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC43_OE_INV_SEL</name>
              <description>Configures whether or not to invert the output enable signal.\\
0: Not invert\\
1: Invert\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>GPIO clock gate register</description>
          <addressOffset>0xdf8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to enable clock gate.\\
0: Not enable\\
1: Enable, the clock is free running. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>GPIO version register</description>
          <addressOffset>0xdfc</addressOffset>
          <size>32</size>
          <resetValue>0x2411250</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
