esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIO_SD</name>
      <description>Sigma-Delta Modulation</description>
      <groupName>GPIOSD</groupName>
      <baseAddress>0x60093e00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIO_EXT_CLOCK_GATE</name>
          <description>Clock Gating Configure Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_CLK_EN</name>
              <description>Clock enable bit of configuration registers for sigma delta modulation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_SIGMADELTA_MISC</name>
          <description>MISC Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_SIGMADELTA_CLK_EN</name>
              <description>Configures whether or not to enable the clock for sigma delta modulation.\\
0: Not enable\\
1: Enable\\%\label{fielddesc:GPIOSDSPISWAP}- [GPIOSD_SPI_SWAP] Reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO_EXT_SIGMADELTA%s</name>
          <description>Duty cycle configuration register for SDM channel %s</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0xff00</resetValue>
          <fields>
            <field>
              <name>GPIO_EXT_SD_IN</name>
              <description>Configures the duty cycle of sigma delta modulation output. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_SD_PRESCALE</name>
              <description>Configures the divider value to divide IO MUX operating clock. \\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO_EXT_GLITCH_FILTER_CH%s</name>
          <description>Glitch Filter Configure Register of Channel%s</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_FILTER_CH0_EN</name>
              <description>Configures whether or not to enable channel %s of Glitch Filter.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_FILTER_CH0_INPUT_IO_NUM</name>
              <description>Configures to select the input GPIO for Glitch Filter. \\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
40 ~ 63: Reserved\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_FILTER_CH0_WINDOW_THRES</name>
              <description>Configures the window threshold for Glitch Filter. The window threshold should be less than or equal to GPIOSD_FILTER_CH%s_WINDOW_WIDTH.\\  %see DOC-4768\\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_FILTER_CH0_WINDOW_WIDTH</name>
              <description>Configures the window width for Glitch Filter. The effective value of window width is 0 ~ 63. \\
Measurement unit: IO MUX operating clock cycle\\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GPIO_EXT_ETM_EVENT_CH%s_CFG</name>
          <description>ETM configuration register for channel %s</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_CH_EVENT_SEL</name>
              <description>Configures to select GPIO for ETM event channel.\\
0: Select GPIO0\\
1: Select GPIO1\\
......\\
38: Select GPIO38\\
39: Select GPIO39\\
40 ~ 63: Reserved\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_CH_EVENT_EN</name>
              <description>Configures whether or not to enable ETM event send.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P0_CFG</name>
          <description>GPIO selection register 0 for ETM</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO0_SEL</name>
              <description>Configures to select an ETM task channel for GPIO0.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO0_EN</name>
              <description>Configures whether or not to enable GPIO0 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO1_SEL</name>
              <description>Configures to select an ETM task channel for GPIO1.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO1_EN</name>
              <description>Configures whether or not to enable GPIO1 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO2_SEL</name>
              <description>Configures to select an ETM task channel for GPIO2.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO2_EN</name>
              <description>Configures whether or not to enable GPIO2 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO3_SEL</name>
              <description>Configures to select an ETM task channel for GPIO3.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO3_EN</name>
              <description>Configures whether or not to enable GPIO3 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO4_SEL</name>
              <description>Configures to select an ETM task channel for GPIO4.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO4_EN</name>
              <description>Configures whether or not to enable GPIO4 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P1_CFG</name>
          <description>GPIO selection register 1 for ETM</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO5_SEL</name>
              <description>Configures to select an ETM task channel for GPIO5.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO5_EN</name>
              <description>Configures whether or not to enable GPIO5 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO6_SEL</name>
              <description>Configures to select an ETM task channel for GPIO6.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO6_EN</name>
              <description>Configures whether or not to enable GPIO6 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO7_SEL</name>
              <description>Configures to select an ETM task channel for GPIO7.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO7_EN</name>
              <description>Configures whether or not to enable GPIO7 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO8_SEL</name>
              <description>Configures to select an ETM task channel for GPIO8.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO8_EN</name>
              <description>Configures whether or not to enable GPIO8 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO9_SEL</name>
              <description>Configures to select an ETM task channel for GPIO9.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO9_EN</name>
              <description>Configures whether or not to enable GPIO9 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P2_CFG</name>
          <description>GPIO selection register 2 for ETM</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO10_SEL</name>
              <description>Configures to select an ETM task channel for GPIO10.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO10_EN</name>
              <description>Configures whether or not to enable GPIO10 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO11_SEL</name>
              <description>Configures to select an ETM task channel for GPIO11.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO11_EN</name>
              <description>Configures whether or not to enable GPIO11 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO12_SEL</name>
              <description>Configures to select an ETM task channel for GPIO12.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO12_EN</name>
              <description>Configures whether or not to enable GPIO12 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO13_SEL</name>
              <description>Configures to select an ETM task channel for GPIO13.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO13_EN</name>
              <description>Configures whether or not to enable GPIO13 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO14_SEL</name>
              <description>Configures to select an ETM task channel for GPIO14.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO14_EN</name>
              <description>Configures whether or not to enable GPIO14 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_EXT_ETM_TASK_P3_CFG</name>
          <description>GPIO selection register 3 for ETM</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO15_SEL</name>
              <description>Configures to select an ETM task channel for GPIO15.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO15_EN</name>
              <description>Configures whether or not to enable GPIO15 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO16_SEL</name>
              <description>Configures to select an ETM task channel for GPIO16.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO16_EN</name>
              <description>Configures whether or not to enable GPIO16 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO17_SEL</name>
              <description>Configures to select an ETM task channel for GPIO17.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO17_EN</name>
              <description>Configures whether or not to enable GPIO17 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO18_SEL</name>
              <description>Configures to select an ETM task channel for GPIO18.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO18_EN</name>
              <description>Configures whether or not to enable GPIO18 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO19_SEL</name>
              <description>Configures to select an ETM task channel for GPIO19.\\
0: Select channel 0\\
1: Select channel 1\\
......\\
7: Select channel 7\\</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_EXT_ETM_TASK_GPIO19_EN</name>
              <description>Configures whether or not to enable GPIO19 to response ETM task.\\
0: Not enable\\
1: Enable\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
