esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HP_SYS</name>
      <description>High-Power System</description>
      <groupName>HP_SYSTEM</groupName>
      <baseAddress>0x6009c000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xa4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTERNAL_DEVICE_ENCRYPT_DECRYPT_CONTROL</name>
          <description>External device encryption/decryption configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE_SPI_MANUAL_ENCRYPT</name>
              <description>Configures whether or not to enable MSPI XTS manual encryption in SPI boot mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_DOWNLOAD_DB_ENCRYPT</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_DOWNLOAD_G0CB_DECRYPT</name>
              <description>Configures whether or not to enable MSPI XTS auto decryption in download boot mode.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_DOWNLOAD_MANUAL_ENCRYPT</name>
              <description>Configures whether or not to enable MSPI XTS manual encryption in download boot mode. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_USAGE_CONF</name>
          <description>HP memory usage configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRAM_USAGE</name>
              <description>hp system memory is splited to 7 layers(Layer0 ~ Layer6) in total. Mac-dump can occupy one layer within Layer1~Layer5. \\
This field is used to select which one layer will be used by mac-dump. This field SHALL/MUST be one-hot. LSB-bit controls Layer1, MSB-bit controls Layer5. For each bit, 0: cpu use hp-memory. 1:mac-dump accessing hp-memory.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAC_DUMP_ALLOC</name>
              <description>reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_DPA_CONF</name>
          <description>HP anti-DPA security configuration register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEC_DPA_LEVEL</name>
              <description>Configures whether or not to enable anti-DPA attack. Valid only when HP_SYSTEM_SEC_DPA_CFG_SEL is 0. \\
0: Disable\\
1-3: Enable. The larger the number, the higher the security level, which represents the ability to resist DPA attacks, with increased computational overhead of the hardware crypto-accelerators at the same time. \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC_DPA_CFG_SEL</name>
              <description>Configures whether to select HP_SYSTEM_SEC_DPA_LEVEL or EFUSE_SEC_DPA_LEVEL (from eFuse) to control DPA level. \\
0: Select EFUSE_SEC_DPA_LEVEL\\
1: Select HP_SYSTEM_SEC_DPA_LEVEL\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_TIMEOUT_CONF</name>
          <description>CPU_PERI_TIMEOUT configuration register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0x2ffff</resetValue>
          <fields>
            <field>
              <name>CPU_PERI_TIMEOUT_THRES</name>
              <description>Configures the timeout threshold for bus access for accessing CPU peripheral register in the number of clock cycles of the clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI_TIMEOUT_INT_CLEAR</name>
              <description>Write 1 to clear timeout interrupt.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPU_PERI_TIMEOUT_PROTECT_EN</name>
              <description>Configures whether or not to enable timeout protection for accessing CPU peripheral registers.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_TIMEOUT_ADDR</name>
          <description>CPU_PERI_TIMEOUT_ADDR register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI_TIMEOUT_ADDR</name>
              <description>Represents the address information of abnormal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_TIMEOUT_UID</name>
          <description>CPU_PERI_TIMEOUT_UID register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI_TIMEOUT_UID</name>
              <description>Represents the master id[4:0] and master permission[6:5] when trigger timeout. This register will be cleared after the interrupt is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_TIMEOUT_CONF</name>
          <description>HP_PERI_TIMEOUT configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x2ffff</resetValue>
          <fields>
            <field>
              <name>HP_PERI_TIMEOUT_THRES</name>
              <description>Configures the timeout threshold for bus access for accessing HP peripheral register, corresponding to the number of clock cycles of the clock domain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PERI_TIMEOUT_INT_CLEAR</name>
              <description>Configures whether or not to clear timeout interrupt.\\
0: No effect\\
1: Clear timeout interrupt\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>HP_PERI_TIMEOUT_PROTECT_EN</name>
              <description>Configures whether or not to enable timeout protection for accessing HP peripheral registers.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_TIMEOUT_ADDR</name>
          <description>HP_PERI_TIMEOUT_ADDR register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI_TIMEOUT_ADDR</name>
              <description>Represents the address information of abnormal access.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_TIMEOUT_UID</name>
          <description>HP_PERI_TIMEOUT_UID register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI_TIMEOUT_UID</name>
              <description>Represents the master id[4:0] and master permission[6:5] when trigger timeout. This register will be cleared after the interrupt is cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_CTRL</name>
          <description>SDIO Control configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>DIS_SDIO_PROB</name>
              <description>Set this bit as 1 to disable SDIO_PROB function. disable by default.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO_WIN_ACCESS_EN</name>
              <description>Enable sdio slave to access other peripherals on the chip</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_TABLE_LOCK</name>
          <description>ROM-Table lock register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ROM_TABLE_LOCK</name>
              <description>Configures whether or not to lock the value contained in HP_SYSTEM_ROM_TABLE. \\
0: Unlock \\
1: Lock \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROM_TABLE</name>
          <description>ROM-Table register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ROM_TABLE</name>
              <description>Software ROM-Table register, whose content can be modified only when
HP_SYSTEM_ROM_TABLE_LOCK is 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE_DEBUG_RUNSTALL_CONF</name>
          <description>Core Debug RunStall configurion register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CORE_DEBUG_RUNSTALL_ENABLE</name>
              <description>Configures whether or not to enable debug RunStall functionality between HP CPU and LP CPU.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE0_RUNSTALLED</name>
              <description>Software can read this field to get the runstall status of hp-core0. 1: stalled, 0: not stalled.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CORE1_RUNSTALLED</name>
              <description>Software can read this field to get the runstall status of hp-core1. 1: stalled, 0: not stalled.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_TEST_CONF</name>
          <description>MEM_TEST configuration register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>HP_MEM_WPULSE</name>
              <description>This field controls hp system memory WPULSE parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MEM_WA</name>
              <description>This field controls hp system memory WA parameter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MEM_RA</name>
              <description>This field controls hp system memory RA parameter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPROM_CTRL</name>
          <description>reserved</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>SPROM_MEM_AUX_CTRL</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPRAM_CTRL</name>
          <description>reserved</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x2850</resetValue>
          <fields>
            <field>
              <name>SPRAM_MEM_AUX_CTRL</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPRF_CTRL</name>
          <description>reserved</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0x2850</resetValue>
          <fields>
            <field>
              <name>SPRF_MEM_AUX_CTRL</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDPRF_CTRL</name>
          <description>reserved</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SDPRF_MEM_AUX_CTRL</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BITSCRAMBLER_PERI_SEL</name>
          <description>reserved</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BITSCRAMBLER_RX_SEL</name>
              <description>select peri that will be connected to bitscrambler,dir : receive data from bs</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BITSCRAMBLER_TX_SEL</name>
              <description>select peri that will be connected to bitscrambler,dir : transfer data to peri</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APPCPU_BOOT_ADDR</name>
          <description>reserved</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APPCPU_BOOT_ADDR</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AXI_MST_PRI</name>
          <description>AXI mst priority configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_PRIORITY</name>
              <description>AHB-DMA arbitration priority for command channels between masters connected to ext_mem_DW_axi</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE_PRIORITY</name>
              <description>CACHE arbitration priority for command channels between masters connected to ext_mem_DW_axi</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_PMS_CONF</name>
          <description>CPU Peripherals PMS configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear cpu peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_PMS_EXCEPTION_INFO</name>
          <description>CPU Peripherals PMS exception info record register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI_PMS_EXCEPTION_DET</name>
              <description>Represents whether the cpu peripheral pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_PERI_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when cpu peripheral pms has been triggered.\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_PERI_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when cpu peripheral pms has been triggered.\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_PERI_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit23~bit0) when cpu peripheral pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_PMS_CONF</name>
          <description>HP Peripherals PMS configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear hp peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_PMS_EXCEPTION_INFO</name>
          <description>HP Peripherals PMS exception info record register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI_PMS_EXCEPTION_DET</name>
              <description>Represents whether the hp peripheral pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when hp peripheral pms has been triggered.\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when hp peripheral pms has been triggered.\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HP_PERI_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit23~bit0) when hp peripheral pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_PERI_PMS_CONF</name>
          <description>MODEM Peripherals PMS configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEM_PERI_PMS_EXCEPTION_CLR</name>
              <description>Configures whether or not to clear modem peri_pms_record_reg.\\
0: No clear\\
1: Clear peri_pms_record_reg\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
