esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>MODEM_PERI_PMS_EXCEPTION_INFO</name>
          <description>MODEM Peripherals PMS exception info record register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEM_PERI_PMS_EXCEPTION_DET</name>
              <description>Represents whether the modem peripheral pms has been triggered.\\
0: No triggered\\
1: Has been triggered\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODEM_PERI_PMS_EXCEPTION_ID</name>
              <description>Represents the master id when modem peripheral pms has been triggered.\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODEM_PERI_PMS_EXCEPTION_MODE</name>
              <description>Represents the security mode when modem peripheral pms has been triggered.\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MODEM_PERI_PMS_EXCEPTION_ADDR</name>
              <description>Represents the access address (bit23~bit0) when modem peripheral pms has been triggered.\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PERI_PMS_INT_EN</name>
          <description>APM interrupt enable register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI_PMS_INT_EN</name>
              <description>Configures to enable hp peri pms interrupt.\\ 
0: disable \\ 
1: enable  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI_PMS_INT_EN</name>
              <description>Configures to enable cpu peri pms interrupt.\\ 
0: disable \\ 
1: enable  \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_PERI_PMS_INT_EN</name>
              <description>Configures to enable modem peri pms interrupt.\\ 
0: disable \\ 
1: enable  \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROBEA_CTRL</name>
          <description>NA</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROBE_A_MOD_SEL</name>
              <description>Tihs field is used to selec probe_group from probe_group0 to probe_group15 for module's probe_out[31:0] in a mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROBE_A_TOP_SEL</name>
              <description>Tihs field is used to selec module's probe_out[31:0] as probe out in a mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROBE_L_SEL</name>
              <description>Tihs field is used to selec probe_out[31:16]</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROBE_H_SEL</name>
              <description>Tihs field is used to selec probe_out[31:16]</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROBE_GLOBAL_EN</name>
              <description>Set this bit to enable global debug probe in hp system.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROBEB_CTRL</name>
          <description>NA</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROBE_B_MOD_SEL</name>
              <description>Tihs field is used to selec probe_group from probe_group0 to probe_group15 for module's probe_out[31:0] in b mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROBE_B_TOP_SEL</name>
              <description>Tihs field is used to select module's probe_out[31:0]  as probe_out in b mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROBE_B_EN</name>
              <description>Set this bit to enable b mode for debug probe. 1:  b mode, 0: a mode.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROBE_OUT</name>
          <description>NA</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROBE_TOP_OUT</name>
              <description>NA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_WAKEUP_EVENT</name>
          <description>NA</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU0_WAKEUP_EVENT</name>
              <description>Configures the cpu0 to exit WFI mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU1_WAKEUP_EVENT</name>
              <description>Configures the cpu1 to exit WFI mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CLK_FORCE_ON</name>
          <description>NA</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ICACHE0_MEM_CLK_FO</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE1_MEM_CLK_FO</name>
              <description>reserved</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCACHE_MEM_CLK_FO</name>
              <description>reserved</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID</name>
          <description>ID register</description>
          <addressOffset>0x3dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ROM_ID</name>
              <description>Represents the ROM ID of chip</description>
              <bitOffset>12</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO</name>
          <description>redcy eco register.</description>
          <addressOffset>0x3e0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_ENA</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REDCY_RESULT</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_LOW</name>
          <description>redcy eco low register.</description>
          <addressOffset>0x3e4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REDCY_LOW</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RND_ECO_HIGH</name>
          <description>redcy eco high register.</description>
          <addressOffset>0x3e8</addressOffset>
          <size>32</size>
          <resetValue>0xffffffff</resetValue>
          <fields>
            <field>
              <name>REDCY_HIGH</name>
              <description>Only reserved for ECO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RST_EN</name>
          <description>PCR clock gating configure register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPSYSREG_RST_EN</name>
              <description>Set 0 to reset hp_system_reg module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG</name>
          <description>HP-SYSTEM debug register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>FPGA_DEBUG</name>
              <description>Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>HP-SYSTEM clock gating configure register</description>
          <addressOffset>0x3f8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Set this bit as 1 to force on clock gating.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Date control and version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2504020</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
