esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>INTERRUPT_CORE0</name>
      <description>Interrupt Controller (Core 0)</description>
      <groupName>INTERRUPT_CORE0</groupName>
      <baseAddress>0x6009a000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1b8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WIFI_MAC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>WIFI_MAC_NMI</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>WIFI_PWR</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>WIFI_BB</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>BT_BB</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>BT_BB_NMI</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>LP_TIMER</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>COEX</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>BLE_TIMER</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>BLE_SEC</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>I2C_MST</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>ZB_MAC</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>MODEM_APB_TIMEOUT</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>BT_MAC_INT1</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>PMU</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>EFUSE</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>LP_RTC_TIMER</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>LP_RTC_BLE_TIMER</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>LP_WDT</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>TOUCH</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>HUK</name>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>LP_PERI_PMS</name>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR0</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR1</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR2</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>FROM_CPU_INTR3</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>BUS_MONITOR</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>CORE0_TRACE</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>CORE1_TRACE</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>CACHE</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>CPU_PERI_TIMEOUT</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>GPIO</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>GPIO_INTERRUPT_2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>PAU</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>HP_PERI_TIMEOUT</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M0</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M1</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M2</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M3</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>HP_APM_M4</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M0</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M1</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M2</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>HP_MEM_APM_M3</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M0</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M1</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M2</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>CPU_APM_M3</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>HP_PERI_PMS</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>MODEM_PERI_PMS</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>CPU_PERI_PMS</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>MSPI</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>I2S</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>UHCI0</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>UART0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>UART1</name>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>LEDC</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>TWAI0</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>TWAI0_TIMER</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>USB_DEVICE</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>RMT</name>
        <value>61</value>
      </interrupt>
      <interrupt>
        <name>I2C_EXT0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>I2C_EXT1</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>TG0_T0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>TG0_WDT</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>TG1_T0</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>TG1_WDT</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET0</name>
        <value>68</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET1</name>
        <value>69</value>
      </interrupt>
      <interrupt>
        <name>SYSTIMER_TARGET2</name>
        <value>70</value>
      </interrupt>
      <interrupt>
        <name>APB_ADC</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>TEMPERATURE_SENSOR</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>MCPWM0</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>MCPWM1</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>PCNT</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>PARL_IO_TX</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>PARL_IO_RX</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>USB_OTG11</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>ASRC_CHNL0</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>ASRC_CHNL1</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>ZERO_DET</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH0</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH1</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH2</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH3</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>DMA_IN_CH4</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH0</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH1</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH2</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH3</name>
        <value>89</value>
      </interrupt>
      <interrupt>
        <name>DMA_OUT_CH4</name>
        <value>90</value>
      </interrupt>
      <interrupt>
        <name>GPSPI2</name>
        <value>91</value>
      </interrupt>
      <interrupt>
        <name>GPSPI3</name>
        <value>92</value>
      </interrupt>
      <interrupt>
        <name>AES</name>
        <value>93</value>
      </interrupt>
      <interrupt>
        <name>SHA</name>
        <value>94</value>
      </interrupt>
      <interrupt>
        <name>ECC</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>ECDSA</name>
        <value>96</value>
      </interrupt>
      <interrupt>
        <name>KM</name>
        <value>97</value>
      </interrupt>
      <registers>
        <register>
          <name>WIFI_MAC_INTR_MAP</name>
          <description>WIFI_MAC_INTR mapping register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIFI_MAC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_MAC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFI_MAC_NMI_MAP</name>
          <description>WIFI_MAC_NMI mapping register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIFI_MAC_NMI_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_MAC_NMI_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFI_PWR_INTR_MAP</name>
          <description>WIFI_PWR_INTR mapping register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIFI_PWR_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_PWR_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIFI_BB_INTR_MAP</name>
          <description>WIFI_BB_INTR mapping register</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIFI_BB_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WIFI_BB_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAC_INTR_MAP</name>
          <description>BT_MAC_INTR mapping register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BT_MAC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_MAC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_BB_INTR_MAP</name>
          <description>BT_BB_INTR mapping register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BT_BB_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_BB_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_BB_NMI_MAP</name>
          <description>BT_BB_NMI mapping register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BT_BB_NMI_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_BB_NMI_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TIMER_INTR_MAP</name>
          <description>LP_TIMER_INTR mapping register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_TIMER_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_TIMER_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COEX_INTR_MAP</name>
          <description>COEX_INTR mapping register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>COEX_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COEX_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_TIMER_INTR_MAP</name>
          <description>BLE_TIMER_INTR mapping register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLE_TIMER_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_TIMER_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_SEC_INTR_MAP</name>
          <description>BLE_SEC_INTR mapping register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BLE_SEC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_SEC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_MST_INTR_MAP</name>
          <description>I2C_MST_INTR mapping register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_MST_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_MST_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZB_MAC_INTR_MAP</name>
          <description>ZB_MAC_INTR mapping register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZB_MAC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZB_MAC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_APB_TIMEOUT_INTR_MAP</name>
          <description>MODEM_APB_TIMEOUT_INTR mapping register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEM_APB_TIMEOUT_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_APB_TIMEOUT_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BT_MAC_INT1_MAP</name>
          <description>BT_MAC_INT1 mapping register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BT_MAC_INT1_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BT_MAC_INT1_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_INTR_MAP</name>
          <description>PMU_INTR mapping register</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PMU_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PMU_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
