esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>HP_MEM_APM_M2_INTR_MAP</name>
          <description>HP_MEM_APM_M2_INTR mapping register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MEM_APM_M2_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MEM_APM_M2_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MEM_APM_M3_INTR_MAP</name>
          <description>HP_MEM_APM_M3_INTR mapping register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_MEM_APM_M3_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_MEM_APM_M3_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_APM_M0_INTR_MAP</name>
          <description>CPU_APM_M0_INTR mapping register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_APM_M0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_APM_M0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_APM_M1_INTR_MAP</name>
          <description>CPU_APM_M1_INTR mapping register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_APM_M1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_APM_M1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_APM_M2_INTR_MAP</name>
          <description>CPU_APM_M2_INTR mapping register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_APM_M2_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_APM_M2_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_APM_M3_INTR_MAP</name>
          <description>CPU_APM_M3_INTR mapping register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_APM_M3_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_APM_M3_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_PERI_PMS_INTR_MAP</name>
          <description>HP_PERI_PMS_INTR mapping register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HP_PERI_PMS_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_PERI_PMS_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_PERI_PMS_INTR_MAP</name>
          <description>MODEM_PERI_PMS_INTR mapping register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEM_PERI_PMS_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_PERI_PMS_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_PERI_PMS_INTR_MAP</name>
          <description>CPU_PERI_PMS_INTR mapping register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CPU_PERI_PMS_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_PERI_PMS_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MSPI_INTR_MAP</name>
          <description>MSPI_INTR mapping register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MSPI_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSPI_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2S_INTR_MAP</name>
          <description>I2S_INTR mapping register</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2S_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UHCI0_INTR_MAP</name>
          <description>UHCI0_INTR mapping register</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UHCI0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UHCI0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART0_INTR_MAP</name>
          <description>UART0_INTR mapping register</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UART1_INTR_MAP</name>
          <description>UART1_INTR mapping register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>UART1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_INTR_MAP</name>
          <description>LEDC_INTR mapping register</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LEDC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LEDC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN0_INTR_MAP</name>
          <description>CAN0_INTR mapping register</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN0_TIMER_INTR_MAP</name>
          <description>CAN0_TIMER_INTR mapping register</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CAN0_TIMER_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0_TIMER_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_SERIAL_JTAG_INTR_MAP</name>
          <description>USB_SERIAL_JTAG_INTR mapping register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_SERIAL_JTAG_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_SERIAL_JTAG_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RMT_INTR_MAP</name>
          <description>RMT_INTR mapping register</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RMT_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RMT_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_EXT0_INTR_MAP</name>
          <description>I2C_EXT0_INTR mapping register</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_EXT0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_EXT0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C_EXT1_INTR_MAP</name>
          <description>I2C_EXT1_INTR mapping register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C_EXT1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_EXT1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG0_T0_INTR_MAP</name>
          <description>TG0_T0_INTR mapping register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG0_T0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_T0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG0_WDT_INTR_MAP</name>
          <description>TG0_WDT_INTR mapping register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG0_WDT_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG0_WDT_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_T0_INTR_MAP</name>
          <description>TG1_T0_INTR mapping register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG1_T0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_T0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TG1_WDT_INTR_MAP</name>
          <description>TG1_WDT_INTR mapping register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TG1_WDT_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TG1_WDT_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET0_INTR_MAP</name>
          <description>SYSTIMER_TARGET0_INTR mapping register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSTIMER_TARGET0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_TARGET0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTIMER_TARGET1_INTR_MAP</name>
          <description>SYSTIMER_TARGET1_INTR mapping register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSTIMER_TARGET1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_TARGET1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
