esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>SYSTIMER_TARGET2_INTR_MAP</name>
          <description>SYSTIMER_TARGET2_INTR mapping register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSTIMER_TARGET2_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_TARGET2_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_ADC_INTR_MAP</name>
          <description>APB_ADC_INTR mapping register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>APB_ADC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_ADC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_INTR_MAP</name>
          <description>PWM0_INTR mapping register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1_INTR_MAP</name>
          <description>PWM1_INTR mapping register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PWM1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_INTR_MAP</name>
          <description>PCNT_INTR mapping register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PCNT_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_TX_INTR_MAP</name>
          <description>PARL_IO_TX_INTR mapping register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PARL_IO_TX_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_IO_TX_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_RX_INTR_MAP</name>
          <description>PARL_IO_RX_INTR mapping register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PARL_IO_RX_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_IO_RX_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG11_INTR_MAP</name>
          <description>USB_OTG11_INTR mapping register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_OTG11_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTG11_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRC_CHNL0_INTR_MAP</name>
          <description>ASRC_CHNL0_INTR mapping register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ASRC_CHNL0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASRC_CHNL0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRC_CHNL1_INTR_MAP</name>
          <description>ASRC_CHNL1_INTR mapping register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ASRC_CHNL1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASRC_CHNL1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZERO_DET_INTR_MAP</name>
          <description>ZERO_DET_INTR mapping register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ZERO_DET_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH0_INTR_MAP</name>
          <description>DMA_IN_CH0_INTR mapping register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_IN_CH0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_IN_CH0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH1_INTR_MAP</name>
          <description>DMA_IN_CH1_INTR mapping register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_IN_CH1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_IN_CH1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH2_INTR_MAP</name>
          <description>DMA_IN_CH2_INTR mapping register</description>
          <addressOffset>0x14c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_IN_CH2_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_IN_CH2_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH3_INTR_MAP</name>
          <description>DMA_IN_CH3_INTR mapping register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_IN_CH3_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_IN_CH3_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_IN_CH4_INTR_MAP</name>
          <description>DMA_IN_CH4_INTR mapping register</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_IN_CH4_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_IN_CH4_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH0_INTR_MAP</name>
          <description>DMA_OUT_CH0_INTR mapping register</description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_OUT_CH0_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_OUT_CH0_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH1_INTR_MAP</name>
          <description>DMA_OUT_CH1_INTR mapping register</description>
          <addressOffset>0x15c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_OUT_CH1_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_OUT_CH1_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH2_INTR_MAP</name>
          <description>DMA_OUT_CH2_INTR mapping register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_OUT_CH2_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_OUT_CH2_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH3_INTR_MAP</name>
          <description>DMA_OUT_CH3_INTR mapping register</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_OUT_CH3_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_OUT_CH3_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_OUT_CH4_INTR_MAP</name>
          <description>DMA_OUT_CH4_INTR mapping register</description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMA_OUT_CH4_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_OUT_CH4_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPSPI2_INTR_MAP</name>
          <description>GPSPI2_INTR mapping register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPSPI2_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPSPI2_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPSPI3_INTR_MAP</name>
          <description>GPSPI3_INTR mapping register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPSPI3_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPSPI3_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AES_INTR_MAP</name>
          <description>AES_INTR mapping register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AES_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AES_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SHA_INTR_MAP</name>
          <description>SHA_INTR mapping register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SHA_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHA_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECC_INTR_MAP</name>
          <description>ECC_INTR mapping register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ECC_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECC_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECDSA_INTR_MAP</name>
          <description>ECDSA_INTR mapping register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ECDSA_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECDSA_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
