esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>KM_INTR_MAP</name>
          <description>KM_INTR mapping register</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KM_INTR_MAP</name>
              <description>Configures the interrupt source into one CPU interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KM_INTR_PASS_IN_SEC</name>
              <description>Configures the PASS_IN_SEC flag of the interrupt source.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_0</name>
          <description>Status register for interrupt sources 0 ~ 31</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_STATUS_0</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_1</name>
          <description>Status register for interrupt sources 32 ~ 63</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_STATUS_1</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_2</name>
          <description>Status register for interrupt sources 64 ~ 95</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_STATUS_2</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_REG_3</name>
          <description>Status register for interrupt sources 96 ~ 97</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_STATUS_3</name>
              <description>Represents the status of the interrupt sources within interrupt-index-range 96 ~ 97. Each bit corresponds to one interrupt source
0:The corresponding interrupt source triggered an interrupt
1:No interrupt triggered</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_0</name>
          <description>PASS_IN_SEC status register for interrupt sources 0 ~ 31</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_0</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources within interrupt-index-range 0 ~ 31. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_1</name>
          <description>PASS_IN_SEC status register for interrupt sources 32 ~ 63</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_1</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources within interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_2</name>
          <description>PASS_IN_SEC status register for interrupt sources 64 ~ 95</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_2</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources within interrupt-index-range 64 ~ 95. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_PASS_IN_SEC_STATUS_3</name>
          <description>PASS_IN_SEC status register for interrupt sources 96 ~ 97</description>
          <addressOffset>0x1a4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_SRC_PASS_IN_SEC_STATUS_3</name>
              <description>Represents the PASS_IN_SEC status of the interrupt sources with interrupt-index-range 96 ~ 97. Each bit corresponds to one interrupt source
0:The corresponding interrupt source is not PASS_IN_SEC.
1:The corresponding interrupt source is PASS_IN_SEC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIG_IDX_ASSERT_IN_SEC</name>
          <description>reserved</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_SIG_IDX_ASSERT_IN_SEC</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURE_STATUS</name>
          <description>reserved</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INT_SECURE_STATUS</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Interrupt clock gating configure register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>REG_CLK_EN</name>
              <description>Interrupt clock gating configure register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTERRUPT_DATE</name>
          <description>Version control register</description>
          <addressOffset>0x7fc</addressOffset>
          <size>32</size>
          <resetValue>0x2504040</resetValue>
          <fields>
            <field>
              <name>INTERRUPT_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
