esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>KEYMNG</name>
      <description>KEYMNG Peripheral</description>
      <groupName>KEYMNG</groupName>
      <baseAddress>0x600a5000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xd8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLK</name>
          <description>Key Manager clock gate control register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>REG_CG_FORCE_ON</name>
              <description>Write 1 to force on register clock gate.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CG_FORCE_ON</name>
              <description>Write 1 to force on memory clock gate.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Key Manager interrupt raw register, valid in level.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the km_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the km_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_RAW</name>
              <description>The raw interrupt status bit  for the km_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>Key Manager interrupt status register.</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the km_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the km_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_ST</name>
              <description>The masked interrupt status bit  for the km_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>Key Manager interrupt enable register.</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the km_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the km_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POST_DONE_INT_ENA</name>
              <description>The interrupt enable bit  for the km_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>Key Manager interrupt clear register.</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PREP_DONE_INT_CLR</name>
              <description>Set this bit to clear the km_prep_done_int interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PROC_DONE_INT_CLR</name>
              <description>Set this bit to clear the km_proc_done_int interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>POST_DONE_INT_CLR</name>
              <description>Set this bit to clear the km_post_done_int interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATIC</name>
          <description>Key Manager static configuration register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x1e0</resetValue>
          <fields>
            <field>
              <name>USE_EFUSE_KEY</name>
              <description>Set each bit to choose efuse key instead of key manager deployed key. Each bit stands for a key type:bit 4 for psram_key; bit 3 for ds_key; bit 2 for hmac_key; bit 1 for flash_key; bit 0 for ecdsa_key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RND_SWITCH_CYCLE</name>
              <description>The core clock cycle number to sample one rng input data. Please set it bigger than the clock cycle ratio: T_rng/T_km</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_SW_INIT_KEY</name>
              <description>Set this bit to use software written init key instead of efuse_init_key.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_KEY_LEN</name>
              <description>Set this bit to choose flash crypt using xts-aes-256 or xts-aes-128. 1: use xts-aes-256. 0: use xts-aes-128.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_KEY_LEN</name>
              <description>Set this bit to choose psram crypt using xts-aes-256 or xts-aes-128. 1: use xts-aes-256. 0: use xts-aes-128.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Key Manager static configuration locker register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USE_EFUSE_KEY_LOCK</name>
              <description>Write 1 to lock reg_use_efuse_key. Each bit locks the corresponding bit of reg_use_efuse_key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RND_SWITCH_CYCLE_LOCK</name>
              <description>Write 1 to lock reg_rnd_switch_cycle.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USE_SW_INIT_KEY_LOCK</name>
              <description>Write 1 to lock reg_use_sw_init_key.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLASH_KEY_LEN_LOCK</name>
              <description>Write 1 to lock reg_flash_key_len.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_KEY_LEN_LOCK</name>
              <description>Write 1 to lock reg_psram_key_len.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>Key Manager configuration register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KGEN_MODE</name>
              <description>Set this field to choose the key generator deployment mode. 0: random mode. 1: AES mode. 2: ECDH0 mode. 3: ECDH1 mode. 4: recover mode. 5: export mode. 6-7: reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY_PURPOSE</name>
              <description>Set this field to choose the key purpose. 1: ecdsa_key_192. 2: ecdsa_key_256. 3: flash_256_1_key. 4: flash_256_2_key. 5: flash_128_key. 6: hmac_key. 7: ds_key. 8: psram_256_1_key. 9: psram_256_2_key. 10: psram_128_key. 11: ecdsa_key_384_l. 12: ecdsa_key_384_h. Others: reserved.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>Key Manager control register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>START</name>
              <description>Write 1 to continue Key Manager operation at LOAD/GAIN state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONTINUE</name>
              <description>Write 1 to start Key Manager at IDLE state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>Key Manager state register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>STATE</name>
              <description>The state of Key Manager. 0: IDLE. 1: LOAD. 2: GAIN. 3: BUSY.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Key Manager operation result register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PROC_RESULT</name>
              <description>The procedure result bit of Key Manager, only valid when Key Manager procedure is done. 1: Key Manager procedure succeeded. 0: Key Manager procedure failed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY_VLD</name>
          <description>Key Manager key status register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>KEY_ECDSA_192_VLD</name>
              <description>The status bit for key_ecdsa_192.   1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_ECDSA_256_VLD</name>
              <description>The status bit for key_ecdsa_256.   1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_FLASH_VLD</name>
              <description>The status bit for key_flash.     1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_HMAC_VLD</name>
              <description>The status bit for key_hmac.    1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_DS_VLD</name>
              <description>The status bit for key_ds.         1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_PSRAM_VLD</name>
              <description>The status bit for key_psram.   1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY_ECDSA_384_VLD</name>
              <description>The status bit for key_ecdsa_384.   1: The key has been deployed correctly. 0: The key has not been deployed yet.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HUK_VLD</name>
          <description>Key Manager HUK status register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HUK_VALID</name>
              <description>The HUK status. 0: HUK is not valid. 1: HUK is valid.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x2408140</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Key Manager version control register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>ASSIST_INFO_MEM[%s]</name>
          <description>The memory that stores assist key info.</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>PUBLIC_INFO_MEM[%s]</name>
          <description>The memory that stores public key info.</description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>SW_INIT_KEY_MEM[%s]</name>
          <description>The memory that stores software written init key.</description>
          <addressOffset>0x180</addressOffset>
          <size>8</size>
        </register>
