esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>EVT_TASK_EN2</name>
          <description>Ledc event task enable bit register2.</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TASK_FADE_RESTART_CH0_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH1_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH2_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH3_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH4_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH5_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH6_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH6 task.\\0: Disable\\1: Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESTART_CH7_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESTART_CH7 task.\\0: Disable\\1: Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH0_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH1_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH2_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH3_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH4_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH5_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH6_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH6 task.\\0: Disable\\1: Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_PAUSE_CH7_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_PAUSE_CH7 task.\\0: Disable\\1: Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH0_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH0 task.\\0: Disable\\1: Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH1_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH1 task.\\0: Disable\\1: Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH2_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH2 task.\\0: Disable\\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH3_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH3 task.\\0: Disable\\1: Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH4_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH4 task.\\0: Disable\\1: Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH5_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH5 task.\\0: Disable\\1: Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH6_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH6 task.\\0: Disable\\1: Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TASK_FADE_RESUME_CH7_EN</name>
              <description>Configures whether or not to enable LEDC_TASK_FADE_RESUME_CH7 task.\\0: Disable\\1: Enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER%s_CMP</name>
          <description>Ledc timer%s compare value register.</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CMP</name>
              <description>Configures the comparison value for LEDC timer%s.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMER%s_CNT_CAP</name>
          <description>Ledc timer%s captured count value register.</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TIMER_CNT_CAP</name>
              <description>Represents the captured LEDC timer%s count value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONF</name>
          <description>LEDC global configuration register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to open register clock gate.\\0: Open the clock gate only when application writes registers\\1: Force open the clock gate for register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH_POWER_UP_CONF</name>
          <description>LEDC channel power up configuration register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CH0_POWER_UP</name>
              <description>Configures whether or not to power up ch0.\\0: power down\\1: power up</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_POWER_UP</name>
              <description>Configures whether or not to power up ch1.\\0: power down\\1: power up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_POWER_UP</name>
              <description>Configures whether or not to power up ch2.\\0: power down\\1: power up</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_POWER_UP</name>
              <description>Configures whether or not to power up ch3.\\0: power down\\1: power up</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_POWER_UP</name>
              <description>Configures whether or not to power up ch4.\\0: power down\\1: power up</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_POWER_UP</name>
              <description>Configures whether or not to power up ch5.\\0: power down\\1: power up</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_POWER_UP</name>
              <description>Configures whether or not to power up ch6.\\0: power down\\1: power up</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_POWER_UP</name>
              <description>Configures whether or not to power up ch7.\\0: power down\\1: power up</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch0 clock gate.\\0: Open the clock gate only when ch0 is power up\\1: Force open the clock gate for ch0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch1 clock gate.\\0: Open the clock gate only when ch1 is power up\\1: Force open the clock gate for ch1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch2 clock gate.\\0: Open the clock gate only when ch2 is power up\\1: Force open the clock gate for ch2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch3 clock gate.\\0: Open the clock gate only when ch3 is power up\\1: Force open the clock gate for ch3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch4 clock gate.\\0: Open the clock gate only when ch4 is power up\\1: Force open the clock gate for ch4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch5 clock gate.\\0: Open the clock gate only when ch5 is power up\\1: Force open the clock gate for ch5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch6 clock gate.\\0: Open the clock gate only when ch6 is power up\\1: Force open the clock gate for ch6</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH7_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open ch7 clock gate.\\0: Open the clock gate only when ch7 is power up\\1: Force open the clock gate for ch7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMER_POWER_UP_CONF</name>
          <description>LEDC timer power up configuration register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>TIMER0_POWER_UP</name>
              <description>Configures whether or not to power up timer0.\\0: power down\\1: power up</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_POWER_UP</name>
              <description>Configures whether or not to power up timer1.\\0: power down\\1: power up</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_POWER_UP</name>
              <description>Configures whether or not to power up timer2.\\0: power down\\1: power up</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3_POWER_UP</name>
              <description>Configures whether or not to power up timer3.\\0: power down\\1: power up</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER0_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open timer0 clock gate.\\0: Open the clock gate only when timer0 is power up\\1: Force open the clock gate for timer0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER1_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open timer1 clock gate.\\0: Open the clock gate only when timer1 is power up\\1: Force open the clock gate for timer1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER2_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open timer2 clock gate.\\0: Open the clock gate only when timer2 is power up\\1: Force open the clock gate for timer2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMER3_CLK_GATE_FORCE_ON</name>
              <description>Configures whether or not to open timer3 clock gate.\\0: Open the clock gate only when timer3 is power up\\1: Force open the clock gate for timer3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0x2404170</resetValue>
          <fields>
            <field>
              <name>LEDC_DATE</name>
              <description>Configures the version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
