esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_AON</name>
      <description>LP_AON Peripheral</description>
      <groupName>LP_AON</groupName>
      <baseAddress>0x600b2800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x94</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>STORE0</name>
          <description>store the software massege0 in always-on field</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE0</name>
              <description>store the software massege0 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE1</name>
          <description>store the software massege1 in always-on field</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE1</name>
              <description>store the software massege1 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE2</name>
          <description>store the software massege2 in always-on field</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE2</name>
              <description>store the software massege2 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE3</name>
          <description>store the software massege3 in always-on field</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE3</name>
              <description>store the software massege3 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE4</name>
          <description>store the software massege4 in always-on field</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE4</name>
              <description>store the software massege4 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE5</name>
          <description>store the software massege5 in always-on field</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE5</name>
              <description>store the software massege5 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE6</name>
          <description>store the software massege6 in always-on field</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE6</name>
              <description>store the software massege6 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE7</name>
          <description>store the software massege7 in always-on field</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE7</name>
              <description>store the software massege7 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE8</name>
          <description>store the software massege8 in always-on field</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE8</name>
              <description>store the software massege8 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STORE9</name>
          <description>store the software massege9 in always-on field</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_AON_STORE9</name>
              <description>store the software massege9 in always-on field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_MUX</name>
          <description>select the lp io controlled by hp iomux or lp iomux</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>select the lp io 0~5 controlled by hp iomux or lp iomux
1: controlled by lp iomux
0: controlled by hp iomux</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_HOLD0</name>
          <description>configure all io hold</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_HOLD0</name>
              <description>configure io0~28 hold enable,when io in hold status, all io configure and output will be latch , input function is useful</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_HOLD1</name>
          <description>reserved</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GPIO_HOLD1</name>
              <description>reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CFG</name>
          <description>configure system register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0xff</resetValue>
          <fields>
            <field>
              <name>FIB</name>
              <description>get fib reg information</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_DOWNLOAD_BOOT_STATUS</name>
              <description>get force download mode status</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FORCE_DOWNLOAD_BOOT</name>
              <description>enable chip entry download mode or not
1: enable
0: no operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPSYS_SW_RESET</name>
              <description>enable hp system reset by software or not
1: reset
0: no operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUCORE_CFG</name>
          <description>configure core reset register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <resetValue>0x4000400</resetValue>
          <fields>
            <field>
              <name>CPU_CORE0_SW_STALL</name>
              <description>enable cpu 0 entry stall status
0x86: entry stall status
Others : no operation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_CORE0_SW_RESET</name>
              <description>enable core 0 reset by software
1: reset
0: no operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPU_CORE0_OCD_HALT_ON_RESET</name>
              <description>reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_CORE0_STAT_VECTOR_SEL</name>
              <description>configure core 0 boot address
1: ROM
0: lp memory</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_CORE1_SW_STALL</name>
              <description>enable core 1 entry stall status
0x86: entry stall status
Others : no operation</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_CORE1_SW_RESET</name>
              <description>enable core1 reset by software
1: reset
0: no operation</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CPU_CORE1_OCD_HALT_ON_RESET</name>
              <description>reserved</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_CORE1_STAT_VECTOR_SEL</name>
              <description>configure core1 boot address
1: ROM
0: lp memory</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSTIMER_STALL_SEL</name>
              <description>selete which core run_stall to lp_timer
1: core1
0: core0</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_MUX</name>
          <description>configure hp iomux reset bypass</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PULL_LDO_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PULL_LDO</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_DISABLE</name>
              <description>bypass hp iomux reset from hp system reset event
1: bypass
0: no operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP_CNTL</name>
          <description>configure alwayson external io wakeup</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_WAKEUP_SEL</name>
              <description>enable io0~15 bit map use to external wakeup
1: enable
0: disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_WAKEUP_LV</name>
              <description>select external wakeup io level 
1: io high level wakeup
0: io low level wakeup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EXT_WAKEUP_CNTL1</name>
          <description>configure alwayson external io wakeup</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXT_WAKEUP_STATUS</name>
              <description>get external wakeup status bitmap</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EXT_WAKEUP_STATUS_CLR</name>
              <description>clear external wakeup status
1: clear
0: no operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EXT_WAKEUP_FILTER</name>
              <description>enable external filter or not 
1: enable
0: disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB</name>
          <description>configure usb reset bypass</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RESET_DISABLE</name>
              <description>bypass usb reset from hp system reset event
1: bypass
0: no operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LPBUS</name>
          <description>Select lp memory bus</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0xb0000000</resetValue>
          <fields>
            <field>
              <name>FAST_MEM_MUX_FSM_IDLE</name>
              <description>get current lp memory bus fsm status</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_MEM_MUX_SEL_STATUS</name>
              <description>get current lp memory bus mode</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FAST_MEM_MUX_SEL_UPDATE</name>
              <description>enable reg_fast_mem_sel configure
1: enable
0: no operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FAST_MEM_MUX_SEL</name>
              <description>select lp memory bus is high speed mode or low speed mode
1: high speed from hp system ahb
0: low speed from lp system</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDIO_ACTIVE</name>
          <description>configure sdio act dnum</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x2800000</resetValue>
          <fields>
            <field>
              <name>SDIO_ACT_DNUM</name>
              <description>reserved</description>
              <bitOffset>22</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_CCT</name>
          <description>configure sar cct</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SAR2_PWDET_CCT</name>
              <description>configure sar cct</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_BUS</name>
          <description>configure modem sync bridge</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEM_SYNC_BRIDGE_EN</name>
              <description>enable modem sync bridge or not
1: enable
0: disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPRAM_CTRL</name>
          <description>configure lp memory power status</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <resetValue>0x2850</resetValue>
          <fields>
            <field>
              <name>SPRAM_MEM_AUX_CTRL</name>
              <description>configure lp memory power status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPRF_CTRL</name>
          <description>configure memory in lp system power status</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0x2850</resetValue>
          <fields>
            <field>
              <name>SPRF_MEM_AUX_CTRL</name>
              <description>configure memory in lp system power status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_SEL0</name>
          <description>reserved</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_DEBUG_SEL0</name>
              <description>need des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_DEBUG_SEL1</name>
              <description>need des</description>
              <bitOffset>7</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_DEBUG_SEL2</name>
              <description>need des</description>
              <bitOffset>14</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_DEBUG_SEL3</name>
              <description>need des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBUG_SEL1</name>
          <description>need des</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LP_DEBUG_SEL4</name>
              <description>need des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_DMA_CFG0</name>
          <description>configure regdma always on register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0x14a</resetValue>
          <fields>
            <field>
              <name>BURST_LIMIT_AON</name>
              <description>Set this field to configure max value of burst in signle transfer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_INTERVAL_AON</name>
              <description>Set this field to configure read registers' interval time in reading mode.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRANCH_LINK_LENGTH_AON</name>
              <description>Set this field to configure link address.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGDMA_ERROR</name>
              <description>regdma error code</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
