esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>BACKUP_DMA_CFG1</name>
          <description>configure regdma always on register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0x6419064</resetValue>
          <fields>
            <field>
              <name>LINK_WAIT_TOUT_THRES_AON</name>
              <description>Set this field to configure the number of consecutive links of link list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINK_WORK_TOUT_THRES_AON</name>
              <description>Set this field to configure maximum waiting time in waiting mode.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINK_BACKUP_TOUT_THRES_AON</name>
              <description>Set this field to configure maximum waiting time in backup mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AON_BYPASS</name>
              <description>reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BACKUP_DMA_CFG2</name>
          <description>configure regdma always on register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LINK_ADDR_AON</name>
              <description>Set this field to configure link address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEM_CTRL</name>
          <description>configure rmemory power in lp system register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0x20</resetValue>
          <fields>
            <field>
              <name>EFUSE_MEM_LP_MODE</name>
              <description>Configures efuse memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_MEM_LP_EN</name>
              <description>Set this bit to power down efuse memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFUSE_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control efuse memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUK_MEM_LP_MODE</name>
              <description>Configures huk memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUK_MEM_LP_EN</name>
              <description>Set this bit to power down huk memory.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HUK_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control huk memory, disbale hardware control.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MEM_CTRL</name>
          <description>configure rmemory power in lp system register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODEM_MEM_LP_MODE</name>
              <description>Configures modem memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_MEM_LP_EN</name>
              <description>Set this bit to power down modem memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control modem memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_MEM_LP_MODE</name>
              <description>Configures mmu memory low power mode in low power stage.\\
0: deep sleep\\
1: light sleep\\
2(default): shut down\\
3: disable low power stage\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_MEM_LP_EN</name>
              <description>Set this bit to power down mmu memory.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MMU_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control mmu memory, disbale hardware control.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SRAM_MEM_LP_MODE</name>
              <description>Configures hp_sram memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SRAM_MEM_LP_EN</name>
              <description>Set this bit to power down hp_sram memory.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HP_SRAM_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control hp_sram memory, disbale hardware control.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IO_LDO_CFG</name>
          <description>need_des</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>IO_LDO_3P3_SW</name>
              <description>need_des</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IO_LDO_3P3_SW_EN</name>
              <description>need_des</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IO_LDO_ADJUST_SW</name>
              <description>need_des</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IO_LDO_ADJUST_SW_EN</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_PHY_SEL</name>
          <description>need des</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SW_HW_USB_PHY_SEL</name>
              <description>0: the control bit of efuse will determine whether to exchange usb0/1_phy,1:  LP_AON_SW_USB_PHY_SEL will determine whether to exchange usb0/1_phy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_USB_PHY_SEL</name>
              <description>when LP_AON_SW_HW_USB_PHY_SEL is configured as 1 , a register value of 0 means no swapping the phy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAM_USAGE_CONF</name>
          <description>HP memory usage configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>DCACHE_USAGE</name>
              <description>hp system memory is splited to 7 layers(Layer0 ~ Layer6) in total, this field is used to control the first layer(Layer0) usage. 0: cpu use hp-memory. 1: dcache use hp-mmory. 
By default, dcache is closed, and typically users can enable dcache after boot-loader, but before user's BIN start runing.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE1_USAGE</name>
              <description>hp system memory is splited to 7 layers(Layer0 ~ Layer6) in total, this field is used to control the last layer(Layer6) usage. 0: cpu use hp-memory. 1: icache1 use hp-mmory.  \\
By default, icache1 is not disabled, and the last layer memory blongs to icache1. Typically users can set this bit to 0 to disable icache1 in boot-loader.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUF_CONF</name>
          <description>PUF mem control config register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>PUF_SW</name>
              <description>puf mem power switch control signal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUF_ISO_EN</name>
              <description>iso enable signal for puf mem</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUF_MEM_DISCHARGE</name>
              <description>discharge signal for puf mem</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>reserved</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2504290</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>version register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>version register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
