esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>LPPERI_CTRL</name>
          <description>lpperi read/write control register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LPPERI</name>
              <description>Configures lpperi registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LPPERI</name>
              <description>Configures lpperi registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LPPERI</name>
              <description>Configures lpperi registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LPPERI</name>
              <description>Configures lpperi registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LPPERI</name>
              <description>Configures lpperi registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LPPERI</name>
              <description>Configures lpperi registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LPPERI</name>
              <description>Configures lpperi registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LPPERI</name>
              <description>Configures lpperi registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_ANA_PERI_CTRL</name>
          <description>lp_ana_peri read/write control register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_ANA_PERI</name>
              <description>Configures lp_ana_peri registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TOUCH_CTRL</name>
          <description>lp_touch read/write control register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_TOUCH</name>
              <description>Configures lp_touch registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_TOUCH</name>
              <description>Configures lp_touch registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_TOUCH</name>
              <description>Configures lp_touch registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_TOUCH</name>
              <description>Configures lp_touch registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_TOUCH</name>
              <description>Configures lp_touch registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_TOUCH</name>
              <description>Configures lp_touch registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_TOUCH</name>
              <description>Configures lp_touch registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_TOUCH</name>
              <description>Configures lp_touch registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TOUCH_AON_CTRL</name>
          <description>touch_aon read/write control register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_TOUCH_AON</name>
              <description>Configures touch_aon registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_TOUCH_AON</name>
              <description>Configures touch_aon registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_TOUCH_AON</name>
              <description>Configures touch_aon registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_TOUCH_AON</name>
              <description>Configures touch_aon registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_TOUCH_AON</name>
              <description>Configures touch_aon registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_TOUCH_AON</name>
              <description>Configures touch_aon registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_TOUCH_AON</name>
              <description>Configures touch_aon registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_TOUCH_AON</name>
              <description>Configures touch_aon registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_IO_CTRL</name>
          <description>lp_io read/write control register</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_IO</name>
              <description>Configures lp_io registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_IO</name>
              <description>Configures lp_io registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_IO</name>
              <description>Configures lp_io registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_IO</name>
              <description>Configures lp_io registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_IO</name>
              <description>Configures lp_io registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_IO</name>
              <description>Configures lp_io registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_IO</name>
              <description>Configures lp_io registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_IO</name>
              <description>Configures lp_io registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_BLE_TIMER_CTRL</name>
          <description>lp_ble_timer read/write control register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_BLE_TIMER</name>
              <description>Configures lp_ble_timer registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LP_TEE_CTRL</name>
          <description>lp_tee read/write control register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LP_TEE</name>
              <description>Configures lp_tee registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LP_TEE</name>
              <description>Configures lp_tee registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_LP_TEE</name>
              <description>Configures lp_tee registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_LP_TEE</name>
              <description>Configures lp_tee registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_LP_TEE</name>
              <description>Configures lp_tee registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LP_TEE</name>
              <description>Configures lp_tee registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_LP_TEE</name>
              <description>Configures lp_tee registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_LP_TEE</name>
              <description>Configures lp_tee registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
