esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LP_WDT</name>
      <description>Low-power Watchdog Timer</description>
      <groupName>LP_WDT</groupName>
      <baseAddress>0x600b5400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG0</name>
          <description>Configure the RWDT operation.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x13200</resetValue>
          <fields>
            <field>
              <name>WDT_PAUSE_IN_SLP</name>
              <description>Configure whether or not pause RWDT when chip is in sleep mode.\\0:Enable \\1:Disable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_APPCPU_RESET_EN</name>
              <description>Configure whether or not to enable RWDT to reset CPU.\\0:Disable \\1:Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_PROCPU_RESET_EN</name>
              <description>need_des</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_FLASHBOOT_MOD_EN</name>
              <description>Configure whether or not enable RWDT when chip is in SPI boot mode.\\0:Disable \\1:Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_SYS_RESET_LENGTH</name>
              <description>Configure the HP core reset time.\\Measurement unit: LP\_DYN\_FAST\_CLK</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CPU_RESET_LENGTH</name>
              <description>Configure the HP CPU reset time.\\Measurement unit: LP\_DYN\_FAST\_CLK</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG3</name>
              <description>Configure the timeout action of stage3.\\0: No operation \\1:Generate interrupt \\2 :Generate HP CPU reset \\3:Generate HP core reset \\4 :Generate system reset.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG2</name>
              <description>Configure the timeout action of stage2.\\0: No operation \\1:Generate interrupt \\2 :Generate HP CPU reset \\3:Generate HP core reset \\4 :Generate system reset.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG1</name>
              <description>Configure the timeout action of stage1.\\0: No operation \\1:Generate interrupt \\2 :Generate HP CPU reset \\3:Generate HP core reset \\4 :Generate system reset.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG0</name>
              <description>Configure the timeout action of stage0.\\0: No operation \\1:Generate interrupt \\2 :Generate HP CPU reset \\3:Generate HP core reset \\4 :Generate system reset.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_EN</name>
              <description>Configure whether or not to enable RWDT.\\0:Disable \\1:Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG1</name>
          <description>Configure the RWDT timeout of stage0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <resetValue>0x30d40</resetValue>
          <fields>
            <field>
              <name>WDT_STG0_HOLD</name>
              <description>Configure the timeout time for stage0. \\Measurement unit: LP\_DYN\_SLOW\_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG2</name>
          <description>Configure the RWDT timeout of stage1</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <resetValue>0x13880</resetValue>
          <fields>
            <field>
              <name>WDT_STG1_HOLD</name>
              <description>Configure the timeout time for stage1. \\Measurement unit: LP\_DYN\_SLOW\_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG3</name>
          <description>Configure the RWDT timeout of stage2</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>WDT_STG2_HOLD</name>
              <description>Configure the timeout time for stage2. \\Measurement unit: LP\_DYN\_SLOW\_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG4</name>
          <description>Configure the RWDT timeout of stage3</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0xfff</resetValue>
          <fields>
            <field>
              <name>WDT_STG3_HOLD</name>
              <description>Configure the timeout time for stage3. \\Measurement unit: LP\_DYN\_SLOW\_CLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG5</name>
          <description>Configure the RWDT timeout of stage3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0xff</resetValue>
          <fields>
            <field>
              <name>WDT_CHIP_RESET_TARGET</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CHIP_RESET_EN</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CHIP_RESET_KEY</name>
              <description>need_des</description>
              <bitOffset>9</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FEED</name>
          <description>Configure the feed function of RWDT</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RTC_WDT_FEED</name>
              <description>Configure this bit to feed the RWDT.\\ 0: Invalid\\ 1: Feed RWDT</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WPROTECT</name>
          <description>Configure the lock function of SWD</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WDT_WKEY</name>
              <description>Configure this field to lock or unlock RWDT`s configuration registers.\\0x50D83AA1: unlock the RWDT configuration registers.\\ Others value: Lock the RWDT configuration register which can`t be modified by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_CONFIG</name>
          <description>Configure the SWD operation</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x12c00000</resetValue>
          <fields>
            <field>
              <name>SWD_RESET_FLAG</name>
              <description>Represents the SWD whether has generated the reset signal.\\0 :No \\1: Yes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWD_AUTO_FEED_EN</name>
              <description>Configure this bit to enable to feed SWD automatically by hardware. \\0: Disable \\1: Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_RST_FLAG_CLR</name>
              <description>Configure this bit to clear SWD reset flag.\\ 0:Invalid \\ 1: Clear the reset flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWD_SIGNAL_WIDTH</name>
              <description>Configure the SWD signal length that output to analog circuit. \\ Measurement unit: LP\_DYN\_FAST\_CLK</description>
              <bitOffset>20</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_DISABLE</name>
              <description>Configure this bit to disable the SWD.\\ 0: Enable the SWD\\ 1: Disable the SWD</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SWD_FEED</name>
              <description>Configure this bit to feed the SWD.\\ 0: Invalid\\ 1: Feed SWD</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWD_WPROTECT</name>
          <description>Configure the lock function of SWD</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWD_WKEY</name>
              <description>Configure this field to lock or unlock SWD`s configuration registers.\\0x50D83AA1: unlock the RWDT configuration registers.\\ Others value: Lock the RWDT configuration register which can`t be modified by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Configure whether to generate timeout interrupt</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_RAW</name>
              <description>Represents the SWD whether or not generates timeout interrupt.\\ 0:No \\1: Yes</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_WDT_INT_RAW</name>
              <description>Represents the RWDT whether or not generates timeout interrupt.\\ 0:No \\1: Yes</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ST</name>
          <description>The interrupt status register of WDT</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_ST</name>
              <description>Represents the SWD whether or not has generated and sent timeout interrupt to CPU.\\ 0:No \\1: Yes</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LP_WDT_INT_ST</name>
              <description>Represents the RWDT whether or not has generated and  sent timeout interrupt to CPU.\\ 0:No \\1: Yes</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA</name>
          <description>The interrupt enable register of WDT</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_ENA</name>
              <description>Configure whether or not to enable the SWD  to send timeout interrupt.\\0:Disable \\1:Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LP_WDT_INT_ENA</name>
              <description>Configure whether or not to enable the RWDT to send timeout interrupt.\\0:Disable \\1:Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_CLR</name>
          <description>The interrupt clear register of WDT</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SUPER_WDT_INT_CLR</name>
              <description>Configure whether to clear the timeout interrupt signal sent by SWD to CPU.\\0: No\\1: Yes</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LP_WDT_INT_CLR</name>
              <description>Configure whether to clear the timeout interrupt signal sent by RWDT to CPU.\\0: No\\1: Yes</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>need_des</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2404150</resetValue>
          <fields>
            <field>
              <name>LP_WDT_DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>Reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
