esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>SARADC_CONF</name>
          <description>SARADC configuration register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>SARADC_CLK_EN</name>
              <description>no use</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_RST_EN</name>
              <description>Set 1 to reset function_register of saradc module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_REG_CLK_EN</name>
              <description>Set 1 to enable saradc apb clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_REG_RST_EN</name>
              <description>Set 1 to reset apb_register of saradc module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SARADC_CLKM_CONF</name>
          <description>SARADC_CLKM configuration register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SARADC_CLKM_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_DIV_B</name>
              <description>The numerator of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the saradc function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_SEL</name>
              <description>Configures the clock source of SAR ADC.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SARADC_CLKM_EN</name>
              <description>Set 1 to enable saradc function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSENS_CLK_CONF</name>
          <description>TSENS_CLK configuration register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TSENS_CLK_SEL</name>
              <description>Configures the clock source of the temperature sensor.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_CLK_EN</name>
              <description>Set 1 to enable tsens clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSENS_RST_EN</name>
              <description>Set 1 to reset tsens module</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DEVICE_CONF</name>
          <description>USB_DEVICE configuration register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>USB_DEVICE_CLK_EN</name>
              <description>Set 1 to enable usb_device clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_RST_EN</name>
              <description>Set 1 to reset usb_device module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_READY</name>
              <description>Query this field after reset usb_device module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_DEVICE_MEM_LP_CTRL</name>
          <description>USB_DEVICE memory power control register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_DEVICE_MEM_LP_MODE</name>
              <description>Configures usb_device memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_MEM_LP_EN</name>
              <description>Set this bit to power down usb_device memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_DEVICE_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control usb_device memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMTX_CONF</name>
          <description>INTMTX configuration register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0x39</resetValue>
          <fields>
            <field>
              <name>INTMTX_CORE0_CLK_EN</name>
              <description>Set 1 to enable core0 intmtx clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE0_RST_EN</name>
              <description>Set 1 to reset core0 intmtx module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE1_CLK_EN</name>
              <description>Set 1 to enable core1 intmtx clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE1_RST_EN</name>
              <description>Set 1 to reset core1 intmtx module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX_CORE0_READY</name>
              <description>Query this field after reset intmtx module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTMTX_CORE1_READY</name>
              <description>Query this field after reset intmtx module</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PCNT_CONF</name>
          <description>PCNT configuration register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x10</resetValue>
          <fields>
            <field>
              <name>PCNT_CLK_EN</name>
              <description>Set 1 to enable pcnt clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_RST_EN</name>
              <description>Set 1 to reset pcnt module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_REG_CLK_EN</name>
              <description>Set 1 to enable pcnt reg clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_REG_RST_EN</name>
              <description>Set 1 to reset pcnt reg module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_READY</name>
              <description>Query this field after reset pcnt module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PCNT_CLK_SEL</name>
              <description>Configures the clock source of the pcnt.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F32M_CLK\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pcnt function clock.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_CONF</name>
          <description>ETM configuration register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>ETM_CLK_EN</name>
              <description>Set 1 to enable etm clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_RST_EN</name>
              <description>Set 1 to reset etm module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETM_READY</name>
              <description>Query this field after reset etm module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_CONF</name>
          <description>PWM0 configuration register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>PWM0_CLK_EN</name>
              <description>Set 1 to enable pwm0 clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_RST_EN</name>
              <description>Set 1 to reset pwm0 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_READY</name>
              <description>Query this field after reset pwm0 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_CLK_CONF</name>
          <description>PWM0_CLK configuration register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>PWM0_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pwm0 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_CLKM_SEL</name>
              <description>Configures the clock source of MCPWM0.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM0_CLKM_EN</name>
              <description>set this field as 1 to activate pwm0 clkm.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_CONF</name>
          <description>PARL_IO configuration register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>PARL_CLK_EN</name>
              <description>Set 1 to enable parl apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_RST_EN</name>
              <description>Set 1 to reset parl apb reg</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_READY</name>
              <description>Query this field after reset parl module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_CLK_RX_CONF</name>
          <description>PARL_CLK_RX configuration register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PARL_CLK_RX_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the parl rx clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_RX_SEL</name>
              <description>Configures the clock source of Paraller IO RX\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F240M_CLK\\
3: Use the clock from chip pin\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_RX_EN</name>
              <description>Set 1 to enable parl rx clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_RX_RST_EN</name>
              <description>Set 1 to reset parl rx module</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_CLK_TX_CONF</name>
          <description>PARL_CLK_TX configuration register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PARL_CLK_TX_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the parl tx clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_TX_SEL</name>
              <description>Configures the clock source of Paraller IO RX\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F240M_CLK\\
3: Use the clock from chip pin\\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_CLK_TX_EN</name>
              <description>Set 1 to enable parl tx clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARL_TX_RST_EN</name>
              <description>Set 1 to reset parl tx module</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_CONF</name>
          <description>PVT_MONITOR configuration register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x1c</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_CLK_EN</name>
              <description>Set 1 to enable apb clock of pvt module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_RST_EN</name>
              <description>Set 1 to reset all pvt monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE1_CLK_EN</name>
              <description>Set 1 to enable function clock of modem pvt module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE2_CLK_EN</name>
              <description>Set 1 to enable function clock of cpu pvt module</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_SITE3_CLK_EN</name>
              <description>Set 1 to enable function clock of hp_peri pvt module</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PVT_MONITOR_FUNC_CLK_CONF</name>
          <description>PVT_MONITOR function clock configuration register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x100000</resetValue>
          <fields>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pvt_monitor function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_SEL</name>
              <description>Configures the clock source of PVT MONITER.\\
0: XTAL_CLK\\
1(default): PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVT_MONITOR_FUNC_CLK_EN</name>
              <description>Set 1 to enable source clock of pvt sitex</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDMA_CONF</name>
          <description>GDMA configuration register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>GDMA_CLK_EN</name>
              <description>Set 1 to enable gdma clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GDMA_RST_EN</name>
              <description>Set 1 to reset gdma module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI2_CONF</name>
          <description>SPI2 configuration register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>SPI2_CLK_EN</name>
              <description>Set 1 to enable spi2 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_RST_EN</name>
              <description>Set 1 to reset spi2 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2_READY</name>
              <description>Query this field after reset spi2 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
