esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>TCM_MEM_MONITOR_CONF</name>
          <description>TCM_MEM_MONITOR configuration register</description>
          <addressOffset>0x16c</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>TCM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable tcm_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_RST_EN</name>
              <description>Set 1 to reset tcm_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TCM_MEM_MONITOR_READY</name>
              <description>Query this field after reset tcm_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSRAM_MEM_MONITOR_CONF</name>
          <description>PSRAM_MEM_MONITOR configuration register</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>PSRAM_MEM_MONITOR_CLK_EN</name>
              <description>Set 1 to enable psram_mem_monitor clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_RST_EN</name>
              <description>Set 1 to reset psram_mem_monitor module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM_MEM_MONITOR_READY</name>
              <description>Query this field after reset psram_mem_monitor module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESET_EVENT_BYPASS</name>
          <description>reset event bypass backdoor configuration register</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TEE_APM</name>
              <description>This field is used to control reset event relationship for tee_apm. 1: tee_apm will only be reset by power-reset. some reset event will be bypass. 0:tee_apm will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCR</name>
              <description>This field is used to control reset event relationship for pcr. 1: pcr will only be reset by power-reset. some reset event will be bypass. 0:pcr will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPSYSREG</name>
              <description>This field is used to control reset event relationship for hpsysreg. 1: hpsysreg will only be reset by power-reset. some reset event will be bypass. 0:hpsysreg will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOMUX</name>
              <description>This field is used to control reset event relationship for iomux. 1: iomux will only be reset by power-reset. some reset event will be bypass. 0:iomux will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX0</name>
              <description>This field is used to control reset event relationship for intmtx0. 1: intmtx0 will only be reset by power-reset. some reset event will be bypass. 0:intmtx0 will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTMTX1</name>
              <description>This field is used to control reset event relationship for intmtx1. 1: intmtx1 will only be reset by power-reset. some reset event will be bypass. 0:intmtx1 will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM</name>
              <description>This field is used to control reset event relationship for modem. 1: modem will only be reset by power-reset. some reset event will be bypass. 0:modem will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUS_MODEM</name>
              <description>This field is used to control reset event relationship for bus_modem. 1: bus_modem will only be reset by power-reset. some reset event will be bypass. 0:bus_modem will not only be reset by power-reset, but also some reset event.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPCORE_MEM_LP_CTRL</name>
          <description>HP CORE0 &amp; HP CORE1 memory power control register</description>
          <addressOffset>0x178</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HPCORE_MEM_LP_MODE</name>
              <description>Configures memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPCORE_MEM_LP_EN</name>
              <description>Set this bit to power down HP CORE0 &amp; HP CORE1 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HPCORE_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control HP CORE0 &amp; HP CORE1 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG11_CONF</name>
          <description>USB_OTG configuration register</description>
          <addressOffset>0x17c</addressOffset>
          <size>32</size>
          <resetValue>0x5</resetValue>
          <fields>
            <field>
              <name>USB_OTG11_CLK_EN</name>
              <description>Set 1 to enable usb_otg11 clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTG11_RST_EN</name>
              <description>Set 1 to reset usb_otg11 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTG11_READY</name>
              <description>Query this field after reset usb_otg11 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_OTG11_MEM_LP_CTRL</name>
          <description>USB_OTG11 memory power control register</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>USB_OTG11_MEM_LP_MODE</name>
              <description>Configures usb_otg11 memory low power mode in low power stage.\\
0(default): deep sleep\\
1: light sleep\\
2: shut down\\
3: disable low power stage\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTG11_MEM_LP_EN</name>
              <description>Set this bit to power down usb_otg11 memory.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_OTG11_MEM_FORCE_CTRL</name>
              <description>Set this bit to force software control usb_otg11 memory, disbale hardware control.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDM_INV_PHASE_CONF</name>
          <description>xxxx</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <resetValue>0x400</resetValue>
          <fields>
            <field>
              <name>CLK_SDM_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SDM_INV_PHASE_SEL</name>
              <description>xxxx</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_TXLO_INV_PHASE_ENA</name>
              <description>xxxx</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SDM_TXLO_INV_PHASE_SEL</name>
              <description>xxxx</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_SDM_EN</name>
              <description>xxxx</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_TXLO_DIV2_EN</name>
              <description>xxxx</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE1_CONF</name>
          <description>USB_OTG configuration register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>CORE1_CLK_EN</name>
              <description>Set 1 to enable core1 clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CORE1_RST_EN</name>
              <description>Set 1 to reset core1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_CONF</name>
          <description>I2C configuration register</description>
          <addressOffset>0x18c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C1_CLK_EN</name>
              <description>Set 1 to enable i2c1 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_RST_EN</name>
              <description>Set 1 to reset i2c1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>I2C1_SCLK_CONF</name>
          <description>I2C_SCLK configuration register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2C1_SCLK_DIV_A</name>
              <description>The  denominator of the frequency divider factor of the i2c1 function clock.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_DIV_B</name>
              <description>The numerator of the frequency divider factor of the i2c1 function clock.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the i2c1 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_SEL</name>
              <description>Configures the clock source of I2C.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1_SCLK_EN</name>
              <description>Set 1 to enable i2c function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1_CONF</name>
          <description>PWM1 configuration register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>PWM1_CLK_EN</name>
              <description>Set 1 to enable pwm1 clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1_RST_EN</name>
              <description>Set 1 to reset pwm1 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1_READY</name>
              <description>Query this field after reset pwm1 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1_CLK_CONF</name>
          <description>PWM1_CLK configuration register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <resetValue>0x4000</resetValue>
          <fields>
            <field>
              <name>PWM1_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the pwm1 function clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1_CLKM_SEL</name>
              <description>Configures the clock source of MCPWM1.\\
0 (default): XTAL_CLK\\
1: RC_FAST_CLK\\
2: PLL_F160M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM1_CLKM_EN</name>
              <description>set this field as 1 to activate pwm1 clkm.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI3_CONF</name>
          <description>SPI3 configuration register</description>
          <addressOffset>0x19c</addressOffset>
          <size>32</size>
          <resetValue>0x6</resetValue>
          <fields>
            <field>
              <name>SPI3_CLK_EN</name>
              <description>Set 1 to enable spi3 apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_RST_EN</name>
              <description>Set 1 to reset spi3 module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_READY</name>
              <description>Query this field after reset spi3 module</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI3_CLKM_CONF</name>
          <description>SPI3_CLKM configuration register</description>
          <addressOffset>0x1a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI3_CLKM_DIV_NUM</name>
              <description>The integral part of the frequency divider factor of the spi3_mst clock.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_CLKM_SEL</name>
              <description>Configures the clock source of SPI3.\\
0 (default): XTAL_CLK\\
1: PLL_F160M_CLK\\
2: RC_FAST_CLK\\
3: PLL_F120M_CLK\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3_CLKM_EN</name>
              <description>Set 1 to enable spi3 function clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRC_FUNC_CLK_CONF</name>
          <description>AUDIO_SAMPLE_RATE_FUNC_CLK configuration register</description>
          <addressOffset>0x1a8</addressOffset>
          <size>32</size>
          <resetValue>0xc00000</resetValue>
          <fields>
            <field>
              <name>ASRC_APB_CLK_EN</name>
              <description>Set 1 to enable audio_sample rate converter apb clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASRC_FUNC_CLK_EN</name>
              <description>Set 1 to enable audio_sample rate converter function clock</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASRC_RST_EN</name>
              <description>Set 1 to reset audio_sample_rate_converter module</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_CLOCK_GATE_BYPASS</name>
          <description>bus clock gating bypass configuration register</description>
          <addressOffset>0x1ac</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>AHB_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for ahb bus</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APB_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for apb bus</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXI_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for axi bus</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_CLK_GATING_BYPASS</name>
              <description>Set 1 to bypass the clock gating for mem bus</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZERO_DET_CONF</name>
          <description>ZERO_DET configuration register</description>
          <addressOffset>0x1b0</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>ZERO_DET_CLK_EN</name>
              <description>Set 1 to enable zero_det apb clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ZERO_DET_RST_EN</name>
              <description>Set 1 to reset zero_det module</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
