esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>COMB_PD_SITE2_UNIT3_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT0_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE2_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT1_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE2_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT2_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE2_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE2_UNIT3_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xf4</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE2_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xf8</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0xfc</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT0_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT0_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT1_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE3_UNIT1</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT2_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE3_UNIT2</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT3_VT1_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT1_PD_SITE3_UNIT3</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COMB_PD_SITE3_UNIT0_VT2_CONF1</name>
          <description>needs desc</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x50</resetValue>
          <fields>
            <field>
              <name>MONITOR_EN_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMING_ERR_CNT_CLR_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DELAY_LIMIT_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY_NUM_O_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>23</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TIMING_ERR_VT2_PD_SITE3_UNIT0</name>
              <description>needs field desc</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
