esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RMT</name>
      <description>Remote Control</description>
      <groupName>RMT</groupName>
      <baseAddress>0x6001e000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x78</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sDATA</name>
          <description>The read and write data register for channel %s by APB FIFO access.</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHDATA</name>
              <description>Read and write data for channel %s via APB FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sCONF0</name>
          <description>Configuration register 0 for channel %s</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x710200</resetValue>
          <fields>
            <field>
              <name>TX_START_CH</name>
              <description>Configures whether to enable sending data in channel %s. \\
0: No effect\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_RD_RST_CH</name>
              <description>Configures whether to reset RAM read address accessed by the transmitter for channel %s. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB_MEM_RST_CH</name>
              <description>Configures whether to reset RAM W/R address accessed by APB FIFO for channel %s. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_CONTI_MODE_CH</name>
              <description>Configures whether to enable continuous TX mode for channel %s. \\
0: No Effect\\
1: Enable\\
In this mode, the transmitter starts transmission from the first data. If an end-marker is encountered, the transmitter starts transmitting data from the first data again. if no end-marker is encountered, the transmitter starts transmitting the first data again when the last data is transmitted.\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_TX_WRAP_EN_CH</name>
              <description>Configures whether to enable wrap TX mode for channel %s. \\
0: No effect\\
1: Enable\\
In this mode, if the TX data size is larger than the channel's RAM block size, the transmitter continues transmitting the first data to the last data in loops.\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_OUT_LV_CH</name>
              <description>Configures the level of output signal for channel %s when the transmitter is in idle state.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_OUT_EN_CH</name>
              <description>Configures whether to enable the output for channel %s in idle state. \\
0: No effect\\
1: Enable\\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_STOP_CH</name>
              <description>Configures whether to stop the transmitter of channel %s sending data out. \\
0: No effect\\
1: Stop\\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV_CNT_CH</name>
              <description>Configures the divider for clock of channel %s. \\
Measurement unit: rmt_sclk\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_SIZE_CH</name>
              <description>Configures the maximum number of memory blocks allocated to channel %s.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EFF_EN_CH</name>
              <description>Configures whether to add carrier modulation on the output signal only at data-sending state for channel %s. \\
0: Add carrier modulation on the output signal at data-sending state and idle state for channel %s\\
1: Add carrier modulation on the output signal only at data-sending state for channel %s\\
Only valid when RMT_CARRIER_EN_CH%s is 1.\\</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EN_CH</name>
              <description>Configures whether to enable the carrier modulation on output signal for channel %s. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_OUT_LV_CH</name>
              <description>Configures the position of carrier wave for channel %s. \\
0: Add carrier wave on low level\\
1: Add carrier wave on high level\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFIFO_RST_CH</name>
              <description>Reserved</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONF_UPDATE_CH</name>
              <description>Synchronization bit for channel %s.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>2,3</dimIndex>
          <name>CH%sCONF0</name>
          <description>Configuration register 0 for channel %s</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x30ffff02</resetValue>
          <fields>
            <field>
              <name>DIV_CNT_CH</name>
              <description>Configures the clock divider of channel %s. \\
Measurement unit: rmt_sclk\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDLE_THRES_CH</name>
              <description>Configures RX threshold. \\
When no edge is detected on the input signal for continuous clock cycles longer than this field value, the receiver stops receiving data.\\
Measurement unit: clk_div\\</description>
              <bitOffset>8</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_SIZE_CH</name>
              <description>Configures the maximum number of memory blocks allocated to channel %s.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_EN_CH</name>
              <description>Configures whether to enable carrier modulation on output signal for channel %s. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CARRIER_OUT_LV_CH</name>
              <description>Configures the position of carrier wave for channel %s. \\
0: Add carrier wave on low level\\
1: Add carrier wave on high level\\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x8</dimIncrement>
          <dimIndex>2,3</dimIndex>
          <name>CH%sCONF1</name>
          <description>Configuration register 1 for channel %s</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <resetValue>0x1e8</resetValue>
          <fields>
            <field>
              <name>RX_EN_CH</name>
              <description>Configures whether to enable the receiver to start receiving data in channel %s. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_WR_RST_CH</name>
              <description>Configures whether to reset RAM write address accessed by the receiver for channel %s. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APB_MEM_RST_CH</name>
              <description>Configures whether to reset RAM W/R address accessed by APB FIFO for channel %s. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MEM_OWNER_CH</name>
              <description>Configures the ownership of channel %s's RAM block. \\
0: APB bus is using the RAM\\
1: Receiver is using the RAM\\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_EN_CH</name>
              <description>Configures whether to enable the receiver's filter for channel %s. \\
0: Disable\\
1: Enable\\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_FILTER_THRES_CH</name>
              <description>Configures whether the receiver, when receiving data, ignores the input pulse when its width is shorter than this register value in units of rmt_sclk cycles. \\
0: No effect\\
1: Reset\\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEM_RX_WRAP_EN_CH</name>
              <description>Configures whether to enable wrap RX mode for channel %s. \\
0: Disable\\
1: Enable\\
In this mode, if the RX data size is larger than channel %s's RAM block size, the receiver stores the RX data from the first address to the last address in loops.\\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AFIFO_RST_CH</name>
              <description>Reserved</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONF_UPDATE_CH</name>
              <description>Synchronization bit for channel %s.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CH%sSTATUS</name>
          <description>Channel %s status register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_RADDR_EX_CH</name>
              <description>Represents the memory address offset when transmitter of channel %s is using the RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE_CH</name>
              <description>Represents the FSM status of channel %s.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WADDR_CH</name>
              <description>Represents the memory address offset when writes RAM over APB bus.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RD_ERR_CH</name>
              <description>Represents whether the offset address exceeds memory size when reading via APB bus. \\
0: Not exceed\\
1: Exceed\\</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_EMPTY_CH</name>
              <description>Represents whether the TX data size exceeds the memory size and the wrap TX mode is disabled. \\
0: Not exceed\\
1: Exceed\\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_WR_ERR_CH</name>
              <description>Represents whether the offset address exceeds memory size (overflows) when writes via APB bus. \\
0: Not exceed\\
1: Exceed\\</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RADDR_CH</name>
              <description>Represents the memory address offset when reading RAM over APB bus.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>2,3</dimIndex>
          <name>CH%sSTATUS</name>
          <description>Channel %s status register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MEM_WADDR_EX_CH</name>
              <description>Represents the memory address offset when receiver of channel %s is using the RAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RADDR_CH</name>
              <description>Represents the memory address offset when reads RAM over APB bus.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STATE_CH</name>
              <description>Represents the FSM status of channel %s.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_OWNER_ERR_CH</name>
              <description>Represents whether the ownership of memory block is wrong. \\
0: The ownership of memory block is correct\\
1: The ownership of memory block is wrong\\</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_FULL_CH</name>
              <description>Represents whether the receiver receives more data than the memory can fit. \\
0: The receiver does not receive more data than the memory can fit\\
1: The receiver receives more data than the memory can fit\\</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APB_MEM_RD_ERR_CH</name>
              <description>Represents whether the offset address exceeds memory size (overflows) when reads RAM via APB bus. \\
0: Not exceed\\
1: Exceed\\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_RAW</name>
          <description>Raw interrupt status</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when transmission done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when transmission done.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when reception done.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_RX_END_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when reception done.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL4. Triggered when error occurs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL5. Triggered when error occurs.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL6. Triggered when error occurs.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_ERR_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL7. Triggered when error occurs.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when transmitter sent more data than configured value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL2. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3_RX_THR_EVENT_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL3. Triggered when receiver receive more data than configured value.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL0. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1_TX_LOOP_INT_RAW</name>
              <description>The interrupt raw bit for CHANNEL1. Triggered when the loop count reaches the configured threshold value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
