esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>TASK_ST5_CLR</name>
          <description>Tasks trigger status clear register</description>
          <addressOffset>0x20c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>I2S0_TASK_SYNC_CHECK_ST_CLR</name>
              <description>Configures whether or not to clear I2S0_task_sync_check trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ULP_TASK_WAKEUP_CPU_ST_CLR</name>
              <description>Configures whether or not to clear ULP_task_wakeup_cpu trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ULP_TASK_INT_CPU_ST_CLR</name>
              <description>Configures whether or not to clear ULP_task_int_cpu trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_TASK_START_ST_CLR</name>
              <description>Configures whether or not to clear RTC_task_start trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_TASK_STOP_ST_CLR</name>
              <description>Configures whether or not to clear RTC_task_stop trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_TASK_CLR_ST_CLR</name>
              <description>Configures whether or not to clear RTC_task_clr trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTC_TASK_TRIGGERFLW_ST_CLR</name>
              <description>Configures whether or not to clear RTC_task_triggerflw trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_IN_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_in_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_IN_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_in_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_IN_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_in_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_IN_START_CH3_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_in_start_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_IN_START_CH4_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_in_start_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_OUT_START_CH0_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_out_start_ch0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_OUT_START_CH1_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_out_start_ch1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_OUT_START_CH2_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_out_start_ch2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_OUT_START_CH3_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_out_start_ch3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>GDMA_TASK_OUT_START_CH4_ST_CLR</name>
              <description>Configures whether or not to clear GDMA_task_out_start_ch4 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PMU_TASK_SLEEP_REQ_ST_CLR</name>
              <description>Configures whether or not to clear PMU_task_sleep_req trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G0_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g0 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G1_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g1 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G2_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g2 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MODEM_TASK_G3_ST_CLR</name>
              <description>Configures whether or not to clear MODEM_task_g3 trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ZERO_DET_TASK_START_ST_CLR</name>
              <description>Configures whether or not to clear ZERO_DET_task_start trigger status.\\0: Invalid, No effect\\1: Clear</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_EN</name>
          <description>ETM clock enable register</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether or not to open register clock gate.\\0: Open the clock gate only when application writes registers\\1: Force open the clock gate for register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>ETM date register</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <resetValue>0x2407151</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Configures the version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
