esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>SPI_MEM_XTS_RELEASE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_RELEASE</name>
              <description>Set this bit to release encrypted result to mspi. This action should only be asserted when manual encryption status is 2. After this action, manual encryption status will become 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_DESTROY</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_DESTROY</name>
              <description>Set this bit to destroy encrypted result. This action should be asserted only when manual encryption status is 3. After this action, manual encryption status will become 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_STATE</name>
          <description>Manual Encryption physical address register</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_XTS_STATE</name>
              <description>This bits stores the status of manual encryption. 0: idle, 1: busy of encryption calculation, 2: encryption calculation is done but the encrypted result is invisible to mspi, 3: the encrypted result is visible to mspi.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_DATE</name>
          <description>Manual Encryption version register</description>
          <addressOffset>0x35c</addressOffset>
          <size>32</size>
          <resetValue>0x20210907</resetValue>
          <fields>
            <field>
              <name>SPI_XTS_DATE</name>
              <description>This bits stores the last modified-time of manual encryption feature.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_MMU_ITEM_CONTENT</name>
          <description>MSPI-MMU item content register</description>
          <addressOffset>0x37c</addressOffset>
          <size>32</size>
          <resetValue>0x37c</resetValue>
          <fields>
            <field>
              <name>SPI_MMU_ITEM_CONTENT</name>
              <description>MSPI-MMU item content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_MMU_ITEM_INDEX</name>
          <description>MSPI-MMU item index register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MMU_ITEM_INDEX</name>
              <description>MSPI-MMU item index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_MMU_POWER_CTRL</name>
          <description>MSPI MMU power control register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <resetValue>0x13200000</resetValue>
          <fields>
            <field>
              <name>SPI_MMU_MEM_FORCE_ON</name>
              <description>Set this bit to enable mmu-memory clock force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MMU_PAGE_SIZE</name>
              <description>0: Max page size , 1: Max page size/2 , 2: Max page size/4, 3: Max page size/8</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_AUX_CTRL</name>
              <description>MMU PSRAM aux control register</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_RDN_ENA</name>
              <description>ECO register enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_RDN_RESULT</name>
              <description>MSPI module clock domain and AXI clock domain ECO register result register</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DPA_CTRL</name>
          <description>SPI memory cryption DPA register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <resetValue>0xf</resetValue>
          <fields>
            <field>
              <name>SPI_CRYPT_SECURITY_LEVEL</name>
              <description>Set the security level of spi mem cryption. 0: Shut off cryption DPA funtion. 1-7: The bigger the number is, the more secure the cryption is. (Note that the performance of cryption will decrease together with this number increasing)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CRYPT_CALC_D_DPA_EN</name>
              <description>Only available when SPI_CRYPT_SECURITY_LEVEL is not 0. 1: Enable DPA in the calculation that using key 1 or key 2. 0: Enable DPA only in the calculation that using key 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CRYPT_DPA_SELECT_REGISTER</name>
              <description>1: MSPI XTS DPA clock gate is controlled by SPI_CRYPT_CALC_D_DPA_EN and SPI_CRYPT_SECURITY_LEVEL. 0: Controlled by efuse bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_XTS_PSEUDO_ROUND_CONF</name>
          <description>SPI memory cryption PSEUDO register</description>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <resetValue>0x45c</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_MODE_PSEUDO</name>
              <description>Set the mode of pseudo. 2'b00: crypto without pseudo. 2'b01: state T with pseudo and state D without pseudo. 2'b10: state T with pseudo and state D with few pseudo. 2'b11: crypto with pseudo.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_PSEUDO_RNG_CNT</name>
              <description>xts aes peseudo function base round that must be peformed.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_PSEUDO_BASE</name>
              <description>xts aes peseudo function base round that must be peformed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MEM_PSEUDO_INC</name>
              <description>xts aes peseudo function increment round that will be peformed randomly between 0 &amp; 2**(inc+1).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_REGISTERRND_ECO_HIGH</name>
          <description>MSPI ECO high register</description>
          <addressOffset>0x3f0</addressOffset>
          <size>32</size>
          <resetValue>0x37c</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_REGISTERRND_ECO_HIGH</name>
              <description>ECO high register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_REGISTERRND_ECO_LOW</name>
          <description>MSPI ECO low register</description>
          <addressOffset>0x3f4</addressOffset>
          <size>32</size>
          <resetValue>0x37c</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_REGISTERRND_ECO_LOW</name>
              <description>ECO low register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MEM_DATE</name>
          <description>SPI0 version control register</description>
          <addressOffset>0x3fc</addressOffset>
          <size>32</size>
          <resetValue>0x2504090</resetValue>
          <fields>
            <field>
              <name>SPI_MEM_DATE</name>
              <description>SPI0 register version.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
