esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>SPI_USER2</name>
          <description>SPI USER control register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x78000000</resetValue>
          <fields>
            <field>
              <name>SPI_USR_COMMAND_VALUE</name>
              <description>Configures the command value.
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MST_REMPTY_ERR_END_EN</name>
              <description>Configures whether or not to end the SPI transfer when SPI TX AFIFO read empty error occurs in master full-/half-duplex transfers. \\
0: Not end \\
1: End \\</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_USR_COMMAND_BITLEN</name>
              <description>Configures the bit length of command state.
This value is (expected bit number - 1). Can be configured in CONF state.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MS_DLEN</name>
          <description>SPI data bit length control register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_MS_DATA_BITLEN</name>
              <description>Configures the data bit length of SPI transfer in DMA-controlled master transfer or in CPU-controlled master transfer. Or configures the bit length of SPI RX transfer in DMA-controlled slave transfer.
This value shall be (expected bit_num - 1). Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>18</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_MISC</name>
          <description>SPI misc register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <resetValue>0x3e</resetValue>
          <fields>
            <field>
              <name>SPI_CS0_DIS</name>
              <description>Configures whether or not to disable SPI_CS0 pin.\\
0: SPI_CS0 signal is from/to SPI_CS0 pin.\\
1: Disable SPI_CS0 pin.\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS1_DIS</name>
              <description>Configures whether or not to disable SPI_CS1 pin.\\
0: SPI_CS1 signal is from/to SPI_CS1 pin.\\
1: Disable SPI_CS1 pin.\\
Can be configured in CONF state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS2_DIS</name>
              <description>Configures whether or not to disable SPI_CS2 pin.\\
0: SPI_CS2 signal is from/to SPI_CS2 pin.\\
1: Disable SPI_CS2 pin.\\
Can be configured in CONF state.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS3_DIS</name>
              <description>Configures whether or not to disable SPI_CS3 pin.\\
0: SPI_CS3 signal is from/to SPI_CS3 pin.\\
1: Disable SPI_CS3 pin.\\
Can be configured in CONF state.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS4_DIS</name>
              <description>Configures whether or not to disable SPI_CS4 pin.\\
0: SPI_CS4 signal is from/to SPI_CS4 pin.\\
1: Disable SPI_CS4 pin.\\
Can be configured in CONF state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS5_DIS</name>
              <description>Configures whether or not to disable SPI_CS5 pin.\\
0: SPI_CS5 signal is from/to SPI_CS5 pin.\\
1: Disable SPI_CS5 pin.\\
Can be configured in CONF state.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CK_DIS</name>
              <description>Configures whether or not to disable SPI_CLK output.\\
0: Enable\\
1: Disable\\
Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_MASTER_CS_POL</name>
              <description>Configures the polarity of SPI_CS7 (7 = 0-5) line in master transfer.\\
0: SPI_CS7 is low active.\\
1: SPI_CS7 is high active.\\
Can be configured in CONF state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CLK_DATA_DTR_EN</name>
              <description>1: SPI master DTR mode is applied to SPI clk, data and spi_dqs.  0: SPI master DTR mode is  only applied to spi_dqs. This bit should be used with bit 17/18/19.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DATA_DTR_EN</name>
              <description>1: SPI clk and data of SPI_DOUT and SPI_DIN state are in DTR mode, including master 1/2/4/8-bm.  0:  SPI clk and data of SPI_DOUT and SPI_DIN state are in STR mode. Can be configured in CONF state.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_ADDR_DTR_EN</name>
              <description>1: SPI clk and data of SPI_SEND_ADDR state are in DTR mode, including master 1/2/4/8-bm.  0:  SPI clk and data of SPI_SEND_ADDR state are in STR mode. Can be configured in CONF state.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_CMD_DTR_EN</name>
              <description>1: SPI clk and data of SPI_SEND_CMD state are in DTR mode, including master 1/2/4/8-bm. 0:  SPI clk and data of SPI_SEND_CMD state are in STR mode. Can be configured in CONF state.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_SLAVE_CS_POL</name>
              <description>Configures whether or not invert SPI slave input CS polarity.\\
0: Not change\\
1: Invert\\
Can be configured in CONF state.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DQS_IDLE_EDGE</name>
              <description>The default value of spi_dqs. Can be configured in CONF state.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_CK_IDLE_EDGE</name>
              <description>Configures the level of SPI_CLK line when GP-SPI2 is in idle.\\
0: Low\\
1: High\\
Can be configured in CONF state.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_CS_KEEP_ACTIVE</name>
              <description>Configures whether or not to keep the SPI_CS line low.\\
0: Not keep low\\
1: Keep low\\
Can be configured in CONF state.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_QUAD_DIN_PIN_SWAP</name>
              <description>1: SPI quad input swap enable, swap FSPID with FSPIQ, swap FSPIWP with FSPIHD. 0:  spi quad input swap disable. Can be configured in CONF state.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DIN_MODE</name>
          <description>SPI input delay mode configuration</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_DIN0_MODE</name>
              <description>Configures the input mode for FSPID signal.\\
0: Input without delay\\
1: Input at the (SPI_DIN0_NUM + 1)th falling edge of clk_spi_mst\\
2: Input at the (SPI_DIN0_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst rising edge cycle\\
3: Input at the (SPI_DIN0_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst falling edge cycle\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN1_MODE</name>
              <description>Configures the input mode for FSPIQ signal.\\
0: Input without delay\\
1: Input at the (SPI_DIN1_NUM+1)th falling edge of clk_spi_mst\\
2: Input at the (SPI_DIN1_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst rising edge cycle\\
3: Input at the (SPI_DIN1_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst falling edge cycle\\
    Can be configured in CONF state.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN2_MODE</name>
              <description>Configures the input mode for FSPIWP signal.\\
0: Input without delay\\
1: Input at the (SPI_DIN2_NUM + 1)th falling edge of clk_spi_mst\\
2: Input at the (SPI_DIN2_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst rising edge cycle\\
3: Input at the (SPI_DIN2_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst falling edge cycle\\
Can be configured in CONF state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN3_MODE</name>
              <description>Configures the input mode for FSPIHD signal.\\
0: Input without delay\\
1: Input at the (SPI_DIN3_NUM + 1)th falling edge of clk_spi_mst\\
2: Input at the (SPI_DIN3_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst rising edge cycle\\
3: Input at the (SPI_DIN3_NUM + 1)th rising edge of clk_hclk plus one clk_spi_mst falling edge cycle\\
Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN4_MODE</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk. Can be configured in CONF state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DIN5_MODE</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk. Can be configured in CONF state.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DIN6_MODE</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk. Can be configured in CONF state.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DIN7_MODE</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: input without delayed, 1: input with the posedge of clk_apb,2 input with the negedge of clk_apb, 3: input with the spi_clk. Can be configured in CONF state.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_TIMING_HCLK_ACTIVE</name>
              <description>Configures whether or not to enable HCLK (high-frequency clock) in SPI input timing module.\\
0: Disable\\
1: Enable\\
Can be configured in CONF state.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DIN_NUM</name>
          <description>SPI input delay number configuration</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_DIN0_NUM</name>
              <description>Configures the delays to input signal FSPID based on the setting of SPI_DIN0_MODE.\\
0: Delayed by 1 clock cycle\\
1: Delayed by 2 clock cycles\\
2: Delayed by 3 clock cycles\\
3: Delayed by 4 clock cycles\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN1_NUM</name>
              <description>Configures the delays to input signal FSPIQ based on the setting of SPI_DIN1_MODE.\\
0: Delayed by 1 clock cycle\\
1: Delayed by 2 clock cycles\\
2: Delayed by 3 clock cycles\\
3: Delayed by 4 clock cycles\\
Can be configured in CONF state.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN2_NUM</name>
              <description>Configures the delays to input signal FSPIWP based on the setting of SPI_DIN2_MODE.\\
0: Delayed by 1 clock cycle\\
1: Delayed by 2 clock cycles\\
2: Delayed by 3 clock cycles\\
3: Delayed by 4 clock cycles\\
Can be configured in CONF state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN3_NUM</name>
              <description>Configures the delays to input signal FSPIHD based on the setting of SPI_DIN3_MODE.\\
0: Delayed by 1 clock cycle\\
1: Delayed by 2 clock cycles\\
2: Delayed by 3 clock cycles\\
3: Delayed by 4 clock cycles\\
Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIN4_NUM</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...  Can be configured in CONF state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DIN5_NUM</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...  Can be configured in CONF state.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DIN6_NUM</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...  Can be configured in CONF state.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DIN7_NUM</name>
              <description>the input signals are delayed by SPI module clock cycles, 0: delayed by 1 cycle, 1: delayed by 2 cycles,...  Can be configured in CONF state.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DOUT_MODE</name>
          <description>SPI output delay mode configuration</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SPI_DOUT0_MODE</name>
              <description>Configures the output mode for FSPID signal.\\
0: Output without delay\\
1: Output with a delay of a SPI module clock cycle at its falling edge\\
Can be configured in CONF state.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DOUT1_MODE</name>
              <description>Configures the output mode for FSPIQ signal.\\
0: Output without delay\\
1: Output with a delay of a SPI module clock cycle at its falling edge\\
Can be configured in CONF state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DOUT2_MODE</name>
              <description>Configures the output mode for FSPIWP signal.\\
0: Output without delay\\
1: Output with a delay of a SPI module clock cycle at its falling edge\\
Can be configured in CONF state.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DOUT3_MODE</name>
              <description>Configures the output mode for FSPIHD signal.\\
0: Output without delay\\
1: Output with a delay of a SPI module clock cycle at its falling edge\\
Can be configured in CONF state.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DOUT4_MODE</name>
              <description>The output signal 4 is delayed by the SPI module clock, 0: output without delayed, 1: output delay for a SPI module clock cycle at its negative edge. Can be configured in CONF state.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOUT5_MODE</name>
              <description>The output signal 5 is delayed by the SPI module clock, 0: output without delayed, 1: output delay for a SPI module clock cycle at its negative edge. Can be configured in CONF state.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOUT6_MODE</name>
              <description>The output signal 6 is delayed by the SPI module clock, 0: output without delayed, 1: output delay for a SPI module clock cycle at its negative edge. Can be configured in CONF state.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DOUT7_MODE</name>
              <description>The output signal 7 is delayed by the SPI module clock, 0: output without delayed, 1: output delay for a SPI module clock cycle at its negative edge. Can be configured in CONF state.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_D_DQS_MODE</name>
              <description>The output signal SPI_DQS is delayed by the SPI module clock, 0: output without delayed, 1: output delay for a SPI module clock cycle at its negative edge. Can be configured in CONF state.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI_DMA_CONF</name>
          <description>SPI DMA control register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <resetValue>0x3</resetValue>
          <fields>
            <field>
              <name>SPI_DMA_OUTFIFO_EMPTY</name>
              <description>Represents whether or not the DMA TX FIFO is ready for sending data.\\
0: Ready\\
1: Not ready\\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DMA_INFIFO_FULL</name>
              <description>Represents whether or not the DMA RX FIFO is ready for receiving data.\\
0: Ready\\
1: Not ready\\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPI_DMA_SLV_SEG_TRANS_EN</name>
              <description>Configures whether or not to enable DMA-controlled segmented transfer in slave half-duplex communication.\\
0: Disable\\
1: Enable\\</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_SLV_RX_SEG_TRANS_CLR_EN</name>
              <description>In slave segmented transfer, if the size of the DMA RX buffer is smaller than the size of the received data, \\1: the data in all the following Wr_DMA transactions will not be received\\ 0: the data in this Wr_DMA transaction will not be received, but in the following transactions,\\
    
