esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>I2S_CTRL</name>
          <description>i2s read/write control register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_I2S</name>
              <description>Configures i2s registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_I2S</name>
              <description>Configures i2s registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_I2S</name>
              <description>Configures i2s registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_I2S</name>
              <description>Configures i2s registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_I2S</name>
              <description>Configures i2s registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_I2S</name>
              <description>Configures i2s registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_I2S</name>
              <description>Configures i2s registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_I2S</name>
              <description>Configures i2s registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARL_IO_CTRL</name>
          <description>parl_io read/write control register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_PARL_IO</name>
              <description>Configures parl_io registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_PARL_IO</name>
              <description>Configures parl_io registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_PARL_IO</name>
              <description>Configures parl_io registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_PARL_IO</name>
              <description>Configures parl_io registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_PARL_IO</name>
              <description>Configures parl_io registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_PARL_IO</name>
              <description>Configures parl_io registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_PARL_IO</name>
              <description>Configures parl_io registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_PARL_IO</name>
              <description>Configures parl_io registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM0_CTRL</name>
          <description>pwm0 read/write control register</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_PWM0</name>
              <description>Configures pwm0 registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_PWM0</name>
              <description>Configures pwm0 registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_PWM0</name>
              <description>Configures pwm0 registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_PWM0</name>
              <description>Configures pwm0 registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_PWM0</name>
              <description>Configures pwm0 registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_PWM0</name>
              <description>Configures pwm0 registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_PWM0</name>
              <description>Configures pwm0 registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_PWM0</name>
              <description>Configures pwm0 registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWM1_CTRL</name>
          <description>pwm1 read/write control register</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_PWM1</name>
              <description>Configures pwm1 registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_PWM1</name>
              <description>Configures pwm1 registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_PWM1</name>
              <description>Configures pwm1 registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_PWM1</name>
              <description>Configures pwm1 registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_PWM1</name>
              <description>Configures pwm1 registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_PWM1</name>
              <description>Configures pwm1 registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_PWM1</name>
              <description>Configures pwm1 registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_PWM1</name>
              <description>Configures pwm1 registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDC_CTRL</name>
          <description>ledc read/write control register</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_LEDC</name>
              <description>Configures ledc registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_LEDC</name>
              <description>Configures ledc registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_LEDC</name>
              <description>Configures ledc registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_LEDC</name>
              <description>Configures ledc registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_LEDC</name>
              <description>Configures ledc registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_LEDC</name>
              <description>Configures ledc registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_LEDC</name>
              <description>Configures ledc registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_LEDC</name>
              <description>Configures ledc registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN_CTRL</name>
          <description>can read/write control register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CAN</name>
              <description>Configures can registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CAN</name>
              <description>Configures can registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CAN</name>
              <description>Configures can registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CAN</name>
              <description>Configures can registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CAN</name>
              <description>Configures can registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CAN</name>
              <description>Configures can registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CAN</name>
              <description>Configures can registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CAN</name>
              <description>Configures can registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USB_SERIAL_JTAG_CTRL</name>
          <description>usb_serial_jtag read/write control register</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_USB_SERIAL_JTAG</name>
              <description>Configures usb_serial_jtag registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
