esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>RMT_CTRL</name>
          <description>rmt read/write control register</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_RMT</name>
              <description>Configures rmt registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_RMT</name>
              <description>Configures rmt registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_RMT</name>
              <description>Configures rmt registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_RMT</name>
              <description>Configures rmt registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_RMT</name>
              <description>Configures rmt registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_RMT</name>
              <description>Configures rmt registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_RMT</name>
              <description>Configures rmt registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_RMT</name>
              <description>Configures rmt registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GDMA_CTRL</name>
          <description>gdma read/write control register</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_GDMA</name>
              <description>Configures gdma registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_GDMA</name>
              <description>Configures gdma registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_GDMA</name>
              <description>Configures gdma registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_GDMA</name>
              <description>Configures gdma registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_GDMA</name>
              <description>Configures gdma registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_GDMA</name>
              <description>Configures gdma registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_GDMA</name>
              <description>Configures gdma registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_GDMA</name>
              <description>Configures gdma registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REGDMA_CTRL</name>
          <description>regdma read/write control register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_REGDMA</name>
              <description>Configures regdma registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_REGDMA</name>
              <description>Configures regdma registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_REGDMA</name>
              <description>Configures regdma registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_REGDMA</name>
              <description>Configures regdma registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_REGDMA</name>
              <description>Configures regdma registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_REGDMA</name>
              <description>Configures regdma registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_REGDMA</name>
              <description>Configures regdma registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_REGDMA</name>
              <description>Configures regdma registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETM_CTRL</name>
          <description>etm read/write control register</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_ETM</name>
              <description>Configures etm registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_ETM</name>
              <description>Configures etm registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_ETM</name>
              <description>Configures etm registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_ETM</name>
              <description>Configures etm registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_ETM</name>
              <description>Configures etm registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_ETM</name>
              <description>Configures etm registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_ETM</name>
              <description>Configures etm registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_ETM</name>
              <description>Configures etm registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMTX_CORE0_CTRL</name>
          <description>intmtx_core0 read/write control register</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_INTMTX_CORE0</name>
              <description>Configures intmtx_core0 registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTMTX_CORE1_CTRL</name>
          <description>intmtx_core1 read/write control register</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_INTMTX_CORE1</name>
              <description>Configures intmtx_core1 registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_ADC_CTRL</name>
          <description>apb_adc read/write control register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_APB_ADC</name>
              <description>Configures apb_adc registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_APB_ADC</name>
              <description>Configures apb_adc registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_APB_ADC</name>
              <description>Configures apb_adc registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_APB_ADC</name>
              <description>Configures apb_adc registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_APB_ADC</name>
              <description>Configures apb_adc registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_APB_ADC</name>
              <description>Configures apb_adc registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_APB_ADC</name>
              <description>Configures apb_adc registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_APB_ADC</name>
              <description>Configures apb_adc registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
