esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>MSPI_CTRL</name>
          <description>mspi read/write control register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_MSPI</name>
              <description>Configures mspi registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_MSPI</name>
              <description>Configures mspi registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_MSPI</name>
              <description>Configures mspi registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_MSPI</name>
              <description>Configures mspi registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_MSPI</name>
              <description>Configures mspi registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_MSPI</name>
              <description>Configures mspi registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_MSPI</name>
              <description>Configures mspi registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_MSPI</name>
              <description>Configures mspi registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_APM_CTRL</name>
          <description>hp_apm read/write control register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_APM</name>
              <description>Configures hp_apm registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_APM</name>
              <description>Configures hp_apm registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_HP_APM</name>
              <description>Configures hp_apm registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_HP_APM</name>
              <description>Configures hp_apm registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_APM</name>
              <description>Configures hp_apm registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_APM</name>
              <description>Configures hp_apm registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_APM</name>
              <description>Configures hp_apm registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_APM</name>
              <description>Configures hp_apm registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HP_MEM_APM_CTRL</name>
          <description>hp_mem_apm read/write control register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_HP_MEM_APM</name>
              <description>Configures hp_mem_apm registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_APM_CTRL</name>
          <description>cpu_apm read/write control register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CPU_APM</name>
              <description>Configures cpu_apm registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CPU_APM</name>
              <description>Configures cpu_apm registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_CPU_APM</name>
              <description>Configures cpu_apm registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_CPU_APM</name>
              <description>Configures cpu_apm registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_CPU_APM</name>
              <description>Configures cpu_apm registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CPU_APM</name>
              <description>Configures cpu_apm registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_CPU_APM</name>
              <description>Configures cpu_apm registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_CPU_APM</name>
              <description>Configures cpu_apm registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEE_CTRL</name>
          <description>tee read/write control register</description>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_TEE</name>
              <description>Configures tee registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_TEE</name>
              <description>Configures tee registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE1_TEE</name>
              <description>Configures tee registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READ_REE2_TEE</name>
              <description>Configures tee registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_TEE_TEE</name>
              <description>Configures tee registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_TEE</name>
              <description>Configures tee registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE1_TEE</name>
              <description>Configures tee registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRITE_REE2_TEE</name>
              <description>Configures tee registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KM_CTRL</name>
          <description>crypt read/write control register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_KM</name>
              <description>Configures km registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_KM</name>
              <description>Configures km registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_KM</name>
              <description>Configures km registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_KM</name>
              <description>Configures km registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_KM</name>
              <description>Configures km registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_KM</name>
              <description>Configures km registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_KM</name>
              <description>Configures km registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_KM</name>
              <description>Configures km registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPT_CTRL</name>
          <description>crypt read/write control register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CRYPT</name>
              <description>Configures crypt registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CRYPT</name>
              <description>Configures crypt registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CRYPT</name>
              <description>Configures crypt registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CRYPT</name>
              <description>Configures crypt registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CRYPT</name>
              <description>Configures crypt registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CRYPT</name>
              <description>Configures crypt registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CRYPT</name>
              <description>Configures crypt registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CRYPT</name>
              <description>Configures crypt registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
