esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>CORE0_TRACE_CTRL</name>
          <description>core0_trace read/write control register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CORE0_TRACE</name>
              <description>Configures core0_trace registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CORE0_TRACE</name>
              <description>Configures core0_trace registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CORE0_TRACE</name>
              <description>Configures core0_trace registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CORE0_TRACE</name>
              <description>Configures core0_trace registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CORE0_TRACE</name>
              <description>Configures core0_trace registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CORE0_TRACE</name>
              <description>Configures core0_trace registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CORE0_TRACE</name>
              <description>Configures core0_trace registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CORE0_TRACE</name>
              <description>Configures core0_trace registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CORE1_TRACE_CTRL</name>
          <description>core1_trace read/write control register</description>
          <addressOffset>0x12c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CORE1_TRACE</name>
              <description>Configures core1_trace registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CORE1_TRACE</name>
              <description>Configures core1_trace registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CORE1_TRACE</name>
              <description>Configures core1_trace registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CORE1_TRACE</name>
              <description>Configures core1_trace registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CORE1_TRACE</name>
              <description>Configures core1_trace registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CORE1_TRACE</name>
              <description>Configures core1_trace registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CORE1_TRACE</name>
              <description>Configures core1_trace registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CORE1_TRACE</name>
              <description>Configures core1_trace registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPU_BUS_MONITOR_CTRL</name>
          <description>cpu_bus_monitor read/write control register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CPU_BUS_MONITOR</name>
              <description>Configures cpu_bus_monitor registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTPRI_REG_CTRL</name>
          <description>intpri_reg read/write control register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_INTPRI</name>
              <description>Configures intpri_reg registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_INTPRI</name>
              <description>Configures intpri_reg registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_INTPRI</name>
              <description>Configures intpri_reg registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_INTPRI</name>
              <description>Configures intpri_reg registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_INTPRI</name>
              <description>Configures intpri_reg registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_INTPRI</name>
              <description>Configures intpri_reg registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_INTPRI</name>
              <description>Configures intpri_reg registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_INTPRI</name>
              <description>Configures intpri_reg registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CACHE_CFG_CTRL</name>
          <description>cache_cfg read/write control register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_CACHE_CFG</name>
              <description>Configures cache_cfg registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_CACHE_CFG</name>
              <description>Configures cache_cfg registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_CACHE_CFG</name>
              <description>Configures cache_cfg registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_CACHE_CFG</name>
              <description>Configures cache_cfg registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_CACHE_CFG</name>
              <description>Configures cache_cfg registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_CACHE_CFG</name>
              <description>Configures cache_cfg registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_CACHE_CFG</name>
              <description>Configures cache_cfg registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_CACHE_CFG</name>
              <description>Configures cache_cfg registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODEM_CTRL</name>
          <description>modem read/write control register</description>
          <addressOffset>0x13c</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_MODEM</name>
              <description>Configures modem registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_MODEM</name>
              <description>Configures modem registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_MODEM</name>
              <description>Configures modem registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_MODEM</name>
              <description>Configures modem registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_MODEM</name>
              <description>Configures modem registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_MODEM</name>
              <description>Configures modem registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_MODEM</name>
              <description>Configures modem registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_MODEM</name>
              <description>Configures modem registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ZERO_DET_CTRL</name>
          <description>zero_det read/write control register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0x11</resetValue>
          <fields>
            <field>
              <name>READ_TEE_ZERO_DET</name>
              <description>Configures zero_det registers read permission in tee mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE0_ZERO_DET</name>
              <description>Configures zero_det registers read permission in ree0 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE1_ZERO_DET</name>
              <description>Configures zero_det registers read permission in ree1 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>READ_REE2_ZERO_DET</name>
              <description>Configures zero_det registers read permission in ree2 mode.\\ 
0: can not be read \\ 
1: can be read \\</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_TEE_ZERO_DET</name>
              <description>Configures zero_det registers write permission in tee mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE0_ZERO_DET</name>
              <description>Configures zero_det registers write permission in ree0 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE1_ZERO_DET</name>
              <description>Configures zero_det registers write permission in ree1 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE_REE2_ZERO_DET</name>
              <description>Configures zero_det registers write permission in ree2 mode.\\ 
0: can not be write \\ 
1: can be write \\</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUS_ERR_CONF</name>
          <description>Clock gating register</description>
          <addressOffset>0xff0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUS_ERR_RESP_EN</name>
              <description>Configures whether return error response to cpu when access blocked
0: disable error response \\
1: enable error response  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOCK_GATE</name>
          <description>Clock gating register</description>
          <addressOffset>0xff8</addressOffset>
          <size>32</size>
          <resetValue>0x1</resetValue>
          <fields>
            <field>
              <name>CLK_EN</name>
              <description>Configures whether to keep the clock always on.\\ 
0: enable automatic clock gating \\ 
1: keep the clock always on  \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>Version control register</description>
          <addressOffset>0xffc</addressOffset>
          <size>32</size>
          <resetValue>0x2503280</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>Version control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
