esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIMG0</name>
      <description>Timer Group 0</description>
      <groupName>TIMG</groupName>
      <baseAddress>0x60090000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8c</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>T%sCONFIG</name>
          <description>Timer 0 configuration register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <resetValue>0x60002000</resetValue>
          <fields>
            <field>
              <name>T_USE_XTAL</name>
              <description>1: Use XTAL_CLK as the source clock of timer group. 0: Use APB_CLK as the source clock of timer group.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_ALARM_EN</name>
              <description>Configures whether or not to enable the timer 0 alarm function. This bit will be automatically cleared once an alarm occurs.\\
0: Disable \\
1: Enable  \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_DIVCNT_RST</name>
              <description>Configures whether or not to reset the timer 0 's clock divider counter. \\
0: No effect \\
1: Reset \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>T_DIVIDER</name>
              <description>Represents the timer 0 clock (T0_clk) prescaler value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_AUTORELOAD</name>
              <description>Configures whether or not to enable the timer 0 auto-reload function at the time of alarm. \\
0: No effect \\
1: Enable \\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_INCREASE</name>
              <description>Configures the counting direction of the timer 0 time-base counter. \\
0: Decrement \\
1: Increment \\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_EN</name>
              <description>Configures whether or not to enable the timer 0 time-base counter. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLO</name>
          <description>Timer 0 current value, low 32 bits</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LO</name>
              <description>Represents the low 32 bits of the time-base counter of timer 0. Valid only after writing to TIMG_T0UPDATE_REG. \\
Measurement unit: T0_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sHI</name>
          <description>Timer 0 current value, high 22 bits</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_HI</name>
              <description>Represents the high 22 bits of the time-base counter of timer 0. Valid only after writing to TIMG_T0UPDATE_REG. \\
Measurement unit: T0_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sUPDATE</name>
          <description>Write to copy current timer value to TIMGn_T0LO_REG or TIMGn_T0HI_REG</description>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_UPDATE</name>
              <description>Configures to latch the counter value. \\
0: Latch \\
1: Latch \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sALARMLO</name>
          <description>Timer 0 alarm value, low 32 bits</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_ALARM_LO</name>
              <description>Configures the low 32 bits of timer 0 alarm trigger time-base counter value. Valid only when TIMG_T0_ALARM_EN is 1. \\
Measurement unit: T0_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sALARMHI</name>
          <description>Timer 0 alarm value, high bits</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_ALARM_HI</name>
              <description>Configures the high 22 bits of timer 0 alarm trigger time-base counter value. Valid only when TIMG_T0_ALARM_EN is 1. \\
Measurement unit: T0_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLOADLO</name>
          <description>Timer 0 reload value, low 32 bits</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LOAD_LO</name>
              <description>Configures low 32 bits of the value that a reload will load onto timer 0 time-base counter. \\
Measurement unit: T0_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLOADHI</name>
          <description>Timer 0 reload value, high 22 bits</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LOAD_HI</name>
              <description>Configures high 22 bits of the value that a reload will load onto timer 0 time-base counter. \\
Measurement unit: T0_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLOAD</name>
          <description>Write to reload timer from TIMG_T0LOADLO_REG or TIMG_T0LOADHI_REG</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LOAD</name>
              <description>Write any value to trigger a timer 0 time-base counter reload.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sCONFIG</name>
          <description>Timer 1 configuration register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x60002000</resetValue>
          <fields>
            <field>
              <name>T_USE_XTAL</name>
              <description>1: Use XTAL_CLK as the source clock of timer group. 0: Use APB_CLK as the source clock of timer group.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_ALARM_EN</name>
              <description>Configures whether or not to enable the timer 1 alarm function. This bit will be automatically cleared once an alarm occurs.\\
0: Disable \\
1: Enable  \\</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_DIVCNT_RST</name>
              <description>Configures whether or not to reset the timer 1 's clock divider counter. \\
0: No effect \\
1: Reset \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>T_DIVIDER</name>
              <description>Represents the timer 1 clock (T1_clk) prescaler value.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_AUTORELOAD</name>
              <description>Configures whether or not to enable the timer 1 auto-reload function at the time of alarm. \\
0: No effect \\
1: Enable \\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_INCREASE</name>
              <description>Configures the counting direction of the timer 1 time-base counter. \\
0: Decrement \\
1: Increment \\</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>T_EN</name>
              <description>Configures whether or not to enable the timer 1 time-base counter. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLO</name>
          <description>Timer 1 current value, low 32 bits</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LO</name>
              <description>Represents the low 32 bits of the time-base counter of timer 1. Valid only after writing to TIMG_T1UPDATE_REG. \\
Measurement unit: T1_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sHI</name>
          <description>Timer 1 current value, high 22 bits</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_HI</name>
              <description>Represents the high 22 bits of the time-base counter of timer 1. Valid only after writing to TIMG_T1UPDATE_REG. \\
Measurement unit: T1_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sUPDATE</name>
          <description>Write to copy current timer value to TIMGn_T0LO_REG or TIMGn_T0HI_REG</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_UPDATE</name>
              <description>Configures to latch the counter value. \\
0: Latch \\
1: Latch \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sALARMLO</name>
          <description>Timer 1 alarm value, low 32 bits</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_ALARM_LO</name>
              <description>Configures the low 32 bits of timer 1 alarm trigger time-base counter value. Valid only when TIMG_T1_ALARM_EN is 1. \\
Measurement unit: T1_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sALARMHI</name>
          <description>Timer 1 alarm value, high bits</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_ALARM_HI</name>
              <description>Configures the high 22 bits of timer 1 alarm trigger time-base counter value. Valid only when TIMG_T1_ALARM_EN is 1. \\
Measurement unit: T1_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLOADLO</name>
          <description>Timer 1 reload value, low 32 bits</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LOAD_LO</name>
              <description>Configures low 32 bits of the value that a reload will load onto timer 1 time-base counter. \\
Measurement unit: T1_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLOADHI</name>
          <description>Timer 1 reload value, high 22 bits</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LOAD_HI</name>
              <description>Configures high 22 bits of the value that a reload will load onto timer 1 time-base counter. \\
Measurement unit: T1_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>T%sLOAD</name>
          <description>Write to reload timer from TIMG_T1LOADLO_REG or TIMG_T1LOADHI_REG</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>T_LOAD</name>
              <description>Write any value to trigger a timer 1 time-base counter reload.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG0</name>
          <description>Watchdog timer configuration register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x4c000</resetValue>
          <fields>
            <field>
              <name>WDT_APPCPU_RESET_EN</name>
              <description>Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled. \\
0: Mask \\
1: Unmask \\</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_PROCPU_RESET_EN</name>
              <description>Configures whether to mask the CPU reset generated by MWDT. Valid only when write protection is disabled. \\
0: Mask \\
1: Unmask \\</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_FLASHBOOT_MOD_EN</name>
              <description>Configures whether to enable flash boot protection.\\
0: Disable \\
1: Enable \\</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_SYS_RESET_LENGTH</name>
              <description>Configures the system reset signal length. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk
\begin{multicols}{2}
0: 8 \\
1: 16 \\
2: 24 \\
3: 32 \\
4: 40 \\
5: 64 \\
6: 128 \\
7: 256 \\
\end{multicols}</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CPU_RESET_LENGTH</name>
              <description>Configures the CPU reset signal length. Valid only when write protection is disabled.\\
Measurement unit: mwdt_clk \\
\begin{multicols}{2}
0: 8 \\
1: 16 \\
2: 24 \\
3: 32 \\
4: 40 \\
5: 64 \\
6: 128 \\
7: 256 \\
\end{multicols}</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_USE_XTAL</name>
              <description>choose WDT clock:0-apb_clk, 1-xtal_clk.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_CONF_UPDATE_EN</name>
              <description>Configures to update the WDT configuration registers.\\
0: No effect \\
1: Update \\</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_STG3</name>
              <description>Configures the timeout action of stage 3. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG2</name>
              <description>Configures the  timeout action of stage 2. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG1</name>
              <description>Configures the  timeout action of stage 1. See details in TIMG_WDT_STG0. Valid only when write protection is disabled.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_STG0</name>
              <description>Configures the timeout action of stage 0. Valid only when write protection is disabled. \\
0: No effect \\
1: Interrupt \\
2: Reset CPU \\
3: Reset system \\</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT_EN</name>
              <description>Configures whether or not to enable the MWDT. Valid only when write protection is disabled. \\
0: Disable \\
1: Enable \\</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG1</name>
          <description>Watchdog timer prescaler register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0x10000</resetValue>
          <fields>
            <field>
              <name>WDT_DIVCNT_RST</name>
              <description>Configures whether to reset WDT 's clock divider counter. \\
0: No effect \\
1: Reset \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WDT_CLK_PRESCALE</name>
              <description>Configures MWDT clock prescaler value. Valid only when write protection is disabled. \\
MWDT clock period = MWDT's clock source period * TIMG_WDT_CLK_PRESCALE. \\</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG2</name>
          <description>Watchdog timer stage 0 timeout value</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0x18cba80</resetValue>
          <fields>
            <field>
              <name>WDT_STG0_HOLD</name>
              <description>Configures the stage 0 timeout value. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG3</name>
          <description>Watchdog timer stage 1 timeout value</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <resetValue>0x7ffffff</resetValue>
          <fields>
            <field>
              <name>WDT_STG1_HOLD</name>
              <description>Configures the stage 1 timeout value. Valid only when write protection is disabled.\\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WDTCONFIG4</name>
          <description>Watchdog timer stage 2 timeout value</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <resetValue>0xfffff</resetValue>
          <fields>
            <field>
              <name>WDT_STG2_HOLD</name>
              <description>Configures the stage 2 timeout value. Valid only when write protection is disabled. \\
Measurement unit: mwdt_clk \\</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
