esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>MUX0</name>
          <description>need_des</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x20000000</resetValue>
          <fields>
            <field>
              <name>TOUCH_DATA_SEL</name>
              <description>need_des</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_FREQ_SEL</name>
              <description>need_des</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_BUFSEL</name>
              <description>need_des</description>
              <bitOffset>12</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_DONE_EN</name>
              <description>need_des</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_DONE_FORCE</name>
              <description>need_des</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_FSM_EN</name>
              <description>need_des</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_START_EN</name>
              <description>need_des</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_START_FORCE</name>
              <description>need_des</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MUX1</name>
          <description>need_des</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_START</name>
              <description>need_des</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TOUCH_XPD</name>
              <description>need_des</description>
              <bitOffset>15</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD0_TH0</name>
          <description>need_des</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD0_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD0_TH1</name>
          <description>need_des</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD0_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD0_TH2</name>
          <description>need_des</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD0_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD1_TH0</name>
          <description>need_des</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD1_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD1_TH1</name>
          <description>need_des</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD1_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD1_TH2</name>
          <description>need_des</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD1_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD2_TH0</name>
          <description>need_des</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD2_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD2_TH1</name>
          <description>need_des</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD2_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD2_TH2</name>
          <description>need_des</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD2_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD3_TH0</name>
          <description>need_des</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD3_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD3_TH1</name>
          <description>need_des</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD3_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD3_TH2</name>
          <description>need_des</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD3_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD4_TH0</name>
          <description>need_des</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD4_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD4_TH1</name>
          <description>need_des</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD4_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD4_TH2</name>
          <description>need_des</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD4_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD5_TH0</name>
          <description>need_des</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD5_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD5_TH1</name>
          <description>need_des</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD5_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD5_TH2</name>
          <description>need_des</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD5_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD6_TH0</name>
          <description>need_des</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD6_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD6_TH1</name>
          <description>need_des</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD6_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD6_TH2</name>
          <description>need_des</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD6_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD7_TH0</name>
          <description>need_des</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD7_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD7_TH1</name>
          <description>need_des</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD7_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD7_TH2</name>
          <description>need_des</description>
          <addressOffset>0xa4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD7_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD8_TH0</name>
          <description>need_des</description>
          <addressOffset>0xa8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD8_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD8_TH1</name>
          <description>need_des</description>
          <addressOffset>0xac</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD8_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD8_TH2</name>
          <description>need_des</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD8_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD9_TH0</name>
          <description>need_des</description>
          <addressOffset>0xb4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD9_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD9_TH1</name>
          <description>need_des</description>
          <addressOffset>0xb8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD9_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD9_TH2</name>
          <description>need_des</description>
          <addressOffset>0xbc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD9_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD10_TH0</name>
          <description>need_des</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD10_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD10_TH1</name>
          <description>need_des</description>
          <addressOffset>0xc4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD10_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD10_TH2</name>
          <description>need_des</description>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD10_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD11_TH0</name>
          <description>need_des</description>
          <addressOffset>0xcc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD11_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD11_TH1</name>
          <description>need_des</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD11_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD11_TH2</name>
          <description>need_des</description>
          <addressOffset>0xd4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD11_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD12_TH0</name>
          <description>need_des</description>
          <addressOffset>0xd8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD12_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD12_TH1</name>
          <description>need_des</description>
          <addressOffset>0xdc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD12_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD12_TH2</name>
          <description>need_des</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD12_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD13_TH0</name>
          <description>need_des</description>
          <addressOffset>0xe4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD13_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD13_TH1</name>
          <description>need_des</description>
          <addressOffset>0xe8</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD13_TH1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD13_TH2</name>
          <description>need_des</description>
          <addressOffset>0xec</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD13_TH2</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD14_TH0</name>
          <description>need_des</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TOUCH_PAD14_TH0</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
