esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>INT_STAT</name>
          <description>TWAI FD command register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_RXI_INT. 
Frame received interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_TXI_INT. 
Frame transmitted interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWLI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_EWLI_INT. 
Error warning limit interrupt. When both TEC and REC are lower than EWL and one of the becomes equal to or
higher than EWL, or when both TEC and REC become less than EWL, this interrupt is generated. When Interrupt
is cleared and REC, or TEC is still equal to or higher than EWL, Interrupt is not generated again.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_DOI_INT. 
Data overrun interrupt. Before this  Interrupt is cleared , STATUS[DOR] must be cleared to avoid setting of this 
Interrupt again.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCSI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_FCSI_INT.
Fault confinement state changed interrupt. Interrupt is set when node turns error-passive (from error-active),
bus-off (from error-passive) or error-active (from bus-off after reintegration or from error-passive).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_ALI_INT.
Arbitration lost interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_BEI_INT.
Bus error interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_OFI_INT.
Overload frame interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_RXFI_INT.
RX buffer full interrupt.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_BSI_INT.
Bit rate shifted interrupt.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBNEI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_RBNEI_INT.
RX buffer not empty interrupt. Clearing this interrupt and not reading out content of RX Buffer via RX_DATA
will re-activate the interrupt.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBHCI_INT_ST</name>
              <description>The masked interrupt status of TWAIFD_TXBHCI_INT.
TXT buffer HW command interrupt. Anytime TXT buffer receives HW command from CAN Core which
changes TXT buffer state to &quot;TX OK&quot;, &quot;Error&quot; or &quot;Aborted&quot;, this interrupt will be generated.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_SET</name>
          <description>TWAI FD interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_RXI_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_TXI_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWLI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_EWLI_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_DOI_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCSI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_FCSI_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_ALI_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_BEI_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_OFI_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_RXFI_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_BSI_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBNEI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_RBNEI_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBHCI_INT_ENA_MASK</name>
              <description>Write 1 to enable TWAIFD_TXBHCI_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENA_CLR</name>
          <description>TWAI FD interrupt enable clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_RXI_INT_ENA .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_TXI_INT_ENA .</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EWLI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_EWLI_INT_ENA .</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DOI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_DOI_INT_ENA .</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FCSI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_FCSI_INT_ENA .</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ALI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_ALI_INT_ENA .</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BEI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_BEI_INT_ENA .</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OFI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_OFI_INT_ENA .</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXFI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_RXFI_INT_ENA .</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BSI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_BSI_INT_ENA .</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RBNEI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_RBNEI_INT_ENA .</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBHCI_INT_ENA_CLR</name>
              <description>Write 1 to clear TWAIFD_TXBHCI_INT_ENA .</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_MASK_SET</name>
          <description>TWAI FD interrupt mask register</description>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_RXI_INT.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_TXI_INT.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EWLI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_EWLI_INT.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_DOI_INT.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FCSI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_FCSI_INT.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_ALI_INT.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BEI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_BEI_INT.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_OFI_INT.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXFI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_RXFI_INT.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BSI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_BSI_INT.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBNEI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_RBNEI_INT.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXBHCI_INT_MASK_SET</name>
              <description>Write 1 to mask TWAIFD_TXBHCI_INT.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_MASK_CLR</name>
          <description>TWAI FD interrupt mask clear register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RXI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_RXI_INT_MASK_CLR .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_TXI_INT_MASK_CLR .</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EWLI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_EWLI_INT_MASK_CLR .</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DOI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_DOI_INT_MASK_CLR .</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FCSI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_FCSI_INT_MASK_CLR .</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ALI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_ALI_INT_MASK_CLR .</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BEI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_BEI_INT_MASK_CLR .</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>OFI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_OFI_INT_MASK_CLR .</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXFI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_RXFI_INT_MASK_CLR .</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BSI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_BSI_INT_MASK_CLR .</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RBNEI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_RBNEI_INT_MASK_CLR .</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXBHCI_INT_MASK_CLR</name>
              <description>Write 1 to clear TWAIFD_TXBHCI_INT_MASK_CLR .</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR</name>
          <description>TWAI FD bit-timing  register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x1050a185</resetValue>
          <fields>
            <field>
              <name>PROP</name>
              <description>Configures the propagation segment of nominal bit rate.
Measurement unit: time quanta</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH1</name>
              <description>Configures the phase 1 segment of nominal bit rate.
Measurement unit: time quanta</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH2</name>
              <description>Configures the phase 2 segment of nominal bit rate.
Measurement unit: time quanta</description>
              <bitOffset>13</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRP</name>
              <description>Configures the baud-rate prescaler of nominal bit rate.
Measurement unit: cycle of core clock.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SJW</name>
              <description>Represents the synchronization jump width in nominal bit time.
Measurement unit: time quanta</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BTR_FD</name>
          <description>TWAI FD bit-timing of FD register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x10206183</resetValue>
          <fields>
            <field>
              <name>PROP_FD</name>
              <description>Configures the propagation segment of data bit rate.
Measurement unit: time quanta</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH1_FD</name>
              <description>Configures the phase 1 segment of data bit rate.
Measurement unit: time quanta</description>
              <bitOffset>7</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PH2_FD</name>
              <description>Configures the phase 2 segment of data bit rate.
Measurement unit: time quanta</description>
              <bitOffset>13</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRP_FD</name>
              <description>Configures the baud-rate prescaler of data bit rate.
Measurement unit: cycle of core clock.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SJW_FD</name>
              <description>Represents the synchronization jump width in data bit time.
Measurement unit: time quanta</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
