esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
In host mode, indicates the byte count of the received IN data packet.

In device mode, indicates the byte count of the received data packet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID (DPID)

In host mode, indicates the Data PID of the received packet. In device mode, indicates the Data PID of the received OUT data packet.
 - 2'b00: DATA0
 - 2'b10: DATA1
 - 2'b01: DATA2
 - 2'b11: MDATA 
Reset: 2'h0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet Status (PktSts) indicates the status of the received packet.
In host mode, 
 - 4'b0010: IN data packet received
 - 4'b0011: IN transfer completed (triggers an interrupt)
 - 4'b0101: Data toggle error (triggers an interrupt)
 - 4'b0111: Channel halted (triggers an interrupt)
 - Others: Reserved
Reset:4'b0

In device mode,
 - 4'b0001: Global OUT NAK (triggers an interrupt)
 - 4'b0010: OUT data packet received
 - 4'b0011: OUT transfer completed (triggers an interrupt)
 - 4'b0100: SETUP transaction completed (triggers an interrupt)
 - 4'b0110: SETUP data packet received
 - Others: Reserved
Reset:4'h0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FN</name>
              <description>Mode: Device only
Frame Number (FN)
This is the least significant 4 bits of the (micro)Frame number in which the packet is received on the USB. This field is supported only when isochronous OUT endpoints are supported.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRXSTSP</name>
          <description>Receive Status Read/Pop Register A read to the Receive Status Read and Pop register returns the contents of the top of the Receive FIFO and additionally pops the top data entry out of the RxFIFO. The receive status contents must be interpreted differently in Host and Device modes. The core ignores the receive status pop/read when the receive FIFO is empty and returns a value of 32'h0000_0000. The application must only pop the Receive Status FIFO when the Receive FIFO Non-Empty bit of the Core Interrupt register (GINTSTS.RxFLvl) is asserted.  Note:  - Use of these fields vary based on whether the core is functioning as a host or a device.  - Do not read this register's reset value before configuring the core because the read value is 'X' in the simulation.</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHNUM</name>
              <description>Channel Number (ChNum)
Mode: Host only
Indicates the channel number to which the current received packet belongs.
Endpoint Number (EPNum)
Mode: Device only
Indicates the endpoint number to which the current received packet belongs.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BCNT</name>
              <description>Byte Count (BCnt)

In host mode, indicates the byte count of the received IN data packet.

In device mode, indicates the byte count of the received data packet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Data PID (DPID)

In host mode, indicates the Data PID of the received packet. In device mode, indicates the Data PID of the received OUT data packet.
 - 2'b00: DATA0
 - 2'b10: DATA1
 - 2'b01: DATA2
 - 2'b11: MDATA 
Reset: 2'h0</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTSTS</name>
              <description>Packet Status (PktSts) indicates the status of the received packet.
In host mode, 
 - 4'b0010: IN data packet received
 - 4'b0011: IN transfer completed (triggers an interrupt)
 - 4'b0101: Data toggle error (triggers an interrupt)
 - 4'b0111: Channel halted (triggers an interrupt)
 - Others: Reserved
Reset:4'b0

In device mode,
 - 4'b0001: Global OUT NAK (triggers an interrupt)
 - 4'b0010: OUT data packet received
 - 4'b0011: OUT transfer completed (triggers an interrupt)
 - 4'b0100: SETUP transaction completed (triggers an interrupt)
 - 4'b0110: SETUP data packet received
 - Others: Reserved
Reset:4'h0</description>
              <bitOffset>17</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FN</name>
              <description>Mode: Device only
Frame Number (FN)
This is the least significant 4 bits of the (micro)Frame number in which the packet is received on the USB. This field is supported only when isochronous OUT endpoints are supported.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GRXFSIZ</name>
          <description>Receive FIFO Size Register The application can program the RAM size that must be allocated to the RxFIFO.</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>RXFDEP</name>
              <description>Mode: Host and Device
RxFIFO Depth (RxFDep)
This value is in terms of 32-bit words.
 - Minimum value is 16
 - Maximum value is 32,768
The power-on reset value of this register is specified as the Largest Rx Data FIFO Depth during configuration.
If Enable Dynamic FIFO Sizing is selected in coreConsultant, these flops are optimized, and reads return the power-on value.
If Enable Dynamic FIFO Sizing is selected in coreConsultant, you can write a new value in this field. Programmed values must not exceed the power-on value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GNPTXFSIZ</name>
          <description>Non-periodic Transmit FIFO Size Register The application can program the RAM size and the memory start address for the Non-periodic TxFIFO  Note: The fields of this register change depending on host or device mode.</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <resetValue>0x1000100</resetValue>
          <fields>
            <field>
              <name>NPTXFSTADDR</name>
              <description>Non-periodic Transmit RAM Start Address (NPTxFStAddr)
For host mode, this field is always valid.
This field contains the memory start address for Non-periodic Transmit FIFO RAM. 
 - This field is determined during coreConsultant configuration by Enable Dynamic FIFO Sizing? (OTG_DFIFO_DYNAMIC):OTG_DFIFO_DYNAMIC = 0
These flops are optimized, and reads return the power-on value.
 - OTG_DFIFO_DYNAMIC = 1 The application can write a new value in this field. Programmed values must not exceed the power-on value set in coreConsultant.
Programmed values must not exceed the power-on value set in coreConsultant.
The power-on reset value of this field is specified during coreConsultant configuration by Largest Rx Data FIFO Depth (parameter OTG_RX_DFIFO_DEPTH).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPTXFDEP</name>
              <description>Mode: Host only
Non-periodic TxFIFO Depth (NPTxFDep)
For host mode, this field is always valid.
For device mode, this field is valid only when OTG_EN_DED_TX_FIFO=0.
This value is in terms of 32-bit words.
 - Minimum value is 16
 - Maximum value is 32,768
This attribute of field is determined during coreConsultant configuration by Enable Dynamic FIFO Sizing? (OTG_DFIFO_DYNAMIC):
 - OTG_DFIFO_DYNAMIC = 0: These flops are optimized, and reads return the power-on value.
 - OTG_DFIFO_DYNAMIC = 1: The application can write a new value in this field. Programmed values must not exceed the power-on value set in coreConsultant.
The power-on reset value of this field is specified during coreConsultant configuration as Largest IN Endpoint FIFO 0 Depth (parameter OTG_TX_DINEP_DFIFO_DEPTH_0).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GNPTXSTS</name>
          <description>Non-periodic Transmit FIFO/Queue Status Register In Device mode, this register is valid only in Shared FIFO operation. This read-only register contains the free space information for the Non-periodic TxFIFO and the Non-periodic Transmit Request Queue.</description>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <resetValue>0x40100</resetValue>
          <fields>
            <field>
              <name>NPTXFSPCAVAIL</name>
              <description>Non-periodic TxFIFO Space Avail (NPTxFSpcAvail)
Indicates the amount of free space available in the Non-periodic TxFIFO.
Values are in terms of 32-bit words.
 - 16'h0: Non-periodic TxFIFO is full
 - 16'h1: 1 word available
 - 16'h2: 2 words available
 - 16'hn: n words available (where 0 &lt;= n &lt;= 32,768)
 - 16'h8000: 32,768 words available
 - Others: Reserved
  Reset: Configurable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQSPCAVAIL</name>
              <description>Non-periodic Transmit Request Queue Space Available (NPTxQSpcAvail)
Indicates the amount of free space available in the Non-periodic Transmit Request Queue. This queue holds both IN and OUT requests in Host mode. Device mode has only IN requests.
 - 8'h0: Non-periodic Transmit Request Queue is full
 - 8'h1: 1 location available
 - 8'h2: 2 locations available
 - n: n locations available (0 &lt;= n &lt;= 8)
 - Others: Reserved
  Reset: Configurable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQTOP</name>
              <description>Top of the Non-periodic Transmit Request Queue (NPTxQTop)
Entry in the Non-periodic Tx Request Queue that is currently being processed by the MAC.

