esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
 - Bits [30:27]: Channel/endpoint number
 - Bits [26:25]:
 - 2'b00: IN/OUT token
 -- 2'b01: Zero-length transmit packet (device IN/host OUT)
 -- 2'b10: PING/CSPLIT token
 -- 2'b11: Channel halt command
 - Bit [24]: Terminate (last Entry for selected channel/endpoint)
 Reset: 7'h0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GSNPSID</name>
          <description>Synopsys ID Register  This read-only register contains the release number of the core being used.</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x4f54400a</resetValue>
          <fields>
            <field>
              <name>SYNOPSYSID</name>
              <description>Release number of the controller being used currently.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG1</name>
          <description>User Hardware Configuration 1 Register  This register contains the logical endpoint direction(s) selected using coreConsultant.</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EPDIR</name>
              <description>This 32-bit field uses two bits per 
endpoint to determine the endpoint direction.

Endpoint
 - Bits [31:30]: Endpoint 15 direction
 - Bits [29:28]: Endpoint 14 direction
...
 - Bits [3:2]: Endpoint 1 direction
 - Bits[1:0]: Endpoint 0 direction (always BIDIR)
Direction
 - 2'b00: BIDIR (IN and OUT) endpoint
 - 2'b01: IN endpoint
 - 2'b10: OUT endpoint
 - 2'b11: Reserved
Note: This field is configured using the OTG_EP_DIR_1(n) parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG2</name>
          <description>User Hardware Configuration 2 Register  This register contains configuration options selected using coreConsultant.</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <resetValue>0x224dd930</resetValue>
          <fields>
            <field>
              <name>OTGMODE</name>
              <description>Mode of Operation (OtgMode)
 - 3'b000: HNP- and SRP-Capable OTG (Host &amp; Device)
 - 3'b001: SRP-Capable OTG (Host &amp; Device)
 - 3'b010: Non-HNP and Non-SRP Capable OTG (Host and Device)
 - 3'b011: SRP-Capable Device
 - 3'b100: Non-OTG Device
 - 3'b101: SRP-Capable Host
 - 3'b110: Non-OTG Host
 - Others: Reserved
Note: This field is configured using the OTG_MODE parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTGARCH</name>
              <description>Architecture (OtgArch)
 - 2'b00: Slave-Only
 - 2'b01: External DMA
 - 2'b10: Internal DMA
 - Others: Reserved
Note: This field is configured using the OTG_ARCHITECTURE parameter.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINGPNT</name>
              <description>Point-to-Point (SingPnt)
 - 1'b0: Multi-point application  (hub and split support)
 - 1'b1: Single-point application (no hub and split support)
Note: This field is configured using the OTG_SINGLE_POINT parameter.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSPHYTYPE</name>
              <description>High-Speed PHY Interface Type (HSPhyType)
 - 2'b00: High-Speed interface not supported
 - 2'b01: UTMI+
 - 2'b10: ULPI
 - 2'b11: UTMI+ and ULPI
Note: This field is configured using the OTG_HSPHY_INTERFACE parameter.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSPHYTYPE</name>
              <description>Full-Speed PHY Interface Type (FSPhyType)
 - 2'b00: Full-speed interface not supported
 - 2'b01: Dedicated full-speed interface
 - 2'b10: FS pins shared with UTMI+ pins
 - 2'b11: FS pins shared with ULPI pins
Note: This field is configured using the OTG_FSPHY_INTERFACE parameter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMDEVEPS</name>
              <description>Number of Device Endpoints (NumDevEps)

Indicates the number of device endpoints supported by the core in Device mode.

The range of this field is 0-15.

Note: This field is configured using the OTG_NUM_EPS parameter.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NUMHSTCHNL</name>
              <description>Number of Host Channels (NumHstChnl)
Indicates the number of host channels supported by the core in Host mode. The range of this field is 0-15: 0 specifies 1 channel, 15 specifies 16 channels.

Note: This field is configured using the OTG_NUM_HOST_CHAN parameter.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PERIOSUPPORT</name>
              <description>Periodic OUT Channels Supported in Host Mode (PerioSupport)
 - 1'b0: No
 - 1'b1: Yes
Note: This field is configured using the OTG_EN_PERIO_HOST parameter.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DYNFIFOSIZING</name>
              <description>Dynamic FIFO Sizing Enabled (DynFifoSizing)
 - 1'b0: No
 - 1'b1: Yes
Note: This field is configured using the OTG_DFIFO_DYNAMIC parameter.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTIPROCINTRPT</name>
              <description>Multi Processor Interrupt Enabled (MultiProcIntrpt)
 - 1'b0: No
 - 1'b1: Yes
Note: This field is configured using the OTG_MULTI_PROC_INTRPT parameter.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPTXQDEPTH</name>
              <description>Non-periodic Request Queue Depth (NPTxQDepth)
 - 2'b00: 2
 - 2'b01: 4
 - 2'b10: 8
 - Others: Reserved
Note: This field is configured using the OTG_NPERIO_TX_QUEUE_DEPTH parameter.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQDEPTH</name>
              <description>Host Mode Periodic Request Queue Depth (PTxQDepth)
 - 2'b00: 2
 - 2'b01: 4
 - 2'b10: 8
 - 2'b11:16
Note: This field is configured using the OTG_PERIO_TX_QUEUE_DEPTH parameter.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TKNQDEPTH</name>
              <description>Device Mode IN Token Sequence Learning Queue Depth (TknQDepth)
Range: 0-30

