esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
Note: This field is configured using the OTG_TOKEN_QUEUE_DEPTH parameter.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG3</name>
          <description>User Hardware Configuration 3 Register</description>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <resetValue>0xc804b5</resetValue>
          <fields>
            <field>
              <name>XFERSIZEWIDTH</name>
              <description>Width of Transfer Size Counters (XferSizeWidth)
 - 4'b0000: 11 bits
 - 4'b0001: 12 bits
...
 - 4'b1000: 19 bits
 - Others: Reserved
Note: This field is configured using the OTG_PACKET_COUNT_WIDTH parameter.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKTSIZEWIDTH</name>
              <description>Width of Packet Size Counters (PktSizeWidth)
 - 3'b000: 4 bits
 - 3'b001: 5 bits
 - 3'b010: 6 bits
 - 3'b011: 7 bits
 - 3'b100: 8 bits
 - 3'b101: 9 bits
 - 3'b110: 10 bits
 - Others: Reserved
Note: This field is configured using the OTG_PACKET_COUNT_WIDTH parameter.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTGEN</name>
              <description>OTG Function Enabled (OtgEn)

The application uses this bit to indicate the OTG capabilities of the controller .
 - 1'b0: Not OTG capable
 - 1'b1: OTG Capable
Note: This field is configured using the OTG_MODE parameter.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>I2CINTSEL</name>
              <description>I2C Selection (I2CIntSel)
 - 1'b0: I2C Interface is not available on the controller.
 - 1'b1: I2C Interface is available on the controller.
Note: This field is configured using the OTG_I2C_INTERFACE parameter.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VNDCTLSUPT</name>
              <description>Vendor Control Interface Support (VndctlSupt)

 - 1'b0: Vendor Control Interface is not available on the core.
 - 1'b1: Vendor Control Interface is available.
Note: This field is configured using the OTG_VENDOR_CTL_INTERFACE parameter.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OPTFEATURE</name>
              <description>Optional Features Removed (OptFeature)
Indicates whether the User ID register, GPIO interface ports, and SOF toggle and counter ports were removed for gate count optimization by enabling Remove Optional Features.
 - 1'b0: No
 - 1'b1: Yes
Note: This field is configured using the OTG_RM_OPT_FEATURES parameter.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RSTTYPE</name>
              <description>Reset Style for Clocked always Blocks in RTL (RstType)
 - 1'b0: Asynchronous reset is used in the controller
 - 1'b1: Synchronous reset is used in the controller
Note: This field is configured using the OTG_SYNC_RESET_TYPE parameter.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADPSUPPORT</name>
              <description>This bit indicates whether ADP logic is present within or external to the controller
 - 0: No ADP logic present with the controller
 - 1: ADP logic is present along with the controller.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSICMODE</name>
              <description>HSIC mode specified for Mode of Operation
Value Range: 0 - 1
 - 1: HSIC-capable with shared UTMI PHY interface
 - 0: Non-HSIC-capable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BCSUPPORT</name>
              <description>This bit indicates the controller support for Battery Charger.
 - 0 - No Battery Charger Support
 - 1 - Battery Charger support present</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPMMODE</name>
              <description>LPM mode specified for Mode of Operation.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DFIFODEPTH</name>
              <description>DFIFO Depth (DfifoDepth - EP_LOC_CNT)

This value is in terms of 32-bit words.
 - Minimum value is 32
 - Maximum value is 32,768
Note: This field is configured using the OTG_DFIFO_DEPTH parameter. For more information on EP_LOC_CNT, see the Endpoint Information Controller (EPINFO_CTL) section.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GHWCFG4</name>
          <description>User Hardware Configuration 4 Register  Note Bit [31] is available only when Scatter/Gather DMA mode is enabled. When Scatter/Gather DMA mode is disabled, this field is reserved.</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <resetValue>0xd3f0a030</resetValue>
          <fields>
            <field>
              <name>NUMDEVPERIOEPS</name>
              <description>Number of Device Mode Periodic IN Endpoints (NumDevPerioEps)

