esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
Values are in terms of 32-bit words
 - 16'h0    : Periodic TxFIFO is full
 - 16'h1    : 1 word available
 - 16'h2    : 2 words available
 - 16'hn    : n words available (where 0  n  32,768)
 - 16'h8000 : 32,768 words
 - Others   : Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQSPCAVAIL</name>
              <description>Periodic Transmit Request Queue Space Available (PTxQSpcAvail)

Indicates the number of free locations available to be written in the Periodic Transmit Request Queue. This queue holds both IN and OUT requests.
 - 8'h0: Periodic Transmit Request Queue is full
 - 8'h1: 1 location available
 - 8'h2: 2 locations available
 - n: n locations available (0 &lt;= n &lt;= 16)
 - Others: Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PTXQTOP</name>
              <description>Top of the Periodic Transmit Request Queue (PTxQTop)

This indicates the Entry in the Periodic Tx Request Queue that is
currently being processes by the MAC.

This register is used for debugging.
 - Bit [31]: Odd/Even (micro)Frame
 -- 1'b0: send in even (micro)Frame
 -- 1'b1: send in odd (micro)Frame
 - Bits [30:27]: Channel/endpoint number
 - Bits [26:25]: Type
 -- 2'b00: IN/OUT
 -- 2'b01: Zero-length packet
 -- 2'b10: CSPLIT
 -- 2'b11: Disable channel command
 - Bit [24]: Terminate (last Entry for the selected channel/endpoint)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINT</name>
          <description>Host All Channels Interrupt Register  When a significant event occurs on a channel, the Host All Channels Interrupt register interrupts the application using the Host Channels Interrupt bit of the Core Interrupt register (GINTSTS.HChInt). This is shown in the Interrupt Hierarchy figure in the databook. There is one interrupt bit per channel, up to a maximum of 16 bits. Bits in this register are set and cleared when the application sets and clears bits in the corresponding Host Channel-n Interrupt register.</description>
          <addressOffset>0x414</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HAINT</name>
              <description>Channel Interrupt for channel no.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HAINTMSK</name>
          <description>Host All Channels Interrupt Mask Register  The Host All Channel Interrupt Mask register works with the Host All Channel Interrupt register to interrupt the application when an event occurs on a channel. There is one interrupt mask bit per channel, up to a maximum of 16 bits.</description>
          <addressOffset>0x418</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HAINTMSK</name>
              <description>Channel Interrupt Mask (HAINTMsk)
One bit per channel: Bit 0 for channel 0, bit 15 for channel 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HFLBAddr</name>
          <description>Host Frame List Base Address Register  This register is present only in case of Scatter/Gather DMA. It is implemented as flops. This register holds the starting address of the Frame list information.</description>
          <addressOffset>0x41c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HFLBADDR_HFLBADDR</name>
              <description>The starting address of the Frame list.
This register is used only for Isochronous and Interrupt Channels.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPRT</name>
          <description>Host Port Control and Status Register  This register is available only in Host mode. Currently, the OTG Host supports only one port. A single register holds USB port-related information such as USB reset, enable, suspend, resume, connect status, and test mode for each port. It is shown in the Interrupt Hierarchy figure in the databook. The R_SS_WC bits in this register can trigger an interrupt to the application through the Host Port Interrupt bit of the Core Interrupt register (GINTSTS.PrtInt). On a Port Interrupt, the application must read this register and clear the bit that caused the interrupt. For the R_SS_WC bits, the application must write a 1 to the bit to clear the interrupt.</description>
          <addressOffset>0x440</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRTCONNSTS</name>
              <description>Port Connect Status (PrtConnSts)
 - 0: No device is attached to the port.
 - 1: A device is attached to the port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRTCONNDET</name>
              <description>Port Connect Detected (PrtConnDet)

The core sets this bit when a device connection is detected
to trigger an interrupt to the application using the Host Port
Interrupt bit of the Core Interrupt register (GINTSTS.PrtInt).This bit can be set only by the core and the application should write 1 to clear it.The application must write a 1 to this bit to clear the
interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTENA</name>
              <description>Port Enable (PrtEna)

A port is enabled only by the core after a reset sequence,
and is disabled by an overcurrent condition, a disconnect
condition, or by the application clearing this bit. The
application cannot Set this bit by a register write. It can only
clear it to disable the port by writing 1. This bit does not trigger any
interrupt to the application.
 - 1'b0: Port disabled
 - 1'b1: Port enabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTENCHNG</name>
              <description>Port Enable/Disable Change (PrtEnChng)

The core sets this bit when the status of the Port Enable bit [2] of this register changes.This bit can be set only by the core and the application should write 1 to clear it.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTOVRCURRACT</name>
              <description>Port Overcurrent Active (PrtOvrCurrAct)

Indicates the overcurrent condition of the port.
 - 1'b0: No overcurrent condition
 - 1'b1: Overcurrent condition</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRTOVRCURRCHNG</name>
              <description>Port Overcurrent Change (PrtOvrCurrChng)

The core sets this bit when the status of the Port Overcurrent Active bit (bit 4) in this register changes.This bit can be set only by the core and the application should write 1 to clear it</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTRES</name>
              <description>Port Resume (PrtRes)

The application sets this bit to drive resume signaling on the
port. The core continues to drive the resume signal until the
application clears this bit.

If the core detects a USB remote wakeup sequence, as
indicated by the Port Resume/Remote Wakeup Detected
Interrupt bit of the Core Interrupt register
(GINTSTS.WkUpInt), the core starts driving resume
signaling without application intervention and clears this bit
when it detects a disconnect condition. The read value of
this bit indicates whether the core is currently driving
resume signaling.
 - 1'b0: No resume driven
 - 1'b1: Resume driven
When LPM is enabled, In L1 state the behavior of this bit is as follows:
The application sets this bit to drive resume signaling on the port.
The core continues to drive the resume signal until a pre-determined time
specified in GLPMCFG.HIRD_Thres[3:0] field. If the core detects a USB remote
wakeup sequence, as indicated by the Port L1Resume/Remote L1Wakeup Detected 
Interrupt bit of the Core Interrupt register (GINTSTS.L1WkUpInt), 
the core starts driving resume signaling without application intervention
and clears this bit at the end of resume.This bit can be set by both core or application
and also cleared by core or application. This bit is cleared by the core even if there is
no device connected to the Host.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTSUSP</name>
              <description>Port Suspend (PrtSusp)

The application sets this bit to put this port in Suspend
mode. The core only stops sending SOFs when this is Set.
To stop the PHY clock, the application must Set the Port
Clock Stop bit, which asserts the suspend input pin of the
PHY.

The read value of this bit reflects the current suspend status
of the port. This bit is cleared by the core after a remote
wakeup signal is detected or the application sets the Port
Reset bit or Port Resume bit in this register or the
Resume/Remote Wakeup Detected Interrupt bit or
Disconnect Detected Interrupt bit in the Core Interrupt
register (GINTSTS.WkUpInt or GINTSTS.DisconnInt,
respectively).This bit is cleared by the core even if there is
no device connected to the Host.
 - 1'b0: Port not in Suspend mode
 - 1'b1: Port in Suspend mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTRST</name>
              <description>Port Reset (PrtRst)

When the application sets this bit, a reset sequence is
started on this port. The application must time the reset
period and clear this bit after the reset sequence is
complete.
 - 1'b0: Port not in reset
 - 1'b1: Port in reset
The application must leave this bit set for at least a
minimum duration mentioned below to start a reset on the
port. The application can leave it set for another 10 ms in
addition to the required minimum duration, before clearing
the bit, even though there is no maximum limit Set by the
USB standard.This bit is cleared by the core even if there is
no device connected to the Host.
 - High speed: 50 ms
 - Full speed/Low speed: 10 ms</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTLNSTS</name>
              <description>Port Line Status (PrtLnSts)

Indicates the current logic level USB data lines
 - Bit [10]: Logic level of D+
 - Bit [11]: Logic level of D-</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRTPWR</name>
              <description>Port Power (PrtPwr)

The application uses this field to control power to this port (write 1'b1 to set to 1'b1
and write 1'b0 to set to 1'b0), and the core can clear this bit on an over current
condition.
 - 1'b0: Power off
 - 1'b1: Power on

Note: This bit is interface independent. The application needs to program this bit for all interfaces as described in the host programming flow in the Programming Guide.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRTTSTCTL</name>
              <description>Port Test Control (PrtTstCtl)

The application writes a nonzero value to this field to put the port into a Test mode, and the corresponding pattern is signaled on the port.
 - 4'b0000: Test mode disabled
 - 4'b0001: Test_J mode
 - 4'b0010: Test_K mode
 - 4'b0011: Test_SE0_NAK mode
 - 4'b0100: Test_Packet mode
 - 4'b0101: Test_Force_Enable
 - Others: Reserved

