esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
[31:9]: DMA Address (DMAAddr)

The start address must be 512-bytes aligned.

This field holds the start address of the 512 bytes page. The first descriptor in the list should be located in this address. The first descriptor may be or may not be ready. The core starts processing the list from the CTD value. 

[8:3]: Current Transfer Desc(CTD)

This value is in terms of number of descriptors. The values can be from 0 to 63. 
 - 0 -  1 descriptor. 
 - 63 - 64 descriptors. 
This field indicates the current descriptor processed in the list. This field is updated both by application and the core. For example, if the application enables the channel after programming CTD=5, then the core will start processing the sixth descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to DMAAddr.

Reset: 6'h0

[2:0]: Reserved

In Scatter-Gather DMA (DescDMA) Mode for Isochronous:

[31:N]: DMA Address (DMAAddr)

The start address must be 512-bytes aligned.

This field holds the address of the 2*(nTD+1) bytes of locations in which the isochronous descriptors are present where N is based on nTD as follows:
 - [31:N]: Base Address
 - [N-1:3]: Offset
 - [2:0]: 000
For HS ISOC, if nTD is,
 - 7, N=6
 - 15, N=7
 - 31, N=8
 - 63, N=9
 - 127, N=10
 - 255, N=11
For FS ISOC, if nTD is, 
 - 1, N=4
 - 3, N=5
 - 7, N=6
 - 15, N=7
 - 31, N=8
 - 63, N=9
[N-1:3]: Current Transfer Desc(CTD)

CTD for isochronous is based on the current frame/(micro)frame value. Need to be set to zero by application.

Reset: (N+1:3)'h0

[2:0]: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCDMAB4</name>
          <description>Host Channel $i DMA Buffer Address Register  This register is present only in case of Scatter/Gather DMA. It is implemented in RAM instead of flop-based implementation. This register holds the current buffer address.</description>
          <addressOffset>0x59c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HCDMAB</name>
              <description>Holds the current buffer address.
This register is updated as and when the data transfer for the corresponding end point 
is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise this 
field is reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCCHAR5</name>
          <description>Host Channel 5 Characteristics Register</description>
          <addressOffset>0x5a0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)

Indicates the maximum packet size of the associated endpoint.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPNUM</name>
              <description>Endpoint Number (EPNum)

Indicates the endpoint number on the device serving as the data source or sink.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPDIR</name>
              <description>Endpoint Direction (EPDir)

Indicates whether the transaction is IN or OUT.
 - 1'b0: OUT
 - 1'b1: IN</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LSPDDEV</name>
              <description>Low-Speed Device (LSpdDev)

This field is Set by the application to indicate that this channel is communicating to a low-speed device.

The application must program this bit when a low speed device is connected to the host through an FS HUB. The DWC_otg Host core uses this field to drive the XCVR_SELECT signal to 2'b11 while communicating to the LS Device through the FS hub.

Note: In a peer to peer setup, the DWC_otg Host core ignores this bit even if it is set by the application software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)

Indicates the transfer type selected.
 - 2'b00: Control
 - 2'b01: Isochronous
 - 2'b10: Bulk
 - 2'b11: Interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EC</name>
              <description>Multi Count (MC) / Error Count (EC)

When the Split Enable bit of the Host Channel-n Split Control
register (HCSPLTn.SpltEna) is reset (1'b0), this field indicates to
the host the number of transactions that must be executed per
microframe for this periodic endpoint. For non periodic transfers,
this field is used only in DMA mode, and specifies the number
packets to be fetched for this channel before the internal DMA
engine changes arbitration.
 - 2'b00: Reserved This field yields undefined results.
 - 2'b01: 1 transaction
 - 2'b10: 2 transactions to be issued for this endpoint per microframe
 - 2'b11: 3 transactions to be issued for this endpoint per microframe
When HCSPLTn.SpltEna is Set (1'b1), this field indicates the
number of immediate retries to be performed for a periodic split
transactions on transaction errors. This field must be Set to at
least 2'b01.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVADDR</name>
              <description>Device Address (DevAddr)

This field selects the specific device serving as the data source
or sink.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ODDFRM</name>
              <description>Odd Frame (OddFrm)

