esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
[31:9]: DMA Address (DMAAddr)

The start address must be 512-bytes aligned.

This field holds the start address of the 512 bytes page. The first descriptor in the list should be located in this address. The first descriptor may be or may not be ready. The core starts processing the list from the CTD value. 

[8:3]: Current Transfer Desc(CTD)

This value is in terms of number of descriptors. The values can be from 0 to 63. 
 - 0 -  1 descriptor. 
 - 63 - 64 descriptors. 
This field indicates the current descriptor processed in the list. This field is updated both by application and the core. For example, if the application enables the channel after programming CTD=5, then the core will start processing the sixth descriptor. The address is obtained by adding a value of (8bytes*5=) 40(decimal) to DMAAddr.

Reset: 6'h0

[2:0]: Reserved

In Scatter-Gather DMA (DescDMA) Mode for Isochronous:

[31:N]: DMA Address (DMAAddr)

The start address must be 512-bytes aligned.

This field holds the address of the 2*(nTD+1) bytes of locations in which the isochronous descriptors are present where N is based on nTD as follows:
 - [31:N]: Base Address
 - [N-1:3]: Offset
 - [2:0]: 000
For HS ISOC, if nTD is,
 - 7, N=6
 - 15, N=7
 - 31, N=8
 - 63, N=9
 - 127, N=10
 - 255, N=11
For FS ISOC, if nTD is, 
 - 1, N=4
 - 3, N=5
 - 7, N=6
 - 15, N=7
 - 31, N=8
 - 63, N=9
[N-1:3]: Current Transfer Desc(CTD)

CTD for isochronous is based on the current frame/(micro)frame value. Need to be set to zero by application.

Reset: (N+1:3)'h0

[2:0]: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HCDMAB7</name>
          <description>Host Channel $i DMA Buffer Address Register  This register is present only in case of Scatter/Gather DMA. It is implemented in RAM instead of flop-based implementation. This register holds the current buffer address.</description>
          <addressOffset>0x5fc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>HCDMAB</name>
              <description>Holds the current buffer address.
This register is updated as and when the data transfer for the corresponding end point 
is in progress. This register is present only in Scatter/Gather DMA mode. Otherwise this 
field is reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFG</name>
          <description>Device Configuration Register  This register configures the core in Device mode after power-on or after certain control commands or enumeration. Do not make changes to this register after initial programming.</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <resetValue>0x8000000</resetValue>
          <fields>
            <field>
              <name>DEVSPD</name>
              <description>Device Speed (DevSpd)

Indicates the speed at which the application requires the core to
enumerate, or the maximum speed the application can support.
However, the actual bus speed is determined only after the connect
sequence is completed, and is based on the speed of the USB
host to which the core is connected.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NZSTSOUTHSHK</name>
              <description>Non-Zero-Length Status OUT Handshake (NZStsOUTHShk)

The application can use this field to select the handshake the core sends on receiving a nonzero-length data packet during the OUT transaction of a control transfer's Status stage.
 - 1'b1: Send a STALL handshake on a nonzero-length status OUT transaction and do not send the received OUT packet to the application.
 - 1'b0: Send the received OUT packet to the application (zerolength or nonzero-length) and send a handshake based on the NAK and STALL bits for the endpoint in the Device Endpoint Control register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENA32KHZSUSP</name>
              <description>Enable 32 KHz Suspend mode (Ena32KHzSusp) 

This bit can be set only if FS PHY interface is selected. Otherwise, this bit needs to be set to zero. If FS PHY interface is chosen and this bit is set, the PHY clock during Suspend must be switched from 48 MHz to 32 KHz.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEVADDR</name>
              <description>Device Address (DevAddr)

The application must program this field after every SetAddress control command.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERFRINT</name>
              <description>Periodic Frame Interval (PerFrInt)

Indicates the time within a (micro)Frame at which the application
must be notified using the End Of Periodic Frame Interrupt. This
can be used to determine If all the isochronous traffic for that
(micro)Frame is complete.
 - 2'b00: 80% of the (micro)Frame interval
 - 2'b01: 85% of the (micro)Frame interval
 - 2'b10: 90% of the (micro)Frame interval
 - 2'b11: 95% of the (micro)Frame interval</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDEVOUTNAK</name>
              <description>Enable Device OUT NAK (EnDevOutNak)

