esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
A write to this field sets the Global Non-periodic IN NAK.The application uses this bit to send a NAK handshake on all non-periodic IN endpoints.
The core can also Set this bit when a timeout condition is detected on a non-periodic endpoint in shared FIFO operation.
The application must Set this bit only after making sure that the Global IN NAK Effective bit in the Core Interrupt Register (GINTSTS.GINNakEff) is cleared</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CGNPINNAK</name>
              <description>Clear Global Non-periodic IN NAK (CGNPInNak)

A write to this field clears the Global Non-periodic IN NAK.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SGOUTNAK</name>
              <description>Set Global OUT NAK (SGOUTNak)

A write to this field sets the Global OUT NAK. The application uses this bit to send a NAK handshake on all OUT endpoints.
The application must set the this bit only after making sure that the Global OUT NAK Effective bit in the Core Interrupt Register (GINTSTS.GOUTNakEff) is cleared.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CGOUTNAK</name>
              <description>Clear Global OUT NAK (CGOUTNak)

A write to this field clears the Global OUT NAK.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRONPRGDONE</name>
              <description>Power-On Programming Done (PWROnPrgDone)

The application uses this bit to indicate that register programming is completed after a wake-up from Power Down mode.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GMC</name>
              <description>Global Multi Count (GMC)

GMC must be programmed only once after initialization.
Applicable only for Scatter/Gather DMA mode. This indicates the number of packets to be serviced for that end point before moving to the next end point. It is only for non-periodic endpoints. 
 - 2'b00: Invalid.
 - 2'b01: 1 packet.
 - 2'b10: 2 packets.
 - 2'b11: 3 packets.
The value of this field automatically changes to 2'h1 when DCFG.DescDMA is set to 1. When Scatter/Gather DMA mode is disabled, this field is reserved. and reads 2'b00.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNRFRMNUM</name>
              <description>Ignore Frame Number Feature for Isochronous Endpoints (IgnrFrmNum)

This field is also used to control the Periodic Transfer Interrupt (PTI) feature.

Note: Do not program IgnrFrmNum bit to 1'b1 when the core is operating in threshold mode.

Slave Mode (GAHBCFG.DMAEn=0): 

This bit is not valid in Slave mode and should not be programmed to 1.

Scatter/Gather DMA Mode (GAHBCFG.DMAEn=1,DCFG.DescDMA=1): 

Note: When Scatter/Gather DMA mode is enabled this feature is not applicable to High Speed, High bandwidth transfers.

When this bit is enabled, there must be only one packet per descriptor. 
 - 0: The core transmits the packets only in the frame number in which they are intended to be transmitted. 
 - 1: The core ignores the frame number, sending packets immediately as the packets are ready.
In Scatter/Gather DMA mode, if this bit is enabled, the packets are not flushed when a ISOC IN token is received for an elapsed frame.

Non-Scatter/Gather DMA Mode, that is, Buffer DMA Mode (GAHBCFG.DMAEn=1,DCFG.DescDMA=0): 

When Scatter/Gather DMA mode is disabled, this field is used by the application to enable Periodic Transfer Interrupt (PTI) Mode.

The application can program Periodic Endpoint transfers for multiple (micro)Frames.
 - 0: Periodic Transfer Interrupt feature is disabled, application needs to program transfers for periodic endpoints every (micro)Frame
 - 1: Periodic Transfer Interrupt feature is enabled, application can program transfers for multiple (micro)Frames for periodic endpoints.
In the PTI mode, the application will receive Transfer Complete Interrupt after transfers for multiple (micro)Frames are completed.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NAKONBBLE</name>
              <description>NAK on Babble Error (NakOnBble)

Set NAK automatically on babble (NakOnBble). The core sets NAK automatically for the endpoint on which babble is received.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENCONTONBNA</name>
              <description>Enable Continue on BNA (EnContOnBNA)

This bit enables the core to continue on BNA for Bulk OUT endpoints. 
With this feature enabled, when a Bulk OUT or INTR OUT endpoint receives a BNA interrupt
the core starts processing the descriptor that caused the BNA interrupt after 
the endpoint re-enables the endpoint. 
 - 1'b0: After receiving BNA interrupt,the core disables the endpoint. When the endpoint is re-enabled by the application,the core starts processing from the DOEPDMA descriptor.
 - 1'b1: After receiving BNA interrupt, the core disables the endpoint. When the endpoint is re-enabled by the application, the core starts processing from the descriptor that received the BNA interrupt.

 This bit is valid only when OTG_EN_DESC_DMA == 1'b1. It is a one-time programmable after reset bit like any other DCTL register bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTS</name>
          <description>Device Status Register  This register indicates the status of the core with respect to USB-related events. It must be read on interrupts from Device All Interrupts (DAINT) register.</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>SUSPSTS</name>
              <description>Suspend Status (SuspSts)

In Device mode, this bit is set as long as a Suspend condition is
detected on the USB. The core enters the Suspend state
when there is no activity on the phy_line_state_i signal for an
extended period of time. The core comes out of the suspend under the following conditions :
 - If there is any activity on the phy_line_state_i signal, or
 - If the application writes to the Remote Wakeup Signaling bit in the Device Control register (DCTL.RmtWkUpSig).
When the core comes out of the suspend, this bit is set to 1'b0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENUMSPD</name>
              <description>Enumerated Speed (EnumSpd)

