esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
Indicates the total number of USB packets that constitute the Transfer Size amount of data for endpoint 0.

This field is decremented every time a packet (maximum size or short packet) is read from the TxFIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MC</name>
              <description>MC

Applies to IN endpoints only.

For periodic IN endpoints, this field indicates the number of packets that must be transmitted per microframe on the USB. The core uses this field to calculate the data PID for isochronous IN endpoints. 
 - 2'b01: 1 packet 
 - 2'b10: 2 packets 
 - 2'b11: 3 packets 
For non-periodic IN endpoints, this field is valid only in Internal DMA mode. It specifies the number of packets the core must fetchfor an IN endpoint before it switches to the endpoint pointed to by the Next Endpoint field of the Device Endpoint-n Control register (DIEPCTLn.NextEp)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA3</name>
          <description>Device IN Endpoint 3 DMA Address Register  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x974</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint
data.

Note: For control endpoints, this field stores control OUT data packets as well as
SETUP transaction data packets. When more than three SETUP packets are
received back-to-back, the SETUP data packet in the memory is overwritten.

This register is incremented on every AHB transaction. The application can give
only a DWORD-aligned address.
 - When Scatter/Gather DMA mode is not enabled, the application programs the start address value in this field.
 - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer for the descriptor list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS3</name>
          <description>Device IN Endpoint Transmit FIFO Status Register 3  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x978</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>INEPTXFSPCAVAIL</name>
              <description>IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)

Indicates the amount of free space available in the Endpoint TxFIFO.

Values are in terms of 32-bit words.
 - 16'h0: Endpoint TxFIFO is full
 - 16'h1: 1 word available
 - 16'h2: 2 words available
 - 16'hn: n words available (where 0  n  32,768)
 - 16'h8000: 32,768 words available
 - Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMAB3</name>
          <description>Device IN Endpoint 3 Buffer Address Register  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x97c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <description>Holds the current buffer address.This register is updated as and when the data
transfer for the corresponding end point is in progress.

This register is present only in Scatter/Gather DMA mode. Otherwise this field is
reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL4</name>
          <description>Device Control IN Endpoint 4 Control Register  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x980</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)

The application must program this field with the maximum packet size for the current logical endpoint. This value is in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)

Indicates whether this endpoint is active in the current configuration and interface. The
core clears this bit for all endpoints (other than EP 0) after detecting a USB reset. After
receiving the SetConfiguration and SetInterface commands, the application must
program endpoint registers accordingly and set this bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPID</name>
              <description>Endpoint Data PID (DPID)

Applies to interrupt/bulk IN and OUT endpoints only.

Contains the PID of the packet to be received or transmitted on this endpoint. The
application must program the PID of the first packet to be received or transmitted on
this endpoint, after the endpoint is activated. The applications use the SetD1PID and
SetD0PID fields of this register to program either DATA0 or DATA1 PID.
 - 1'b0: DATA0
 - 1'b1: DATA1
This field is applicable both for Scatter/Gather DMA mode and non-Scatter/Gather
DMA mode.

Even/Odd (Micro)Frame (EO_FrNum)

In non-Scatter/Gather DMA mode:

Applies to isochronous IN and OUT endpoints only.

Indicates the (micro)frame number in which the core transmits/receives isochronous
data for this endpoint. The application must program the even/odd (micro)frame
number in which it intends to transmit/receive isochronous data for this endpoint using
the SetEvnFr and SetOddFr fields in this register.
 - 1'b0: Even (micro)frame
 - 1'b1: Odd (micro)frame
When Scatter/Gather DMA mode is enabled, this field is reserved. The frame number
in which to send data is provided in the transmit descriptor structure. The frame in
which data is received is updated in receive descriptor structure.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)

Indicates the following:
 - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 - 1'b1: The core is transmitting NAK handshakes on this endpoint.
When either the application or the core sets this bit:
 - The core stops receiving any data on an OUT endpoint, even if there is space in the RxFIFO to accommodate the incoming packet.
 - For non-isochronous IN endpoints: The core stops transmitting any data on an IN endpoint, even if there data is available in the TxFIFO.
 - For isochronous IN endpoints: The core sends out a zero-length data packet, even if there data is available in the TxFIFO.
Irrespective of this bit's setting, the core always responds to SETUP data packets with an ACK handshake.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)
This is the transfer type supported by this logical endpoint.
 - 2'b00: Control
 - 2'b01: Isochronous
 - 2'b10: Bulk
 - 2'b11: Interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)

