esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
Indicates the total number of USB packets that constitute the Transfer Size amount of data for endpoint 0.

This field is decremented every time a packet (maximum size or short packet) is read from the TxFIFO.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MC</name>
              <description>MC

Applies to IN endpoints only.

For periodic IN endpoints, this field indicates the number of packets that must be transmitted per microframe on the USB. The core uses this field to calculate the data PID for isochronous IN endpoints. 
 - 2'b01: 1 packet 
 - 2'b10: 2 packets 
 - 2'b11: 3 packets 
For non-periodic IN endpoints, this field is valid only in Internal DMA mode. It specifies the number of packets the core must fetchfor an IN endpoint before it switches to the endpoint pointed to by the Next Endpoint field of the Device Endpoint-n Control register (DIEPCTLn.NextEp)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA6</name>
          <description>Device IN Endpoint 6 DMA Address Register  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9d4</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint
data.

Note: For control endpoints, this field stores control OUT data packets as well as
SETUP transaction data packets. When more than three SETUP packets are
received back-to-back, the SETUP data packet in the memory is overwritten.

This register is incremented on every AHB transaction. The application can give
only a DWORD-aligned address.
 - When Scatter/Gather DMA mode is not enabled, the application programs the start address value in this field.
 - When Scatter/Gather DMA mode is enabled, this field indicates the base pointer for the descriptor list.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS6</name>
          <description>Device IN Endpoint Transmit FIFO Status Register 6  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9d8</addressOffset>
          <size>32</size>
          <resetValue>0x100</resetValue>
          <fields>
            <field>
              <name>INEPTXFSPCAVAIL</name>
              <description>IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)

Indicates the amount of free space available in the Endpoint TxFIFO.

Values are in terms of 32-bit words.
 - 16'h0: Endpoint TxFIFO is full
 - 16'h1: 1 word available
 - 16'h2: 2 words available
 - 16'hn: n words available (where 0  n  32,768)
 - 16'h8000: 32,768 words available
 - Others: Reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMAB6</name>
          <description>Device IN Endpoint 6 Buffer Address Register  Note: This register exists for an endpoint i if the OTG_EP_DIR_i parameter is 0 or 1 for that endpoint.</description>
          <addressOffset>0x9dc</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DMABUFFERADDR</name>
              <description>Holds the current buffer address.This register is updated as and when the data
transfer for the corresponding end point is in progress.

This register is present only in Scatter/Gather DMA mode. Otherwise this field is
reserved.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOEPCTL0</name>
          <description>Device Control OUT Endpoint 0 Control Register</description>
          <addressOffset>0xb00</addressOffset>
          <size>32</size>
          <resetValue>0x8000</resetValue>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)

The maximum packet size for control OUT endpoint 0 is the same as what is programmed in control IN Endpoint 0.
 - 2'b00: 64 bytes
 - 2'b01: 32 bytes
 - 2'b10: 16 bytes
 - 2'b11: 8 bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)

This bit is always set to 1, indicating that a control endpoint 0 is always active in all configurations and interfaces.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)

Indicates the following:
 - 1'b0: The core is transmitting non-NAK handshakes based on the FIFO status.
 - 1'b1: The core is transmitting NAK handshakes on this endpoint.
When either the application or the core sets this bit, the core
stops receiving data, even If there is space in the RxFIFO to
accommodate the incoming packet. Irrespective of this bit's
setting, the core always responds to SETUP data packets with
an ACK handshake.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)

Hardcoded to 2'b00 for control.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNP</name>
              <description>RESERVED</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)

The application can only set this bit, and the core clears it, when
a SETUP token is received for this endpoint. If a NAK bit or
Global OUT NAK is Set along with this bit, the STALL bit takes
priority. Irrespective of this bit's setting, the core always
responds to SETUP data packets with an ACK handshake.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK (CNAK)

