esp-rs/esp-pacs/esp32h4/svd/esp32h4.base.svd
        <register>
          <name>CHANNEL_STATUS</name>
          <description>pad comp status reg</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CHANNEL_3_PAD_COMP_STATUS</name>
              <description>record the pad comp status for channel 3, 0 means now is neg int , 1 means now is pos int</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHANNEL_2_PAD_COMP_STATUS</name>
              <description>record the pad comp status for channel 2, 0 means now is neg int , 1 means now is pos int</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CHANNEL_1_PAD_COMP_STATUS</name>
              <description>record the pad comp status for channel 1, 0 means now is neg int , 1 means now is pos int</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAD_COMP_CFG</name>
          <description>pad comp cfg reg</description>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PAD_COMP_HYS</name>
              <description>hys cfg singal</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_COMP_HYS_EN</name>
              <description>enable hys function,only works while pad comp mode = 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_COMP_DREF</name>
              <description>internal vref cfg singal,0~2.3v step is 330mv</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_COMP_MODE</name>
              <description>pad comp mode cfg 1:external pad 0:internal vref</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_COMP_XPD</name>
              <description>pad comp xpd</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATE</name>
          <description>date reg</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0x2406180</resetValue>
          <fields>
            <field>
              <name>DATE</name>
              <description>zero det reg change date</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_EN</name>
              <description>reg clk en</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
